{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pb6jdi/%E0%A6%AA%E0%A6%95%E0%A6%B8%E0%A6%A4%E0%A6%A8_%E0%A6%9C%E0%A6%A8%E0%A6%A6%E0%A6%AC%E0%A6%A6_%E0%A6%B8%E0%A6%B2%E0%A6%97%E0%A6%A8_%E0%A6%B8%E0%A6%A8%E0%A6%A6%E0%A6%AC%E0%A6%AA%E0%A6%B0_%E0%A6%95%E0%A6%B0%E0%A6%A4_%E0%A6%B8%E0%A6%AE%E0%A6%AE%E0%A6%B2%E0%A6%A8/",
  "hash": "0259b30398562b07381df83053d05723",
  "scraped_at": "2025-12-08T11:44:07.938053",
  "title": "পাকিস্তান জিন্দাবাদ স্লোগান সন্দ্বীপের কেরাত সম্মেলনে",
  "description": null,
  "votes": "101",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "রক্ত কথা বলে",
      "votes": "58",
      "replies": []
    },
    {
      "text": "I think the country will head for another 1971",
      "votes": "51",
      "replies": []
    },
    {
      "text": "জুলাই যোদ্ধারা এখন ঘুমের ভান ধরে থাকবে",
      "votes": "63",
      "replies": [
        {
          "text": "July joddhara ase baul pidano, 24 diya 71 bodlano r 32 vangbo 🥂",
          "votes": "32",
          "replies": []
        },
        {
          "text": "কেন ? জুলাই যোদ্ধারা স্লোগান দিয়েছিলো : “তুমি কে আমি কে রাজাকার ! রাজাকার !” তোমার কি মনে হয় : সবাই sarcasm বোঝে? তারা সব মতবাদ কে সম্মান করেছে - platform দিয়েছে ! এরাও তাদের মতবাদ রাখছে ! পাকিস্তানের জয়জয়কার করা কি ভুল ? কেন ভুল ? ওনাদের বাকস্বাধীনতা আছে - ওরা সেটা ব্যবহার করছে",
          "votes": "6",
          "replies": [
            {
              "text": "যারা ৭১এ আমাদের লক্ষ লক্ষ মানুষদের বর্বরোচিত ভাবে হত্যা, ধর্ষণ ও লুন্ঠন করেছে তাদের জয়জয়কার করা ভুল কিনা জিজ্ঞেস করছেন? আর এতোই যখন বাকস্বাধীনতার উদারতা, তো কিছুদিন আগেই যে বাউলদের ধরে মারধর করা হোলো ধর্মানুভূতিতে আঘাত করার অজুহাতে তখনতো জুলাই যোদ্ধাদের আন্দোলন করতে দেখলাম না।",
              "votes": "4",
              "replies": []
            },
            {
              "text": "Voye kichu manusher pacha fete jae, because they all have skeletons in their closets. But eita USA te kichui na. Kichudin agei Trump-Mamdani press conference seta dekhiye diyeche.",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "জুলাই যুদ্ধারা তো স্ব-ঘোষিত রাজাকার।",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "rajakar er bacchara.",
      "votes": "28",
      "replies": []
    },
    {
      "text": "They are just speaking of their blood ( or polluted holy blood). There's no hiding in it. Good for them.",
      "votes": "27",
      "replies": []
    },
    {
      "text": "Yahya Khan and Tikka Khan are smiling from their graves. For a country which has suffered so much at Pakistani hands, this is really disturbing.",
      "votes": "25",
      "replies": []
    },
    {
      "text": "The liberation war was actually a war between the \"touhidi jonota\" vs rest of us. No matter some people deny it, the evidence is clear.",
      "votes": "19",
      "replies": []
    },
    {
      "text": "Rajakar",
      "votes": "15",
      "replies": []
    },
    {
      "text": "এই সরকারের জন্যই এমন হচ্ছে। ধর্মের দোহাই দিয়ে মব চলছে, ওয়াজের স্টেজে যা-তা বলা হচ্ছে, তৌহিদী জনতা আইন নিজেদের হাতে তুলে নিচ্ছে, পাকিস্তান তোষণ চলছে। সরকারের এসব নিয়ে কোন মাথাব্যথা নাই। এই সরকার ধর্মান্ধদের সরকার।",
      "votes": "14",
      "replies": []
    },
    {
      "text": "স্বকীয়তা ও একাত্তরের চেতনা: আমরা কি সত্যিই ভুলে গেছি?\nআমার মনে হয়, বর্তমান পরিস্থিতি একটি গভীর চিন্তার জন্ম দিয়েছে। আমাদের মহান \"একাত্তরের মুক্তিযুদ্ধের বীরদের আত্মত্যাগ\"—যাঁরা জীবন দিয়েছেন একটি ধর্মনিরপেক্ষ, স্বাধীন বাংলাদেশের জন্য—আমরা যেন দ্রুতই তা ভুলতে বসেছি।\nযা চলছে, তাকে নিছক \"বাড়াবাড়ি\" বলা ভুল হবে। আমার চোখে, এর মাধ্যমে আবারও \"ধর্মকে একটি ঢাল হিসেবে ব্যবহার করে\" বাংলাদেশের মঞ্চে সুকৌশলে \"পাকিস্তানের প্রমোশন\" করা হচ্ছে।\nযারা এই কাজগুলো করছে, তাদের মনে রাখতে হবে—তারা \"আগুন নিয়ে খেলা\" করছে। যদি এই ধারা অব্যাহত থাকে, তবে আমাদের দেশ আরও একটি \"একাত্তরের দিকে এগিয়ে যাচ্ছে\", যা এখনকার বাঙালিরা বুঝতে পারছে না।\nআমরা যেন বিবেকহীন, মস্তিষ্কবিহীন বানরের মতো শুধু অনুকরণ করছি। হাসিনা সরকারের পতনের পর যেভাবে পাকিস্তানপ্রেমী মনোভাব ওপেনলি বেড়ে গেছে, তা দেখে সত্যিই খুব হাস্যকর লাগে এবং একই সাথে হতাশ হতে হয়।",
      "votes": "7",
      "replies": []
    },
    {
      "text": "দেশ যেহেতু \"তুমি কে আমি কে? রাজাকার, রাজাকার\" স্লোগান দেওয়া দের দখলে, সেখানে পাকিস্তান জিন্দাবাদ স্লোগান হওয়াই তো স্বাভাবিক। জেন-জি পুরাই প্রো পাকিস্তান যা দেখা যাচ্ছে।",
      "votes": "38",
      "replies": []
    },
    {
      "text": "BAL supporters cant have an opinion because all of them are \"fascists\"\nmeanwhile jongipakis:",
      "votes": "22",
      "replies": []
    },
    {
      "text": "“At this point, only Allah knows where this country is heading. Everyone seems to be pushing their own agenda.”",
      "votes": "5",
      "replies": []
    },
    {
      "text": "It's an act of treason",
      "votes": "4",
      "replies": []
    },
    {
      "text": "হাসিনাতো জয় হিন্দ বলে নাই। কিন্তু এখানে পাকিস্তান জিন্দাবাদ ঠিকই বলছে।",
      "votes": "10",
      "replies": []
    },
    {
      "text": "Watching this : if you’re surprised, then you were gullible and dumb !! If you’re angry, it’s because you are helpless !! If you are anxious, you are the new age minority !! If you are unbothered, you are the traditional minority!! If you’re happy hopeful and content, congratulations!! after decades of waiting and generational trauma your day has come!!",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Source: https://m.facebook.com/reel/1912323159689333/?referral_source=external_deeplink",
      "votes": "8",
      "replies": []
    },
    {
      "text": "বাপের নাম কে না নিতে চায় ?",
      "votes": "3",
      "replies": []
    },
    {
      "text": "I dont understand these people. How that slogan is related to what they were doing !!??\nDid anyone pay them to do so ?\nIf you are doing a quran telowat, kerat etc then do that. what is the point of shouting that slogan !!",
      "votes": "4",
      "replies": []
    },
    {
      "text": "রক্ত বেইমানি করে না তার প্রমাণ",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Well it was bound to happen",
      "votes": "2",
      "replies": []
    },
    {
      "text": "https://www.prothomalo.com/bangladesh/district/lnslpymt8i",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Ei subbredit onek moja lage rather than focusing on the jongi, people are trying thier absolute best on turning this situation against July protesters. Jeikhane OP himself is like one of the bigger july supporters here as far as I know\nThe fact that you lot care more about july protesters rather than these jongis tells me just how much you care for extrimism.\nPS: FUCK THE JONGI, Luckily most people dont realize these jongis are more seperated than awamilig and bnp are.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "from prothom alo\n”সম্মেলনে উপস্থিত আরও এক ব্যক্তি প্রথম আলোকে বলেছেন, মূলত ইরান, মিসর, ফিলিপাইন ও পাকিস্তানের প্রতিযোগীরা সম্মেলনে অংশ নেন। যখন যে দেশের প্রতিযোগী মঞ্চে এসেছে, সেই দেশের নামে সঞ্চালক স্লোগান ধরেন।\nসামাজিক যোগাযোগমাধ্যমে ছড়িয়ে পড়া একই অনুষ্ঠানের আরেকটি ভিডিওতে এর সত্যতা মেলে। সেখানে দেখা যায়, মিসরের বক্তা মঞ্চে ওঠার পর ‘মিসর জিন্দাবাদ’ স্লোগানে তাঁকে স্বাগত জানানো হচ্ছে।”\nhttps://www.prothomalo.com/bangladesh/district/lnslpymt8i\nbut still, we dont need to chant for this genocidal entity. May the people of pakistan prosper, but we must hold the state of pakistan accountable for 71",
      "votes": "2",
      "replies": []
    },
    {
      "text": "আল বদরের ছানা কাবুল হবে ঠিকানা।",
      "votes": "1",
      "replies": [
        {
          "text": "কিন্ত কাবুলের সাথে দেখলাম ভারতমাতার নতুন সম্পর্ক স্থাপন হচ্ছে। মায়ের আদেশ অগ্রাহ্য করা কি ঠিক হবে?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Danga lagaite chai, surely RAW er kaaj. Ar jara Pakistan ba bharot lober oder oi desh e pathai dewa hok",
      "votes": "0",
      "replies": []
    }
  ],
  "id": 100
}