{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pb3vdl/%E0%A6%AC%E0%A6%A1%E0%A6%86%E0%A6%B0_%E0%A6%B9%E0%A6%A4%E0%A6%AF%E0%A6%95%E0%A6%A3%E0%A6%A1%E0%A6%B0_%E0%A6%86%E0%A6%97_%E0%A6%93_%E0%A6%AA%E0%A6%B0/",
  "hash": "a112d063630b570a2db90435df5251de",
  "scraped_at": "2025-12-08T11:44:38.737153",
  "title": "বিডিআর হত্যাকাণ্ডের আগে ও পরে",
  "description": "বিডিআর হত্যাকাণ্ডের আগে পরে ১,২২১ জন ভারতীয় নাগরিক বাংলাদেশে প্রবেশ করেছে। তাদের মধ্যে ৬৫ জনের বাংলাদেশ ছাড়ার কোনো তথ্য ইমিগ্রেশন পুলিশের কাছে নেই!!\nNews Source: Deputy Press Secretary at Chief Advisor, GOB\nImage source: Deputy Press Secretary at Chief Advisor, GOB\nhttps://www.facebook.com/share/p/16mFCpvzaL/?mibextid=wwXIfr",
  "votes": "19",
  "comments": [
    {
      "text": "One of survivors colonel qamruzzman, I find him so suspicious! He was at the darbar hall when the mass shooting happened. The weird thing is he was an advocate of Awami league! I honestly found that weird since I know most people from pilkhana did not have same sentiment towards awami league",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Can we file a case with international court of arbitrations or something. We need to teach India a lesson.",
      "votes": "13",
      "replies": [
        {
          "text": "You can't make cases with conspiracy theories LOL.",
          "votes": "3",
          "replies": []
        },
        {
          "text": "Most of raw evidence destroyed by ex Hasina government, only left over live witnesses and clues. But I hope this report is enough to open a file against India.",
          "votes": "2",
          "replies": []
        },
        {
          "text": "But albotors will downvote you instead",
          "votes": "5",
          "replies": []
        },
        {
          "text": "The government wont even if they could because maintaining good relationship with India is more important.",
          "votes": "1",
          "replies": [
            {
              "text": "If there is credible evidence then they should.\nThe commision named former IGP as the accused, whose own son in law was amongst the victim. If the commisions report is credible, not hearsay or revenge or populism, then it would be a good bargaining chip with India.\nJodi na korey, this is just for domestic political consumption.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Bro sounds like those people who say pyramids were made by aliens",
      "votes": "3",
      "replies": []
    },
    {
      "text": "This is very serious issue.",
      "votes": "1",
      "replies": [
        {
          "text": "Of course but our government is not strong enough to be accountable to India and next elected government will try to avoid this.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Ai post gular reach nai ken. Tbh indians diye sub reddit bhore gese. Special north bengalees gula Bangladesh niye ato curious. Halara india chaira Bangladesh aisha por",
      "votes": "1",
      "replies": []
    },
    {
      "text": "এই বিষয় সব প্রগতিশীলরা চুপ। বুঝা যায় কাদের স্বার্থ তারা হাসিল করতে চায়।\nস্বাধীনতা ৭১ এর চেতনা করে মুখে ফেনা তুলে বসে, অথচ একরকম আকর্ষিক ভয়ংকর পরিকল্পিত হত্যাকান্ড বাংলাদেশের স্বাধীনতাকে হুমকির মাঝে ফেলে দেয় সে ব্যাপারে মুখে কুলুপ।",
      "votes": "0",
      "replies": [
        {
          "text": "Those are the actual Razakars of Bangladesh",
          "votes": "1",
          "replies": []
        },
        {
          "text": "আব্বুর নাম কি? টিক্কা খান? যেই ভাষা তোমার, মনে তো হয় মাদ্রাসায় পড়।",
          "votes": "1",
          "replies": [
            {
              "text": "আব্বুর নাম কি? টিক্কা খান? যেই ভাষা তোমার, মনে তো হয় মাদ্রাসায় পড়।",
              "votes": "4",
              "replies": []
            },
            {
              "text": null,
              "votes": "-1",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 101
}