{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pakd8p/al_collectively_involved_in_bdr_killings_taposh/",
  "hash": "ff1240bae2046f8ccedd3cab9ef9110f",
  "scraped_at": "2025-12-08T11:45:44.627266",
  "title": "AL collectively involved in BDR killings, Taposh key coordinator: Commission",
  "description": null,
  "votes": "58",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "BAL Sympathizers pretending Hasina didn't pull this off xD",
      "votes": "34",
      "replies": [
        {
          "text": "The biggest proof that BAL was involved is how everything was kept under wraps without any proper explanation. They just caught and put some misguided BDR troops on trial and called it a day.",
          "votes": "24",
          "replies": [
            {
              "text": "Also the army was not allowed to intervene when they knew for sure officers were being hunted down and killed.",
              "votes": "16",
              "replies": []
            },
            {
              "text": "Bro, they don't care about proof or testimony of the survivors. They know Hasina did it. They love her for it. As long as they get to stay in power, they don't mind killing a few people of their country with the help of India. But all they can do is yap and play the victim when they lose their power. That's why you'll see them complaining about obvious shit.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Indian troops were ready to intervene during the BDR mutiny and rescue their agent Hasina. https://swarajyamag.com/world/bangladesh-india-almost-intervened-militarily-to-support-ally-sheikh-hasina-in-2009-heres-the-story",
      "votes": "16",
      "replies": []
    },
    {
      "text": "How does one get played by someone like Taposh, look at that mofo 😭😭\nThe whole army needs to committ seppuku for being outfoxed by Taposh",
      "votes": "14",
      "replies": []
    },
    {
      "text": "Bangladesh Awamileague's father is India. In 2001, when BDR defeated India in Boraibari, the Indian authority took revenge with the help of BAL leaders to punish the brave soldiers of Bangladesh who had defeated them.\nBAL sold the soul of our country to India to stay in power. There are no Shadhinotar Pokkher Shokti, BAL is the ultimate Razakar of Bangladesh who neither fought for the Independence war of 1971, nor did any good for the country. Instead they killed the brave soldiers and humiliated the Muktijoddhas.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Those killed armies were one of best of our country. They were killed because they wanted to keep our country free from infiltration by neighboring country. To support the cause of our neighboring country AL govt did their best.",
      "votes": "11",
      "replies": []
    },
    {
      "text": "Awami stans still believe their party protected the values of 1971 lol. Mujib himself isolated the leaders who played key roles during the liberation war, welcomed Zinnah with open arms in Dhaka after the war. His daughter established a one-party state, didn't give a shit about our sovereignty and served the agenda of our neighbours. As long as the Sheikh family is there, Awami League will never return to its pro-Bangladesh roots.",
      "votes": "14",
      "replies": [
        {
          "text": "Not Zinnah, Bhutto",
          "votes": "2",
          "replies": []
        },
        {
          "text": "Bhutto, not Jinnah LOL",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Yes, what about the 2004 Dhaka grenade attack or the 1971 war crimes? This Yunus government now has the chance to pin every past crime on the Awami League just to satisfy the fetishes of the chutya moronic Bangladeshi public. The damage this Yunus government is doing to the integrity of the country’s legal system is something even the AL would probably be ashamed of. They had the opportunity to build a better country with so much support behind, but again and again they prove why Bangladeshis always end up crawling back to this corrupt BAL government - because, in this stupid country, they’re still the best among all the worst options available.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Pigs like tapoos destroying the countries backbone",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Read more: https://www.tbsnews.net/bangladesh/bdr-massacre-commission-finds-collective-awami-league-involvement-names-ex-mp-taposh-key",
      "votes": "3",
      "replies": []
    },
    {
      "text": "এইটার বিচার হওয়া সবার আগে দরকার ছিল। এই বিডিআর হত্যা কান্ডের পর থেকেই দেশের সার্বভৌমত্ব হুমকির মুখে পরেছে।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "-6",
      "replies": [
        {
          "text": "Ohh haa ish hasu apa jonno khub book kanda poray toder 🤣",
          "votes": "11",
          "replies": []
        },
        {
          "text": "Bal ar koto ৭১ beiccha cholbe? ৭১ to or baper akar na",
          "votes": "4",
          "replies": []
        },
        {
          "text": "BALLS NOT AL",
          "votes": "-3",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-7",
      "replies": [
        {
          "text": "Literally won’t happened, BAL fans love making up self-victimization fantasies",
          "votes": "11",
          "replies": [
            {
              "text": "Listen to the speech of Rajakar Barrister Shahriar What he is trying to say on National TV",
              "votes": "-1",
              "replies": []
            }
          ]
        },
        {
          "text": "মুক্তিযুদ্ধ ইন্ডিয়ার ষড়যন্ত্র এটা কেবলমাত্র রাজাকার ও তার দোসরদের ন্যারেটিভ",
          "votes": "3",
          "replies": []
        },
        {
          "text": "Given the popularity of Jamat among large segment of the population (as seen in how their candidates won in various student elections), Bangladesh is heading towards that direction.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "নুতন পাগলের আমদানি। বাল সাল।",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "-6",
      "replies": [
        {
          "text": "Koi?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-6",
      "replies": [
        {
          "text": "Why would then a new govt would want to kill off true patriot officers so quickly after power?\nDoes the last 15 years of blood soaked autocracy where military entities were applied to conduct many crime against humanity to keep them in power answer that question.",
          "votes": "5",
          "replies": []
        },
        {
          "text": "The answer to WHY is to please their superior neighbour, India. Why can't you fathom that BAL did it to stay in power with India's help for longer? This actually happened with the rigged elections, which India backed.",
          "votes": "6",
          "replies": []
        },
        {
          "text": "It may not have been their decision and they were just tasked with carrying it out.\nAny organization will always have grievances. I think whoever orchestrated the mutiny played on these grievances.\nI don’t know whether BAL planned the BDR killings. But once the mutiny started, BAL allowed it to continue by blocking any immediate response from the military.",
          "votes": "3",
          "replies": []
        },
        {
          "text": "My ranked teammate",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 105
}