{
  "url": "https://www.reddit.com/r/bangladesh/comments/1paineg/%E0%A6%86%E0%A6%AA%E0%A6%A8_%E0%A6%95_%E0%A6%9C%E0%A6%B2%E0%A6%B2%E0%A6%B0_%E0%A6%B0%E0%A6%B9%E0%A6%AE%E0%A6%A8%E0%A6%B0_%E0%A6%B8%E0%A6%A5_%E0%A6%8F%E0%A6%95%E0%A6%AE%E0%A6%A4_%E0%A6%AB%E0%A6%AC%E0%A6%B0%E0%A7%9F%E0%A6%B0%E0%A6%A4_%E0%A6%95_%E0%A6%A8%E0%A6%B0%E0%A6%AC%E0%A6%9A%E0%A6%A8_%E0%A6%85%E0%A6%A8%E0%A6%B7%E0%A6%A0%E0%A6%A4/",
  "hash": "5d09ea82a2df06dab75033f4d93c2019",
  "scraped_at": "2025-12-08T11:46:22.782529",
  "title": "আপনি কি জিল্লুর রহমানের সাথে একমত? ফেব্রুয়ারিতে কি নির্বাচন অনুষ্ঠিত হওয়ার কোন লক্ষণ আপনি দেখতে পাচ্ছেন?",
  "description": "আমি মনে করি ফেব্রুয়ারিতে নির্বাচন না হওয়ার পসিবিলিটি বেশি। দেশের বর্তমান আইনশৃঙ্খলা পরিস্থিতি কিংবা যেকোন অযুহাতে ড. ইউনুস ক্ষমতায় থাকতে চাইবেন। যে এজেন্ডা নিয়ে ওনি আসছেন ওইগুলোর অন্তত ৬০-৭০% সম্পূর্ণ না করে ওনি অবসরে যাবেন বলে আমার মনে হচ্ছে না। আপনার অভিমত কি? আপনার কাছে কি মনে হচ্ছে?",
  "votes": "19",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "নির্বাচন হইলেও দেখতে পাব, না হইলেও দেখতে পাব। হুদাই এটা নিয়ে দুশ্চিন্তা করার কোনো কারণ নাই।",
      "votes": "39",
      "replies": []
    },
    {
      "text": "Dr Younus has party pressure, army pressure and international pressure with almost 0 political backing. If BNP tries to do Coup and army doesn't back him up they can easily do it. So stop making up nonsense about Election.",
      "votes": "32",
      "replies": [
        {
          "text": "BNP er oi samortho nai vaiya.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "February te jodi election na hoi, chances are BNP maathe nambe, election demand korbe, na parle BNP might do a tag team with Awami League and kick out yunus and the jamati proxy government. Time will tell whether it's gonna happen or not but it's gonna be a mess.",
      "votes": "16",
      "replies": []
    },
    {
      "text": "হওয়ার সম্ভাবনা নেই।",
      "votes": "7",
      "replies": []
    },
    {
      "text": "election hok ar na hok desh ager moto e theke jabe",
      "votes": "12",
      "replies": [
        {
          "text": "Some sort of habitual truth for Bangladesh.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "U only need 2 brain cells to realise election won’t happen till mid 2027",
      "votes": "16",
      "replies": [
        {
          "text": "Mid 2027 porjonto hold off korar power ei govt er ase mone hoy?",
          "votes": "3",
          "replies": [
            {
              "text": "Na !! But jamaat er aache !! Jamaat will only let this election happen once they are confident enough to win majority seats !! They decide when to keep quite or when to break havoc to destabilise!! They will win this or keep running the gov like they are - right now",
              "votes": "-1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I think there are going to be selections with BNP and its allies including some NCP leaders. Election is most unlikely!",
      "votes": "3",
      "replies": [
        {
          "text": "১০০% সিলেকশন এর মাধ্যমে ইলেকশন হবে, আওয়ামী লীগের ৩০% ভোট আছে এটা ইউসুফ সরকার সহ জামাত বিএনপি সবাই জানে, এত বেশি ভোট নিয়ে রিস্ক নিতে যাবে না। ঢাকা-১০ যেমন শিশুনেতা সজীব ভুঁইয়া আর ফেনী-৩ আরেক শিশুনেতা মাহফুজকে ছেড়ে দিছে, এমনে কমপক্ষে ১৫০ আসন আগে ভাগ হবে যেন আওয়ামী লীগের গন্ধ পর্যন্ত আছে এমন কেউ সংসদে যাবার সুযোগ না পায়",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "আমি বিশ্বাস করি দেশ ৭১ সালের মত একটা সময় আবার অতিক্রম করবে , আবার ধর্মান্ধরা পরাজিত হবে ! কারণ এস্ট্রাপলিপজিকাল এসেসমেন্ট তাই বলে",
      "votes": "13",
      "replies": []
    },
    {
      "text": "Are we about to fall into Yunus dictatorship 😂",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Election will take place in Feb because that's what all the political parties want. The Interim Govt does not have the power to stand in their way.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "I'm politically naïve however I reckon Yunus is our one and last chance for your country. I hope he finds a way to lead our country",
      "votes": "3",
      "replies": []
    },
    {
      "text": "এই দালালের কথা শুনতেছেন? এ গত ১৬ টা বছর আওয়ামী লীগের দালালি করছে। আওয়ামী লীগের কথায় উঠছে বসছে। এদের কাজই মানুষের মনে এখন ভয় ঢুকায় দেশটাকে অস্থিতিশীল করা কারন এরা নির্বাচনে participate করতে পারবে না। কার কথা শুনা দরকার কার কথা না, এটা যদি এখনো না বুঝেন তাহলে সমস্যাটা রাজনৈতিক দলের না আপনাদের।",
      "votes": "4",
      "replies": [
        {
          "text": "জিল্লুর রহমান আওয়ামী লীগের দালালী করছে? মানে গোআ আর চাইদিকে চাঁদে দেখতে না পেলে আর শাহজাহানকে সূর্যদেবতা না মানলেই সে আওয়ামী লীগের দালাল",
          "votes": "5",
          "replies": [
            {
              "text": "তাহলে সে কি করছে? তার তৃতীয় মাত্রা অনুষ্টানটি দেখেছেন কখনো? আমি আমার জীবনে উনাকে গঠন মূলক প্রশ্ন করতে দেখি নাই। সব সময় বিরোধী দলীয় কাউকে এনে আওয়ামীলীগের কোনো নেতার সাথে মিলে bully করেছেন। দেশের কোন পরিস্থিতি আপনাকে বলতেছে নির্বাচন হবে না? একটা কারণ দেখান যেটা দেখে মনে হচ্ছে নির্বাচন হবে না। কিছু কিছু আসনের প্রার্থীরা already প্রচারনা শুরু করে দিছে। বিএনপি জামাতের পোষ্টার দিয়ে এলাকা ভরে গেছে। কত conspiracy theory বিশ্বাস করবেন? মাথায় গোবর থাকলে ভারত চলে যান, ঐখানে গোবরের অনেক দাম।",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "Because there’s a lot of dalals on this Reddit constantly bonding together lol, they circlejerk the same propaganda",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Dekhleyo ki, na dekhleyo ki! Nothing changes after all",
      "votes": "0",
      "replies": []
    },
    {
      "text": "obvious there will be an election. Prothom BAL der size kora hoysay ekhon BNP der size kora next uchit",
      "votes": "0",
      "replies": [
        {
          "text": "তাহলে জাশি আর হিজবুত তাহরীর বাংলাদেশ পেতে যাচ্ছি আমরা? শেখ হাসিনার বয়ান সঠিক। আফটার শেখ হাসিনা মৌলবাদ এন্ড উগ্রবাদ মাথা চাড়া দিবে বিডিতে।",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "এই বেটার প্রতিষ্ঠান তো ভারতের ফান্ডিং এ চলে। একজন সুশীল আওয়ামী লীগ এর কাজ সবসময়ই দেশে কেওয়াজ বজায় রাখা, এরা বাংলাদেশের মানুষকে কোনদিন শান্তি তে থাকতে দিবে না। বাংলাদেশের মানুষের জন্য শান্তি হবে যদি প্রতি মাসে একটা করে ঝুলাইয়া দিতো, তাহলে এদের মুখ বন্ধ হয়ে যেতো।",
      "votes": "0",
      "replies": []
    },
    {
      "text": "A silly question I know, but I have to ask, Yunus er ki agenda?",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 107
}