{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pai2gp/how_arranged_marriage_working_in_bangladesh_now/",
  "hash": "41d39ab2831bc8e2e06ab155b16c00cc",
  "scraped_at": "2025-12-08T11:46:41.613717",
  "title": "How arranged marriage working in Bangladesh now?",
  "description": "Hi everyone,\nI’m curious to hear your thoughts on Bangladeshi matrimony apps. 😅\nWhat features or practices do you find most frustrating?\nAre there apps that feel especially “greedy” or pushy with payments?\nAny personal experiences — good or bad — that stand out?\nPlease share your honest opinions! I’m trying to understand what users really dislike and which apps need improvement.\nThanks in advance!",
  "votes": "2",
  "comments": [
    {
      "text": "Arranged marriage is now better but not best. Ig if we delve into the history of arranged marriage in Bangladesh I think it's a lot better now. Women have more rights, can take decisions of household and others like her husband, can do jobs but still Bangladesh didn't get rid of the idea that women should take care of household stuff like cooking, cleaning and laundry all. Not sexism but a little bit of sexism does show here. But arranged marriages always are more bound because of responsibility and duty rather than love. But if we say that husband and wife fell in love after an arranged marriage I think they are more likely to be forced because they are husband and wife they are supposed to love each other right? More like forced to love and it does bloom into respect and love but it depends on the partner and environmental complications.",
      "votes": "4",
      "replies": [
        {
          "text": "You provoked many thoughts...Thank you!",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "solid lottery system",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Constantly pokes for payment but no focus on service. Many fake accounts.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Since family ties have become quite weak, it’s difficult to expect any support from them regarding relationships.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 108
}