{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pgjjyc/%E0%A6%86%E0%A6%AE_%E0%A7%A7%E0%A7%AC_%E0%A6%A1%E0%A6%B8%E0%A6%AE%E0%A6%AC%E0%A6%B0_%E0%A6%AC%E0%A6%9C%E0%A7%9F_%E0%A6%A6%E0%A6%AC%E0%A6%B8_%E0%A6%AE%E0%A6%A8_%E0%A6%A8_%E0%A6%86%E0%A6%B8%E0%A6%A6%E0%A6%9C%E0%A6%9C%E0%A6%AE%E0%A6%A8_%E0%A6%AB%E0%A6%AF%E0%A6%A6_jamuna/",
  "hash": "a30d4b4ce8ca00d9db4cd2fc7e08b156",
  "scraped_at": "2025-12-08T11:18:48.675153",
  "title": "আমি ১৬ ডিসেম্বর বিজয় দিবস মানি না: আসাদুজ্জামান ফুয়াদ | Jamuna Television",
  "description": "এনসিপি এতো দল থাকতে এই দলের সাথেই জোট করলো। এর মাধ্যমে কি তারা জামাতের বি-টিম হওয়ারই পরিচয় দিলো?",
  "votes": "17",
  "comments": [
    {
      "text": "NCP যে জামাত বি টিম এটা সবাই অনেক আগেই বুঝে গেছে",
      "votes": "17",
      "replies": []
    },
    {
      "text": "He and his gang are lucky to born in Bangladesh.\nThey are lucky to be allowed to speak and spread confusion among people.\nIt is a criminal offense in many countries in the world to speak in favor, deny, justify, spread lies and etc about recognized wars and genocide.\nAnd in Bangladesh after 50 years we are arguing about how many people killed, some dont agree 16 dec blah blah blah..",
      "votes": "15",
      "replies": [
        {
          "text": "We should make a law about treason at this point. At Germany if you speak against Holocaust,you'll get jail. And our country allows bastards who opposed 1971 war to roam scot-free",
          "votes": "12",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "11",
      "replies": [
        {
          "text": "Ekanto golap.",
          "votes": "10",
          "replies": []
        },
        {
          "text": "G@y",
          "votes": "3",
          "replies": [
            {
              "text": "Being gay isn't a problem at all, but being a jamaati is for sure",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Vai Vai er prem Pore babar sathe jabe",
      "votes": "8",
      "replies": []
    },
    {
      "text": "টিভিতে যতই বাহাদুরি দেখাক, মাঠে নামলেই বারনিশ করে দিচ্ছে।\nhttps://www.facebook.com/share/r/1BbPiDFuGF/",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Facts don't care about your feelings, Barrister Fuad.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "His degree should be stripped away so he can’t practice in Bangladesh, he should be thrown into streets and government should posses his belongings since none of these should be his and he should be banned from politics since he doesn’t believe in the country where he is doing politics. Finally if he is still unhappy, he should be sent to Pakistan where he can start fresh.\nIf Fuad doesn’t believe in 16th Dec, this country doesn’t need to believe in him and let him go without everything he earned here.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "",
      "votes": "-5",
      "replies": [
        {
          "text": "Today's news",
          "votes": "5",
          "replies": []
        },
        {
          "text": "Jot korse. Jinishta fau dekhailo tai share korlam. Chaile Gonoodhikar porishad er logei jot korte parto. Kintu jenebujhe jamaater B-team er shathe jawar dorkar ki?",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "Good for him. He can sleep tight.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 11
}