{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pagkzs/have_you_ever_fallen_in_love_with_someone_who_you/",
  "hash": "d8ffb1334bfc758c8980672ac8393e2f",
  "scraped_at": "2025-12-08T11:47:14.412570",
  "title": "Have you ever fallen in love with someone who you didn't find attractive at first?",
  "description": "Hey good fellas! Have you ever fallen in love with someone you didn't find him or her attractive enough. But course of time you became friends and then you started to feel for him or her . Got bit jealous and then realised you actually fell in love with that person?",
  "votes": "11",
  "comments": [
    {
      "text": "Its not like that I didn't find her unattractive or anything, I just didn't paid enough attention to her. I fell in love after I talked to her and now she is the most prettiest girl ever to me. Its been two months that we are in a relationship, wish us good luck.",
      "votes": "14",
      "replies": [
        {
          "text": "Does her personality made you fall in in love with her?",
          "votes": "2",
          "replies": [
            {
              "text": "Yeah you can say that. If she is a 8/10, then her personality, the way she carries herself, the way she talks, makes her a 10/10.",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "Goodluck!",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "What is love",
      "votes": "4",
      "replies": [
        {
          "text": "Baby don't hurt me",
          "votes": "7",
          "replies": []
        },
        {
          "text": "Hey siri play what is love by twiceeeee",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Yup. That's how I fell in love.",
      "votes": "3",
      "replies": [
        {
          "text": "How many days or months or years did it take to feel that?",
          "votes": "2",
          "replies": [
            {
              "text": "About 1 month. You see when you get to know know a person and start to feel the connection looks don't matter anymore.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Yes",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Hae",
      "votes": "2",
      "replies": []
    },
    {
      "text": "esob er experience nai bole bolte partachi na",
      "votes": "2",
      "replies": []
    },
    {
      "text": "I've never fallen in love or even had a crush",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 110
}