{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pabuki/is_the_distinction_between_private_vs_public/",
  "hash": "59e8635ae7e97b8836df20aca04108b0",
  "scraped_at": "2025-12-08T11:47:49.521137",
  "title": "is the distinction between private vs. public universities real?",
  "description": "Asking because I see some people who genuinely have the mindset that studying Urdu at Dhaka University is a smarter choice than studying CSE at BracU. Is there any credibility to the mindset that private universities are \"second tier\"? I always thought it was dumb how people keep mocking private university students when I know for certain that a large number of them got into public universities but didn't attend because of subject/location issues. To private university graduates, how do you deal with the insinuation from public university students that you're less than/dumber because of you go to a public university?\nAlso, why do BUET and DU students particularly have such a superiority complex? I think IBA and Medical students are much tamer compared to them, although thei worked roughly the same and are on par with them in terms of prestige. Do older and more successful BUET/DU graduates tend to be more humble and non-egotistical? I've only ever seen freshers and/or barely passing students from these universities go under every NSU/BracU admission post and comment \"Ekhaneo saans pawa lage naki\". Why is that?",
  "votes": "7",
  "comments": [
    {
      "text": "No it doesn't matter which university you go to, it's what you do with your education that matters.\nIt's a common mistake people make, they make the school/college/university or workplace an integral part of their identity. Usually it goes away as they age for most people.\nThere is an American joke: \"How do you know someone went to Harvard? They will tell you.\" While public universities in Bangladesh are nowhere near Harvard on any metric, they are quite selective which gives students a false sense of superiority.\nBut in the flipside, a strong alumni network can be useful. Most public universities have alumnis in almost all big government or private institutions. This can be helpful sometimes, but doesn't really matter that much to be honest.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "doesnt matter much in job market,skill na thakle no ones gonna give a dang",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Is the distinction, more particularly, the discrimination real? Yes. It is real. Even in the post-revolution, you could see, the private uni students were neglected. Part of the discrimination, comes from the perceived intellectual superiority of public students. You got a merit position in public uni, so you must be better than a private uni student who didn't.\nHowever, in terms of subjects, a public uni student attending Urdu is not considered better than a private uni student studying CS(E), because it is seen a poorer choice instead of intellectual difference. Though the public uni student would get his credit, and the private uni student would be tagged as \"Baaper taka ase, tai pora shuna kore nai\". The discrimination is severe in rural area ironically who themselves haven't studied much.",
      "votes": "7",
      "replies": [
        {
          "text": "\"Baaper taka ase, tai pora shuna kore nai\".\nAt least wasting or using parents' money to study in university is much better than those many people who study in public university with taxpayers money and don't do anything, wasting taxpayers money and don't return even 1 paisa of it back, but have the arrogance and audacity to boast about their public university education.",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "Believe me BRAC & NSU have long surpassed BUET, DU. They have real quality faculty and system.",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Also, why do BUET and DU students particularly have such a superiority complex?\nTheir whole identity is focused around getting into some well-known public university. They have no other substance or personality.\nDo older and more successful BUET/DU graduates tend to be more humble and non-egotistical?\nIt's even worse with the older graduates like people your parents age.\nFor lots of them studying at the public university was the biggest thing they accomplished.\nDo you know how many BUET and DU and other public university boomers, especially women and retired men are literal losers who could not accomplish anything else after graduating, whether it's a job, any job or other things? Do you know how many of them are stupid too despite their education? While many people from private or \"unknown\" universities are living decent ordinary lives.\nEDIT: Literally all my female (and some male) teachers at school when I was growing up all graduated from unknown lower status universities and they had decent lives and most liked their jobs. While there are many housewives and other people who graduated from DU and other public universities with top marks who were not able to make anything with their high class education at all. It's what you do with your education that matters, like someone said in the comments.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Some mid-range private universities don't want to change their kindergarten mentality. That's the only problem. Otherwise, classes, exams and getting handed certificates will take place in regular intervals without session jot.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 112
}