{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p9xb03/seriously_why_havent_tarique_rahman_come_back_to/",
  "hash": "13e7aaaca8a055fec21cae9431f04b16",
  "scraped_at": "2025-12-08T11:48:05.935665",
  "title": "Seriously, why haven't tarique rahman come back to bd?",
  "description": "Hasina is no more. The grassroots are in support of tarique rahman. Even jamats being at odds with local BNP leaders, still respect tarique rahman.\nWhat are the obstacles preventing him from coming back? Is an assassination of a national leader that easy? Even if that is easy, I think the consequences will be very heavy if anyone does so.\nwhy isn't he here? BNP needs him badly. BNP and AL are large political parties with many heavy weight leaders. Only zia family and sheikh family are capable enough to organise these two parties. I really can't fathom any realistic and rational reason of his absence today",
  "votes": "8",
  "comments": [
    {
      "text": "2 minus theory.........hasina and khaleda is no more...hasinas kids are stupid..only tareq remains from sheikh-zia family dynasty . if hes done then bangladeshes whole politics will change. we will be out of family politics that has shrouded bangladesh",
      "votes": "29",
      "replies": [
        {
          "text": "Truth",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "its actually not safe for him yet.",
      "votes": "13",
      "replies": []
    },
    {
      "text": "Tldr; he is not stupid enough to trust the jamaet government",
      "votes": "24",
      "replies": []
    },
    {
      "text": "Jamaat will have him killed, it's a possibility. If they do, it will not be a big issue. Nobody is gonna shed tears for Tarek Jia. There will be chaos for sure, at the end it will bring only benefits for Jamaat.",
      "votes": "7",
      "replies": [
        {
          "text": "Jamaat will have him killed, it's a possibility. If they do, it will not be a big issue. Nobody is gonna shed tears for Tarek Jia. There will be chaos for sure, at the end it will bring only benefits for Jamaat.",
          "votes": "7",
          "replies": []
        },
        {
          "text": "What’s the 2 minus theory?",
          "votes": "2",
          "replies": [
            {
              "text": "Minus hasina and khaleda (hence minus 2) from Bangladeshi politics.",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "The belief is that Jamaat currently controls the government and he doesn't want to be assassinated or have false cases put against him. It's very simple. He will win the election because his party is the only party left with grassroots support / support in the gram, so why risk it so long before elections? This interim government is a clown show, they cannot trust them. Yunus said every minister will show his assets, only one did... We have seen the lowest economic growth for any administration since 1991 (Sheikh Hasina's 3rd and 4th terms were the lowest outside of this interim government and we all know why that happened) partly due to wide-spread corruption. At least in the era of the Two Begums where AL and BNP switched power between each other, the countries economic indictators went up rapidly, people gained jobs, our literacy rates were consistently up, etc.",
      "votes": "7",
      "replies": [
        {
          "text": "So Tariq is not coming back due to bad economic situation of BD ? Ganja much ??",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Probably someone who hates Tareq very much is still in power (part of the deep state).",
      "votes": "2",
      "replies": []
    },
    {
      "text": "There is an old saying in Bangladesh politics. \"A killer must me killed.\"\nThe reason people AL had a landslide victory in 2008 is \"security\". You see all these top terrors on newspapers, they are from post ershad era. It got worse in 2000. Streets were flooded with automatic weapons. Gangs ruled the city not the authorities. Prominent leaders were murdered in broad daylight. Look what happened to b choudhury, nasiruddin pintu. The cause of death during Operation clean heart was heart attack. No one knows for sure how many were killed. Why do you think they feared hawa bhaban?\nThen comes 21st August, harkatul jihad, jamatul muzahidin, ulfa (india). You see where this goes? I would cut him some slack. His status would be revoked once he lands here. And if things go bad, he wont get same exit like before. And i am pretty sure yunus gov wont provide him with necessary protocols. The election is not officially declared yet so the interim government can easily put him away from the equation.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Joke:\nIf you ever go to UK then would you come back to Bangladesh? 😂",
      "votes": "6",
      "replies": [
        {
          "text": "Yes, I would have come back if I was given the position of Prime fuckin minister. :)",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "Everyone is working remotely nowadays, so does Tarique Rahman. Even after being PM of our country, he can continue to work remotely and enjoy time with his family. Everyone deserves work-life balance.",
      "votes": "2",
      "replies": [
        {
          "text": "yeah, but to do corruption you really need to be on site.",
          "votes": "4",
          "replies": []
        },
        {
          "text": "I am not sure your being sarcastic or not",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "This here is what's wrong with our politics in a nutshell.\nEvery corrupt politicians like him or Zia family or the Sheikh family and others should stay the fuck away from the country unless they are in prison for their crime.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Imagine politics being more important than your mother who's kinda in her deathbed",
      "votes": "1",
      "replies": []
    },
    {
      "text": "He doesn’t care about his mother and motherland too.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "BNP really has two trump cards to play and one is slipping away very fast. BNP’s plan has always been for TZ to receive a hero’s welcome after elections are announced for a boost. And a second boost is a speech from BKZ.\nIn typical BNP fashion, the party did not plan for a quick deterioration of BKZ’s health.\nAs for security concerns, anyone who wants to harm TZ, can harm him at anytime. If the threats are real, Dhaka won’t be any safer for him after the election is declared.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Jamaat has plan to assassin him . after 5th aug they did all the mob & chaos, such as\n1)khelafot 2)National anthem 3)National flag change 4)PR 5) Shrine demolished & deadbody burn , 6)Mob in the name of Touhedi janata 7)Abul sarkar. // just after 5th august they bring back their spy AZAHARI to perform Quran er Mehfil in all district but in reality it was anti BNP demonstration.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "বিএনপি সাপোর্টাররা যেসব লজিক দিল ঐ কথা গুলো মোবাইল ফোনে রেকর্ড করে নিজেরাই শুনোক। গার্বেজ যুক্তির ও লেভেল থাকা উচিত",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Who the f wants to leave the comforts of their London home to come deal with all the shit in this shithole? I'd imagine after so many years, him and his family are well integrated in the UK, and might not want to leave the comforts",
      "votes": "0",
      "replies": [
        {
          "text": "That's true.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Zia, Tarique, khaleda r bnp niye hasina je Brain wash diye gese kisu ekta hole oder upori dosh jabe tai ora full family direct kisute nei.\nshob theke boro problem shena prodhan. o desh e ashar por army bidroho korle easily Bangladesh mayanmar hoiye jabe. karon Bangladesh e kono boro neta nai jar kotha shobai shunbe.\nHasina r or family kokhono Bangladesh er valo chai nai. chaibe o na.",
      "votes": "-4",
      "replies": []
    },
    {
      "text": "They say he is still afraid of some shado group.\nSome big brained people in here will claim its coz of Jamat and the BD government is controlled by them.\nWhy would Jamat want to kill Tariq? They were struggling together in the last 17 years of reign of terror. His death will create more chaos that will be out of their control. If that supposed fantasy of \"Islamic Theocracy\" ever gets established in BD, Jamat won't be leading it. It would be led by very hard-core groups like Hizbut Tahir or JMB like wackos, and Jamat people will be slaughtered first.\nThe real fear for Tariq Zia life are the remnants BAL backed cabal group residing in bureaucracy, military, and in the civil govt institutions.\nWhen some of us wanted a major clear out and reform, some people cried like \"Oh No but 71 71 or some other BS\" and BNP backed those idiots thinking it will be easier to get to election quicker and get power. When that shadow group pulls the rug from the floor and murders Tariq, they will throw the country in chaos ripe for a certain foreign interest group to take control and create another dark autocratic regime.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Because he is afraid of assasination. he was warned by many.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "To claim his pappa or mamma kota? Bro has zero reason on his own CV to claim that throne. Eitare asholei minus kore dewa uchit so that this two royal families are gone",
      "votes": "1",
      "replies": []
    },
    {
      "text": "What do you expect from someone who sent condolences for some American political talk show figure Charlie Kirk?\nHe's a Western shill getting funding from A I P A C or their equivalent. Just connect the dots, then his condolences and leaning friendly with Trump government will make sense, it's for reasons.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "The only reason our \"দেশ নায়ক\" isn't coming back is because the probability of BNP coming to power tends to 0. On top of that, the ones who didn't get the nomination from his own party might even plot to kill him. There are more than 60 leaders who are protesting openly LMFAO. It is definitely not wise for him to come back unless he wants to go to jail once again.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 113
}