{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p9q6z4/how_different_are_indian_bengalis_and_bangladeshis/",
  "hash": "4695c5da59babcdad4828d746f4ea99c",
  "scraped_at": "2025-12-08T11:49:17.994576",
  "title": "How different are Indian Bengalis and Bangladeshis?",
  "description": "I am a Punjabi from India, and I am into Bengali culture for a long time, I have read some of the Bengali poets and yeah the folklore of Bengali is amazing, but I have never read anything from Bangladesh. I am just imagining how different and similar are these 2 regions who shares same language and culture. I am from Punjab India, and apart from the religion thing I am always amazed to see similarities between both Punjabs especially the rural one it seems the same, but the dialects spoken there are very large in numbers and it is but sophisticated due to the Urdu element. But how similar are the dialects of Bengali spoken in these 2 regions and apart from the religion thing? do they sing same song on marriages, do they have common surnames like us. There are some common surnames like Sidhu, Sandhu, Bajwa, Chatha, Sekhon , Gill, Chaudhary, Chauhan, Cheema, Saroya, Gujjar\nDoes Bengalis have same Surinames too while being from two different religions, are there any Muslim Bengalis having surnames like Thakur, Sarkar, Das etc. and yeah please don’t forget to mention other details too,( cultural, linguistic, ethnically)",
  "votes": "13",
  "comments": [
    {
      "text": "The common surnames between Muslims and Hindus (across India and Bangladesh) that I can think of now are Chowdhury (numerous English spellings), Mazumdar and Sarkar. Not many",
      "votes": "15",
      "replies": [
        {
          "text": "even biswas , prottoy , joy , anik",
          "votes": "3",
          "replies": [
            {
              "text": "Other than Biswas never heard of these as surnames, perhaps as first names or daaknam.",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "Also Mondol, Haldar etc.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Ghoti (west bengali family roots) from Dhaka. Our accents are a little different and we eat less spicy food, some steamed fish and daal and kodur bora but those are the only differences I can think of from the top of my head but the things we eat are also found in north western parts of bd. Also not sure if this is relevant but we are muslim but have hindu first names and/ or daknam (nickname).",
      "votes": "11",
      "replies": [
        {
          "text": "Hindu first names? Like Kalidas or Krishnananda something? Not just Bengali names?",
          "votes": "2",
          "replies": [
            {
              "text": "Like Namrata, Anushua, Ishika, Biva, Nandini, Moutushi, etc. (Most of the cousins are women in our family)",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "One thing is common: they have a secular mindset, but it is changing very quickly under the influence of political parties.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "As a Bangladeshi Muslim who's been to West Bengal many times there's barely any difference if you think it on a macro scale. But if you view from micro level and be specific you would find many, but the fact is even Bangladeshis itself is diverse if you consider the dialects and food habit of every region. There's a lot in common, like we have almost similar marriage traditions like Holud and Boubhaat, music, books, cinemas mostly a lot of fish fetish. The differences will be mostly on where religion has blended with culture. Like you'd see a lot of hijabs and burkhas in the streets of rural and sub urban areas of Bangladesh, but in Kolkata you'd find barely anyone with hijabs. You'd find that a lot of people in Kolkata is more into speaking hindi or at least can communicate in hindi. But in Bangladesh we use mostly English and Bengali dialects to communicate. You'd notice many urdu influence like, \"Khala\", \"fupo\", \"Chacha\", \"bhai\". But in West Bengal, you'd find, \"dada\", \"mashi\", \"pishi\", \"Thakuma\" and many difference in vocabulary we daily use in our conversations. These are mostly shaped by our religious values.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "I'll be honest with you. I don't like all this talk about castes. It doesn't encompass the diversity that our area had and pigeonholes us to be a part of a framework which doesn't encompass our diverse history and roots, and i know people including bengalis are going to be obsessed with it because in their minds, caste relates to looks. East bengal was a part of the pala empire, but for centuries, it's been a mostly isolated zone with rice farms, and rivers isolating us from lots of parts of the subcontinent while west bengal was the face of where the british carried out administrative processes. Yes, were there a population exchange during 1947, yes but much of the local culture of east bengal, even from state to state varies enomously and can't be categorized within the lens that much of the indian subcontinent brings. I will say dhaka was in east bengal once upon a time was one of the most propserous cities and the center of muslin and textile trade but regions around and surrounding it all had very localized cultures, ways of life, and more which is often erased when trying to relate to indian-pak way of looking at things. For example, my village and the villages beside it were mostly isolated through river valleys, we celebrate pohela boishakh, we don't have caste or know of it but we have practiced color based eugenics (one side of my family), we herd cattle, and own land and tend to be very conservative. we have a surname nobody heard of and names that aren't common throughout the subcontinent. I believe we used to worship manesa the naga goddess before converting to islam, and because our blood pact was broken, we go through struggles and obstacles. (Don't laugh) We also have our own dialect, our localized food and more. And I'm sure that's been a pattern throughout our countries as well, isolated regions that were outside of the main indo-pak governance.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Generally, I’d say those whose ancestors were upper caste Hindus or Buddhists before becoming Muslims retained their surname. Das is not one such surname for example but more like a middle caste surname.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "From my perspective, I don't think we're similar. We don't look similar, our cultural roots and motifs are different and other than language, some similar cuisine, and attire, I don't feel the same. But then again, bengalis from state to state also differ in customs, looks, and way of life. When it comes to dialect, I think the one in west bengal sound \"sweeter.\" Dhaka is your run of the mill average bengali, then different states in bangladesh and even from region to region, have different dialects. Eg. Sylheti i barely understand. Some dialects sound crude than the west bengal bengali you're used to like you won't even think it's the same language. Dhaka sounds very basic, to me west bengal bengali sounds pretty but I don't think we have much in common with them. As for last names: chowdhury is a common one. But bangladeshi muslims often adopted last names like rahman and islam, and even hossain but don't expect bangladeshis to follow a patterned naming system, trust me on that. You will be surprised. We never really had much of a caste structure, and mixed with everyone but there is a category called zamindar. But I think we've always been less structured, more free-spirited than the rest of the subcontinent, very diverse in the way we look, present ourselves, culture, beliefs, attitudes, sometimes even very basic in the way we approach life. Our dances are similar. I believe both states also have pohela boishakh and also durga puja (for the hindus), but we muslims practice pohela boishakh. I think for clothing, west bengalis wear red and white saris more, our saris colors that we use tend to be more greens, blues, solid colors..we wear jamdani sari a lot. Not sure about west bengal. West bengalis are more artistic & romantic than us, we're more practical and utilitarian, less cosmopolitan too (maybe because we're more rural, i don't know). I hear both had lots of tantra before. Neither is better honestly but these are the differences in my opinion.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "The main difference apart from religion is 'Ghoti' & 'Bangal' - Ghotis are those who are from East Bengal & Bangal are West Bengalis. After 1947, the population exchange happened & what is see in Bangladesh is the muslims who came from West Bengal to Bangladesh were very liberal, literate & progressive. There is slight difference in food habit too. I think we, east Bengalis use slightly less spice. You can see the difference in Mohun Bagan & East Bengal emblem.\nIn terms on surnames, only those who are upper caste hindus who later converted into Islam kept their surnames like Thakur, Chowdhury, Pramanik etc. Majority of East Bengal muslims are mainly lower caste hindu converts.",
      "votes": "1",
      "replies": [
        {
          "text": "Agreed with the spice levels. We don't use mustard. I grew up in less spice but also because my mother has digestive issues. But I've never hreeard thakur or pramanik but heard chowdhury. I don't think we're lower caste hindu converts. We were budhists and mixed with all. Eg. my family has colored eyes, and no known surname and their naming scheme is too all over the place and they've been in east bengal for centuries, owning property and land and never venturing out. We had our own customs so it's a bit weird to be framed and categorized within india-pak framework of something we never had. Before islam, we used to worship nagas and manesa goddess and were in tune with nature cycles. After conversion, we started experiencing strange things because we violated blood pacts.",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 117
}