{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p9p7x7/who_or_what_is_preventing_the_return_of_tarique/",
  "hash": "af5586189ae66143abab53e9d24cb68a",
  "scraped_at": "2025-12-08T11:49:34.993590",
  "title": "Who or what is preventing the return of Tarique Rahman?",
  "description": "The question feels more relevant than ever. Since the fall of the BAL government, Tarique Rahman’s reluctance to return to Bangladesh raises serious questions about both his past and his potential as a future leader. Even with his mother reportedly unwell, it seems clear that he still has no plans to come back anytime soon.\nWhat do you think is actually preventing his return? Is he being blackmailed or threatened? To me, the optics are getting worse. Many people died during the movement, and his own party members were repeatedly tortured and killed under the BAL regime — yet he still appears unwilling to take the risk of returning and taking full control of his party.",
  "votes": "28",
  "comments": [
    {
      "text": "Its game over if he cannot gather the courage to land in Bangladesh before anything happens to her mother.",
      "votes": "27",
      "replies": [
        {
          "text": "For him to be arrested? No party other than Jamat is favoured by the interim government. Why haven’t they thrown out his cases like all the other ones that were thrown out?",
          "votes": "5",
          "replies": [
            {
              "text": "if he fears getting arrested, why does he do politics? Lojja kore na? People die for their ideological beliefs. Many BNP supporters sacrificed their lives. Many activists sacrificed their career. And the mighty leader fears jail? Shame. Its the interim they support. Its not a government run by Hasina. If Jamat is so bad, why did he and her mother were always there to shelter jamat? Munafeki marka kothabarta jotoshob. Countless number of times Khaleda ramarked Jamati leaders as Alem Ulama. Tareque has also ramarked Shibir and Chatrodal as brothers from the same mother. Yunus was endorsed multiple times by BNP. Even after the tax fraud cases, BNP was always in support of Yunus.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Had a discussion with Chatrodol peeps and it seems there is a legitimate concern that Tarique Rahman will be shot. And if he dies, BNP will break itself apart because there is too much Quorum going on inside BNP.",
      "votes": "14",
      "replies": []
    },
    {
      "text": "The BNP is led by the Zia family only in name post Zia, it's mostly a grassroots party across the country that is held together by some kind of support of the Zia family. It doesn't make sense to risk that and any injury before elections. Jamaat is a known violent org and the NCP has a lot of members who are ex-Jamaat or affilated with Jamaat, so that's why he's not back.",
      "votes": "11",
      "replies": [
        {
          "text": "Ore bapre. If Jamat is so bad that Jamat can attack BNP's top most leader, why did Khaleda shelter those jamatis? ora na alem olamar dol? Shibir r chatrodol j 1 mayer peter 2vai eta to tareque nijer mukhe bolse. Lameness overloaded",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "He would come to Bangladesh probably right before the election 🗳️ and which would create a hype to win BNP this upcoming election. Moreover, his mother signed a declaration with the then Military backed government that his son would never participate in politics in future. Guess, there are so many calculations running behind the screen which seems hard to fathom for us commoners.",
      "votes": "15",
      "replies": []
    },
    {
      "text": "He is too comfortable in the UK now, why risk all that",
      "votes": "5",
      "replies": []
    },
    {
      "text": "I’ve talked to a few people close to BNP insiders and they think that there is a realistic chance that Tarek might get shot.\nMost of us don’t fully realise how desperate Jamaat can be to attain power. This election is their easiest chance of doing so. If Jamaat loses this, I don’t think they’ll be able to make a comeback anytime soon.",
      "votes": "11",
      "replies": [
        {
          "text": "This shouldn’t be considered a valid reason. Politics is inherently a dangerous game — his own mother endured a lot throughout her career. Sheikh Hasina went through very painful episodes (in some cases, much more severe) over the course of her political life. Without a natural knack for it, I don’t know how Tarique is going to survive in our political environment.",
          "votes": "11",
          "replies": []
        },
        {
          "text": "Shot? Omg. That's gonna create a long term riot man. Who is going to shoot? Jamat? Is it an intelligence report or just bnp's assumption?",
          "votes": "1",
          "replies": [
            {
              "text": "Like I said, it’s something I’ve seen people close to BNP imply. Obviously they don’t want to say these out loud.\nJamat is a loose coalition of various Islamist parties. Some are quite liberal even by BNP/BAL standards and some are deadly conservative. The latter can commit any atrocity known to mankind. It has no restraint.\nIf Tarek is down, the entire BNP falls apart since he doesn’t have any specific successor so they are being extra careful right now.",
              "votes": "4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Minus two",
      "votes": "8",
      "replies": []
    },
    {
      "text": "He probably wants a complete guarantee from the Yunus government regarding winning the election. In the meantime, minus two is being loaded in full swing.",
      "votes": "12",
      "replies": []
    },
    {
      "text": "What’s the problem? Can’t he just work from home? He is going to be the 1st prime minister of our country working from abroad. We should be proud of that.",
      "votes": "16",
      "replies": []
    },
    {
      "text": "হয়তো নিজেকে শক্ত নেতা হিসেবে প্রমান করতে চাইছেন যে ব্যক্তি খালেদা জিয়ার চেয়ে দল বিএনপি বড় তাই তফসিল ঘোষণা না হওয়া পর্যন্ত উনি আসবেন না আবার এমনও হতে পারে দেশে আসাকে আরো যৌক্তিক করতে চান কারণ মৃত মা কে দেখতে আশাই স্বাভাবিক আর প্রতিপক্ষের বাঁধাও তাতে কমে যাবে।",
      "votes": "3",
      "replies": []
    },
    {
      "text": "জামাতের যতদিন ক্ষমতায় যাওয়ার সম্ভাবনা উজ্জ্বল ততদিন তারেক রহমান দেশে ফিরতে পারবেন না। জামাতকে রাজনীতিতে ফেরত আনতে বা পুনর্বাসন করতে বা পুনরায় উদ্ধার করতে পিতা জিয়ার মতন তারেক রহমানের ডাক পড়বে। জামাত যদি কোনদিন বিপদে পড়ে বাংলাদেশে, নিষিদ্ধ হয় বা ক্ষমতা থেকে একশো হাত দূরে ছিটকে পড়ে, তবে তারেক রহমানকে জামাতের আবারো দরকার পড়বে। তখন তারেক রহমান দেশে ফিরবেন। এর আগে কোন সম্ভাবনা নাই।",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Their own appointed officers broke his bones. How can he trust on the armed forces who sre currently out of their barracks?! Also, Dr. Younus was one of the allies of the 1/11 culprits (if you don't wanna acknowledge this, just go and read the history again). Moin Uddin-Fakhruddin tried to make Dr.Y the PM and rule the country for a few more years. So, how can T.R. blindly trust on Dr.Y that he wouldn't play any card this time. Or maybe somebody else wouldn't try to use Dr.Y. as a piece on the chessboard like 1/11 and push Tareq to the edgyof death again?! As he is now the last physically fit and mature member of his family, killing him would be enough to erase that family",
      "votes": "4",
      "replies": [
        {
          "text": "O acha. Tareque cannot blindly trust Yunus with his own security. But he placed the entire country on the hand of Yunus. The people of Bangladesh is safe at his hand? He gave full support to Yunus govt. So by your own logic, why should the people of Bangladesh trust TR? He places himself over the entire country. He supported Yunus to lead Bangladesh but he himself dont belief Yunus is a good person? Some logic? Huh.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Tarek will be assassinated just like Benazir Bhutto. Sazib wazed joy & Putul are not capable enough to lead Awami League. If Khaleda Zia die & Tarek is also eliminated, it will be over for both Awami League & BNP & it will make Jamaat the only organised party of Bangladesh.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Tarique Rahman was brutally tortured before he came to the UK. Returning to a country to risk assassination and torture, is not very appealing. Even winning and becoming the PM is not a fun job. There are endemic problems with no quick solution and the tools at one's disposal: the bureaucracy, the business oligarchy and the ruling party, are corrupt and with diverging interests.\nDont get me wrong I am not a fan of him or Shabib Wazed. Still, I can understand their preference for a quiet life in an expensive, safe suburb abroad to riding the tiger of political leadership in Bangladesh.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "He is just creating hype being mysterious and protraying humble persona which he not in real life",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Tareque should do what Rahul gandhi did with Congress.\nRahul chose to lead the party while promoting a deserving candidate in Manmohan singh to become the Prime minister.\nI do feel BNP has a number of such candidates who can become the next PM doesnt necessarily need to be tareque rahman. But he can still play a major role in BD politics.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "He probably has a British Passport.",
      "votes": "1",
      "replies": [
        {
          "text": "That’s not a major obstacle",
          "votes": "9",
          "replies": []
        }
      ]
    },
    {
      "text": "আহারে দেশের জন্য কি আত্মত্যাগ ! মা মরলে মরুক তবুও ক্ষমতায় না গেলে দেশে ফিরবেনা আমাগো লেতা 😁",
      "votes": "0",
      "replies": []
    },
    {
      "text": "This here is what's wrong with our politics in a nutshell.\nEvery corrupt politicians like him or Zia family or the Sheikh family and others should stay the fuck away from the country unless they are in prison for their crime.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 118
}