{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p9jhg0/sampriti_jatra_event_for_baul_abul_sarkar/",
  "hash": "7263cb158391394951f503f1f9db307b",
  "scraped_at": "2025-12-08T11:50:11.773878",
  "title": "Sampriti Jatra event for Baul Abul Sarkar interrupted by July Mancha",
  "description": null,
  "votes": "56",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "July Mancha = Rajakar Hefajoti Moulibadi",
      "votes": "37",
      "replies": []
    },
    {
      "text": "What the fuck is a July Mancha?",
      "votes": "7",
      "replies": []
    },
    {
      "text": "When Mazars were first attacked most people on social media and here in this subreddit said it was due to the interim government’s lack of control over the police because they were new despite the clear evidence that the police had already been used successfully and effectively to disperse protestors be it against Adivasis, workers or general people. More than five months had passed, which is enough time for any government to gain adequate control over the police.\nWhen talking about the vandalization of Mazars we need to break it down. What is the vandalization of Mazars? It is a crime of one type, one pattern, repeatedly carried out against a religious site, over 150 times in the past year.\nHow can the police not catch anyone when the pattern is this obvious? We could say they are dumb and incompetent but they are not. These crimes happened with at least some level of government complicity. Without that these incidents would not be possible.\nThe same will happen with crimes against Bauls or whichever cultural group the Touhidi Janata targets next. At most Mahfuz will put up a fb post \"condemning\" it in half baked Bangla and the chief press secretary will give a brief.\nThis part is a bit irrelevant but I should mention it. After July one of the most popular demands was to restructure the police department entirely.\nThe UN specifically sent suggestions about removing colonial era laws and establishing an independent commission to control the police so these crimes against humanity don't happen again.\nThe interim government rejected all of these proposals and kept the same police force that will be used again on you and me. When I posted about this last year in this subreddit the only comments I got were \"Bangladesh does not have money to run a commission\" or \"the police will be ineffective\" Neither is true.\nBangladesh has enough money to run a hundred such commissions and police forces with similar independent commissions exist around the world and are more effective than Bangladesh.\nThe reason police are not stopping these crimes is not because they are ineffective or divided but because of a clear government agenda that prevents them from acting. Instead of focusing on this they've kept you busy debating completely pointless things like what color the police uniform should be.",
      "votes": "8",
      "replies": [
        {
          "text": "\"The interim government rejected all of these proposals \"\nInterim did not, police themselves did. Just like the amlas, or the doctors, or the education cadre, or the nbr.\nWhole of govt rejected reform proposals, maybe try to be a bit factual next time. You are spouting nonsense disinformation masquerading as critics.",
          "votes": "-4",
          "replies": [
            {
              "text": "\"The interim government rejected all of these proposals \"\nInterim did not, police themselves did. Just like the amlas, or the doctors, or the education cadre, or the nbr.\nWhole of govt rejected reform proposals, maybe try to be a bit factual next time. You are spouting nonsense disinformation masquerading as critics.\nProjection much? Which part is the disinformation? Here are some of the UN's proposals regarding police reforms. Here is a news report from The Daily Star where Badiul Alam who is a member of the National Consensus Commission clearly states how the Home ministry opposed such reforms.\nSpeaking at the discussion titled, \"Need for Police Reform: Civil Society Perspective\", organised by The Daily Star at its centre in Dhaka at 4:00pm, Badiul said reforming the colonial-era Police Act alone would not be enough to address the structural problems within the force.\nBadiul, also the Shushashoner Jonno Nagorik (Shujan) secretary, said some reforms could be implemented through administrative decisions. \"But the POLICE commission report did not include the proposal for an independent police commission. We believe such a recommendation should have come from the Police Commission. Among our 84 reform proposals, the formation of a police commission was included. It deserves priority.\"\n\"There was no note of dissent,\" he said. \"But unfortunately, the home ministry opposed it.\"\nIf you are going to shamelessly defend the interim government and shift blames, at least put some more effort to make your case stronger.",
              "votes": "4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "So I just check on this July Mancha and HOLY GRIFFTERS. Anything they do and say has the title \"July\" in it. These fuckers are trying to be a more 'populist' group than NCP.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Any Bangladesh gen-Z would like to say anything on this? After all, your age group people are only supporting this action!",
      "votes": "3",
      "replies": [
        {
          "text": "Just gotta ask are you saying this cause most Genz took part in the protest that threw out Hasina and Awamilig. If not then you are widely unaware about how much genz hates these. If so I think you are wildly crazy to think just because a group stands against one evil they'll automatically support another.",
          "votes": "2",
          "replies": [
            {
              "text": "only saying we hate it isn’t going to matter anymore as they uprooted the pervious government by their actions, so people will expect similar actions now from them, if they just say we hate them but then doing nothing then people will take them as hypocrites.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Why is the interim not doing anything about it? Not because they cannot. They have very well beaten up DU students at Shahbagh, the largest pressure group around the Shahbagh area - so they can do so. But they won't, because \"Touhidi Jonota\" is their fucking allies who help them consolidate power. Zia petronised them for consolidating power, so did Ershad, Khaleda, Hasina. Petronising them is a way of staying in power, consolidating power.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "-14",
      "replies": [
        {
          "text": "\"Anyone who protests against terrorism is Awami League\" is not gonna work out well in the long run.",
          "votes": "22",
          "replies": [
            {
              "text": "",
              "votes": "-5",
              "replies": []
            }
          ]
        },
        {
          "text": "& July Mancha = Rajakar",
          "votes": "10",
          "replies": [
            {
              "text": "",
              "votes": "-5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "-7",
      "replies": [
        {
          "text": "বোকাচোদা বাঙালি নিজের গায়ে না লাগলে কিছুই টের পায় না।",
          "votes": "9",
          "replies": []
        },
        {
          "text": "আপনার কমেন্টের downvote count দেখে আমাদেরও একই প্রতিক্রিয়া।",
          "votes": "1",
          "replies": [
            {
              "text": "আমি ক্ষুব্ধ। এর প্রতিবাদ জানাচ্ছি।",
              "votes": "-1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "জুলাই মঞ্চ তাহলে প্রগতিশীল মঞ্চ না? 🤔",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 120
}