{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p9gx6f/%E0%A6%86%E0%A6%A7%E0%A6%AF%E0%A6%A4%E0%A6%AE%E0%A6%95%E0%A6%A4%E0%A6%B0_%E0%A6%B8%E0%A6%A5_%E0%A6%A6%E0%A6%B0%E0%A6%A6%E0%A6%B0%E0%A6%A4%E0%A6%B0_%E0%A6%95_%E0%A6%95%E0%A6%A8_%E0%A6%B8%E0%A6%AE%E0%A6%AA%E0%A6%B0%E0%A6%95_%E0%A6%86%E0%A6%9B/",
  "hash": "44740fc19ed26f20e4427786e3c6017a",
  "scraped_at": "2025-12-08T11:50:46.982727",
  "title": "আধ্যাত্মিকতার সাথে দারিদ্রতার কি কোন সম্পর্ক আছে ?",
  "description": "দারিদ্রতার সাথে আধ্যাত্মিকতার কি কোন সম্পর্ক আছে ? পৃথিবীর মানুষ কে হাজার বছর ধরে মুগ্ধ করে রাখা আধ্যাত্মিক নেতা রা কিন্তু আখেরে দরিদ্র ছিল । রাজার ছেলে সিদ্ধার্থ গৌতম সব ছেড়ে দরিদ্রতা গ্রহণ করেই বুদ্ধ হয়েছিলেন ।\nআমাদের দেশে আধ্যাত্মিক এবং ভালো ধার্মিক গরীব কিংবা পেটেভাতে জীবন চলে যায় এমন মানুষই বেশী।\nযাঁর আর্থিক অবস্থা ভালো তাঁদের বেশির ভাগ কে আমি গোড়া ধার্মিক অথবা ধর্ম নিয়ে কেয়ার লেস থাকতে দেখেছি ।\nআপনারা কেউ কি আমার এই ধারণা কে পাল্টাতে সাহায্য করবেন ?",
  "votes": "9",
  "comments": [
    {
      "text": "হ্যা, আছে। এটি হল Maslow's hierarchy of needs. যেখানে মাসলো দেখিয়েছেন কিভাবে আমরা সেল্ফ একচুয়ালাইজেশনে পৌছাই। সেল্ফ একচুয়ালাইজেশন হচ্ছে এমন একটি স্টেট যেখানে আমরা নিজেকে জানি, নতুন কিছু আবিষ্কার করার চিন্তা করি বা অনেক কিছুই। যারা খাবার পায় না, লাইফে সিকুউরিটি কম তার জীবন নিয়ে চিন্তা করার সময় নাই। সে একটি সাইকেলে দৌড়ায়। তার নিজেকে জানার, বোঝার সময় নাই। সেল্ফ একচুয়ালাইজেশনে মানুষের নিডস থাকেনা। অনলাইমে মাসলোর এটি নিয়ে অনেক আর্টিকেল আছে বিস্তারিত জানতে পারবেন। তবে এক্সেপশনাল কেস অবশ্যই আছে যারা এগুলোকেও কেয়ার না করে একদম উপরের স্তরে পৌছে যায়। যদি আপনি তৃষ্ণার্ত থাকেন তবে অবশ্যই মরুভূমি আপনার জন্য একটি অভিশাপ।\nNB: যদি আপনি সব ধর্মকে স্পিরিচুয়াল মনে করে u r wrong. স্পিরিচুয়ালিটি বলতে আপনি যদি শুধু ধর্মকেই মিন করেন তাহলে এটি একটি ভিন্ন অবস্থান",
      "votes": "10",
      "replies": [
        {
          "text": "কিন্তু এটা একদম হার্ড রুল না। অনেক মানুষ দারিদ্র্যের মধ্যেও শিক্ষা, সৃজনশীলতা, উদ্দেশ্য খুঁজে পায়। তাই গরিব হলে self-actualization সম্ভব না, এভাবে বলা একটু oversimplification হয়ে যায়। Overall, it's vague.",
          "votes": "2",
          "replies": []
        },
        {
          "text": "অর্থাৎ, আধ্যাত্মিকতার জন্য দারিদ্র্য প্রয়োজনীয় নয়, এটি ক্ষেত্র বিশেষে কারো কারো জন্যে প্রয়োজনিয় উদ্দীপক হতে পারে, তাইতো ?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "hmm",
      "votes": "2",
      "replies": []
    },
    {
      "text": "জীবনে অভাব থাকলেই আপনি অভাব এর justificstion দেয়ার চেষ্টা করবেন। যেমন: ঠিক আছে অভাব আছে, কিন্তু, এইটা এইটা করলে পরের লাইফে অভাব থাকবে না। So, আধ্যাত্মিকতা আনার জন্য দরিদ্র হওয়া প্রয়োজন।\nআর, আপনার observation ঠিক। আধ্যাত্মিকতা দরিদ্ররা খুঁজে এবং দরিদ্র মানুষের সংখ্যা অনেক। তাই, ইকোনমি অফ স্কেলে এদের থেকে ভালোই লাভ করা যায়। এজন্য entrepreneur রা এইটাকে কাজে লাগিয়ে দারুন ব্যবসা করে। এখন, এই entrepreneur দের মার্কেটিং চেহারা(ধার্মিক গরীব) আর আসল চেহারা ডিফারেন্ট হইতেই পারে। 24 ঘণ্টা তো আর কাজ করা যায় না।",
      "votes": "2",
      "replies": [
        {
          "text": "এইটা অবশ্য ঠিক বলেছেন যেহেতু গরীব শ্রেনী বেশি আধ্যাত্মিক সুতরাং তাঁদের কে খদ্দের হিসেবে সবাই পেতে চায় , ওহাবী হুজুর হোক মাজার ব্যবসায়ী হোক কিংবা সুফি সাধক। কিন্তু অন্তরে তীব্র ভালোবাসা নিয়ে তাঁদের দুদণ্ড শান্তি দেবার বাসনা যেমন গৌতম বুদ্ধ করেছিল সেই টাইপের সাধক অন্তত আমাদের সমাজে চোঁখে পড়ে না । বেশি ধর্ম ব্যবসায়ীদের কারনেই কি আমাদের সমাজের এই আধ্যাত্মিক আচরণ ক্রমশ গোঁড়ামির দিকে রূপ নিচ্ছে ?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "As Karl Marx said religion is a response to hardship, not the cause of it. People turn to religion because society is harsh, unequal, or exploitative. In a society were everyone is happy there is no need for religion.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "W.r.t. u/Cassanova-1214, Catholic church did all that to keep themselves as the agent of God on earth. Only they will learn Hebrew and tell people what God wants them to do - and in that process, take money from people. As if they are the broker between God and people.\nEvery religion had a clergy that tried to establish itself as the agent of God and gatekeeping the scriptures through complexities. Brahmins in Hindu religion did the same thing. Only they knew proper Sanskrit and told people \"You cannot read shastra because you don't know Sanskrit. Pay me. I will tell you what to do cause I know the complexities of Sanskrit.\" Catholics did the same. These are people who earn money selling religion.\nHujurs do the same thing. They say \"You cannot understand the whole Holy Quran because it is very nuanced and complex. I study the complexities, so pay me to tell you what to do to reach Jannat.\" And the clashes between Hujur groups happen because one group tries to undermine the understanding of another group, creating new hegemony over religious knowledge. That's why they have cars, flats, and even helicopters. (Allah says in the Quran that He made it easy for us to understand, but Mullahs say different.)\nIn the case of mystics, they do not care about earning money selling their mysticism. So they do not get rich. (Some of them, fake ones, try to earn money selling a mystic image - you will see them in Ajmer and many mazars around the country.) There is an excellent interview by Kalikaprasad where he said in a discussion with Shah Abdul Karim, he was told by Abdul Karim that the difference between a singer and a baul is that a singer will not perform in front of 2 people because they perform, but a baul will, because they preach even if to one person. Their purpose is to preach their understanding without anything in return. Mansur Hallaj used to pray that \"God, make me so miserable that I have nowhere else but you to turn to.\" And Allah made him miserable, so much that he had no place in the society.\nSo, to answer why u/Cassanova-1214 is relevant, they tried to show the counterpart of mystics who get rich.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "গৌতম এর বৈষয়িক মোহভঙ্গ হয়েছিল, কেউ বৈষয়িক মোহভঙ্গ হলে তার কাছে টাকা পয়সা ধন রত্ন তখন রাস্তায় পরে থাকা নুড়িপাথরের থেকে আলাদা কিছু বলে আর মনে হয় না। তাই তিনি আধ্যাতিকতা লাভের জন্য দারিদ্রতা গ্রহণ করেননি, বরং তিনি মানসিক ভাবে আধ্যাতিকতার ওই স্তরে পৌঁছেছিলেন যেখানে ধন সম্পদ প্রতিপত্তি আর কোনো অর্থবহন করে না, আর যার কাছে যেটা কোনো অর্থবহন করে না সেটা করতে যাওয়া তার জন্য বাতুলতা।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "বাইবেল ছিল হিব্রু ভাষার কিতাব,সেটাকে ইংরেজিতে অনুবাদ করেন জন ওয়েকলিফ নাম একজন পাদ্রী ,আর সেই অপরাধে তার মারা যাবার ৪৪ বছর পর তার লাশ কবর থেকে তুলে জ্বালিয়ে দেয়া হয়।\nYes, the Catholic Church had John Wycliffe's body exhumed and burned after his death because they considered him a heretic*. This happened in 1428, about 44 years after he died, following the Council of Constance's condemnation of his teachings in 1415. His ashes were then scattered into the River Swift.*\nYes, Giordano Bruno was executed by the Roman Inquisition, an arm of the Catholic Church, in 1600 for heresy**. While his heliocentric views and ideas about an infinite universe are what he is most remembered for, his execution was for a combination of theological and philosophical heresies, which included denying the divinity of Christ and the Trinity. He refused to recant his beliefs and was burned at the stake",
      "votes": "3",
      "replies": [
        {
          "text": "I think you intended to post this on different thread.\nThis comment has literally no connection to the question OP asked.",
          "votes": "4",
          "replies": [
            {
              "text": "i post into parts, bcz whole comm can't be posted in 1 comm",
              "votes": "0",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "কেউ কি আসলে জানে আবুল সরকার কি বলেছিলো ! সে বলে ছিল আল্লাহর কথার গোয়া (আগা ) মাথা খুঁজে পাই না। কথা তো সে মিথ্যা কিছু বলে নাই। পবিত্র কুর যান এ অসংখ আয়াত আছে , যেখানে একটা কথা আরেকটা কথার সাথে মিলে না ! মেটাফোর। যেমন সূরা নূর এর ৩৫ নং আয়াত \"আল্লাহু নুরুস সামাওয়াতি ওয়াল আরদ\" একটি আরবি আয়াত যার অর্থ \"আল্লাহ আসমান ও জমিনের আলো\"",
      "votes": "3",
      "replies": [
        {
          "text": "ব্রো ব্যাপার টা অফ টপিক হয়ে গেল না ? আমি আসলে দারিদ্রের সাথে আধ্যাত্মিকতার সম্পর্ক খোঁজার চেষ্টা করছিলাম । এখন যদি চান আপনার এই টপিক নিয়ে আলোচনা করার জায়গা আছে ,শুরু করবো ?",
          "votes": "7",
          "replies": [
            {
              "text": "মোটেও অফ টপিক না। ১০০% রিলেটেড। দারিদ্রতার ভিতরে অধ্যযিক মুক্তি আছে। আর ধর্ম বেবসার ভিতরে আছে বিশাল জৌলস ! এখন ধর্ম গুলা অধ্যাত্বিকতার বিরুদ্ধে কারণ , আধ্যাতিক মুক্তির সত্য জেনে গেলে তাদের অর্থের জৌলস থাকবে না। উদাহরণ বাংলাদেশ। প্রতি বছর কয়েক বিলিয়ন ডলার জাকাত কুরবানীর চামড়ার গন্তব্য মাদ্রাসা গুলো। ৫৫ বছরে কয়েকশত বিলিয়ন Dollar তারা ভুরিভোজ করে উড়িয়ে দিয়েছে। অথচ জাকাত এর ৮ তা খাত এর একটা মাদ্রসা। তও সেখানে দিতে বলা হয়েছে শিক্ষা গবেষণার জন্য। ভুরিভোজের জন্য না।",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "\"মিলে না\" আর \"মেটাফোর\" দুইটা দুই রকম অর্থ বহন করে। দয়া করে মানুষকে বিভ্রান্ত করবেন না।",
          "votes": "2",
          "replies": [
            {
              "text": "বিভ্রান্ত তোমরা মানুষ কে কইরো না , বয়স কত তোমার , কি কি পড়ছো ! আমার হাঁটুর বয়স ও তো হয় নাই , ১২ বছর শুধু এস্ট্রোনমি ই পড়তেছি তুমি আইসা মোল্লাগিরি করব ! এত হেডম থাকলে এস লাইভ বসো। দেখি কুর যান ,হাদিস ,বাইবেল গীতা কি কি পড়ছো !",
              "votes": "-3",
              "replies": []
            },
            {
              "text": "",
              "votes": "-5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "You can engage your brain in earning money, or engage your brain in deep spiritual thoughts. Can't do both simultaneously and be good at it.",
      "votes": "0",
      "replies": [
        {
          "text": "I disagree. You dont have to sit under a waterfall for hours to be spiritual. You can be spiritual by doing the simplest things like taking care of the orphans, smiling at your mother,kissing the forehead of your wife.",
          "votes": "1",
          "replies": []
        },
        {
          "text": "আসলেই টাকায় ফোকাস করলে সহজ ধর্মাচরণ করা সম্ভব কিন্তু গভীর আধ্যাত্ম জ্ঞানে প্রবেশ করা অসম্ভব হয়ে যায় আবার আধ্যাত্ম জ্ঞানে ফোকাস দিলে টাকা কামানোর ফন্দি ফিকির গুলো ঠিক আয়ত্বে আসে না ,আর এই বঙ্গ দেশে ফন্দি ফিকির ছাড়া টাকা কামানো খুবই শক্ত যেখানে একজন উচ্চশিক্ষিত মানুষকেও বারো হাজার টাকার চাকরি অফার করা যায় সেখানে বেচারি এক্সট্রা ইনকামের ধান্দায় হন্যে হয়ে ঘোরে সেখানে কিভাবে সে আধ্যাত্ম জ্ঞানের চর্চা আর উপার্জন একসাথে মেইনটেইন করবে ।",
          "votes": "1",
          "replies": [
            {
              "text": "অথচ টাকা এবং পাওয়ার দুইটাই আছে আধ্যাতিক জ্ঞানের মাঝে। এই কারণেই global এলিট সোসাইটি বিভিন্ন NGO ভিত্তিক ধমীয় মতবাদ (WAHBIST ahlehadis ,HT) এর মাধ্যমে শিক্ষা গবেষণা নিয়ন্ত্রণের মাধ্যমে সাধারণ মানুষ কে অধ্যাতবাদ থেকে দূরে রাখতে চায়",
              "votes": "0",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "very informative https://www.youtube.com/watch?v=xm1WLjHFBrE",
      "votes": "1",
      "replies": []
    },
    {
      "text": "For people who are actually spiritual, spirituality is the main thing. They don’t see money as the point of life. But that also doesn’t mean being poor is the point either. Allah gives wealth to some people and keeps others low, and both can be tests. Prophet Sulaiman (AS) and other prophets had huge wealth, so clearly being close to God doesn’t require being broke. এটা পুরোটাই কালচারাল একটা বোগাস, বাঙ্গু কালচার আরকি। ইট হ্যাস নাথিং টু ডু উইথ স্পিরিচুয়ালিটি।\nand for people who aren’t spiritual, life goals are just personal. Not everyone even wants to be rich. And goals change with time too. A few years ago people dreamed about settling in a big city. Now some people dream about buying a Lamborghini. So wanting money (or not wanting it) isn’t really proof of someone being spiritual or not. It’s just a goal they have.\nAlso, someone can be religious and still be money-focused for practical reasons. Like wanting financial security, wanting to retire early, or just not wanting their family to struggle. That doesn’t cancel their faith. The real issue is how they chase wealth and what they put above what: halal vs haram, humility vs arrogance, generosity vs greed. কারো লাইফ নিয়ে অতি উচ্চাকাঙ্ক্ষা না-ই থাকতে পারে । It's totally subjective.\nFinally, if you’re Muslim, Surah Al-Waqi’ah is worth reflecting on, hopefully this will help you gain a new perspective!",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 122
}