{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p9gtq7/how_was_your_experience_on_improving_english/",
  "hash": "e6a7b053769b17d821cf0dc5beb2917a",
  "scraped_at": "2025-12-08T11:51:08.371084",
  "title": "How was your experience on improving English?",
  "description": "It's well known that most of the Bangladeshi people are weak in English. I still remember, in my childhood I made a notebook just to learn the meanings of some preposition. For me my English started improving after Grade 5, I didn't take English must seriously from then. It looked more like a language than a subject to me back then. As I've wasted my whole teenage rotting inside home, socially isolating myself, bad mental health and not going through normal teenage development I was basically wasting my time on games and discord chats, reading Japanese comics-cartoons (Anime, Manga) etc. . Which helped me learn and understand English more like a language. However started going to offline coaching and started socializing after 8 years which helped in proper development but on the other hand I lost my touch on English as I'm not into International community/discord/ Gaming anymore.\nWhat was your experience? How did your English improve?",
  "votes": "2",
  "comments": [
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Personally, Enthusiasm & curiosity. Studied in BM my whole life but was really into english songs and movies. Listening to it and trying to talk to foreigners while living in Bangladesh kinda helped to gain that initial confidence. I think the more exposure you get the better it is.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I read a lot of books and watched a lot of old Hollywood movies growing up (I was 8 reading an abridged version of Tom Sawyer, a child-friendly version of Hamlet, and watching movies like It's a Wonderful Life). Thus, as a second language, English has always come naturally. I suppose, that'd work for most people as well. People tend to underestimate how big a role reading plays.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 123
}