{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p8tams/damn_i_didnt_realise_bangladesh_is_that_big/",
  "hash": "b6c4e0131f43c7dc10e0225a6c5e016a",
  "scraped_at": "2025-12-08T11:52:44.035833",
  "title": "Damn! I didn't realise Bangladesh is that big compared to European countries! I thought we were so tiny!",
  "description": null,
  "votes": "155",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "List of countries I was surprised to know are smaller than Bangladesh:\n- Greece\n- Jordan\n- Austria\n- Iceland\n- Denmark\n- The Netherlands\n- Belgium\n- Haiti\n- Lebanon\n- Maldives",
      "votes": "80",
      "replies": [
        {
          "text": "All these countries has a population smaller than the only Dhaka",
          "votes": "38",
          "replies": []
        },
        {
          "text": "haiti and lebanon chara baki sob gula desh bangladesh theke better.....'''size doesnt matter'' proved",
          "votes": "29",
          "replies": [
            {
              "text": "of course. Amader desh choto lage karon amader population ei desh gular cheye prai 10 gun beshi.",
              "votes": "22",
              "replies": []
            },
            {
              "text": "Pre war Lebanon was doing better too.",
              "votes": "6",
              "replies": []
            }
          ]
        },
        {
          "text": "How about population? Could be more than all these countries together!",
          "votes": "3",
          "replies": [
            {
              "text": "Combined population of all this countries is slightly more than half of that of Bangladesh.",
              "votes": "4",
              "replies": []
            },
            {
              "text": "Greece and Jordan have populations in the 10s of millions. Bangladesh has 150 million at least.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "It's due to Mercator projection that on a map places far from the equator look so big. Russia and Africa is the best example of this.",
      "votes": "34",
      "replies": []
    },
    {
      "text": "No way! BD is bigger than GREECE?",
      "votes": "16",
      "replies": [
        {
          "text": "Bigger than most Bolkan countries!",
          "votes": "17",
          "replies": []
        }
      ]
    },
    {
      "text": "That’s called “Delta Power” also don’t forget the curvature of Mother Earth.",
      "votes": "8",
      "replies": [
        {
          "text": "\"Delta Power\" - Paul Atreides from Dune if Arrakis was a river planet",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "This is because of 'Mercator Projection'. Northern countries look bigger then they actually are.",
      "votes": "13",
      "replies": []
    },
    {
      "text": "Still fairly small relative to population",
      "votes": "6",
      "replies": [
        {
          "text": "Extremely small relative to the population. We have almost as many people as France and Germany combined.",
          "votes": "9",
          "replies": []
        }
      ]
    },
    {
      "text": "Does size matter?",
      "votes": "9",
      "replies": [
        {
          "text": "Yes bro it does.",
          "votes": "11",
          "replies": [
            {
              "text": "That's not what she said",
              "votes": "9",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "We think the whole nation is small because the world says that we are small but if you travel across the country, you will see that this so-called \"tiny\" country bordering India and Myanmar has many interesting places and things that reveal its true size and great culture.",
      "votes": "12",
      "replies": [
        {
          "text": "Before internet culture before we developed a globalised brainrot, none of us in the country thought we were small. Travelling from Barisal to Dhaka felt like going to a different world with different flavored Bengalis. If you think about it, there are so many sub-categories of Bengalis and Bengali-adjacent ethnicities native to our Bangladesh, every few kilometers you can hear a different accent until it slowly transitions into a different dialect entirely.\nDamn ngl I miss when we were a big extended family just curious and interested in our own differences instead of worrying about what the outside world thought",
          "votes": "10",
          "replies": []
        }
      ]
    },
    {
      "text": "Italy, Germany and France population combined is probably lower than Bangladesh population",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Did you compare populations as well? It is also important to consider how many people live in a tiny place!",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Netherlands is 3.5x smaller than Bangladesh but the GDP is 36x.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Bangladesh is roughly 3.5 times larger than the Netherlands, yet has 10 times the population, even though we both are deltaic nations with similar soil quality\nEven by European standards the Netherlands is densely populated. It is vile that we continue on to overburden our land and ourselves",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Bangladesh is bigger than England.And compare that how many football clubs England has. Also if we count only habitable plainland-bangladesh will be among top 50 in the world,also it grows food for 20 crore people imagine that,with very little importing needed compared to other first world countries.",
      "votes": "1",
      "replies": [
        {
          "text": "",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Yeah, bigger than England and South Korea.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "We dont appreciate our manchitro enough. She is so classy and elegant. Only Greece comes close in prettiness in europe",
      "votes": "1",
      "replies": []
    },
    {
      "text": "All of this because of the media choosing the usual Oxford(prob) Cartographer's map, which makes the equatorial regions 'compressed'(it's not wrong btw, it's just one projection).\nHave a look at Gall-Peter's projection, this would give you a better idea(https://en.wikipedia.org/wiki/Gall%E2%80%93Peters_projection).",
      "votes": "1",
      "replies": []
    },
    {
      "text": "instead of comparing it like this (which can be inaccurate due to scaling issues), compare by square kilometers of area",
      "votes": "1",
      "replies": [
        {
          "text": "Do that",
          "votes": "2",
          "replies": []
        }
      ]
    }
  ],
  "id": 129
}