{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p8s9v4/between_erasure_and_belonging_the_biharis_in/",
  "hash": "1746a502c1bb750b56c1b31576cde5fb",
  "scraped_at": "2025-12-08T11:53:38.047650",
  "title": "Between Erasure and Belonging: The Biharis in Bangladesh",
  "description": "After the partition of 1947, many Hindi- and Urdu-speaking migrants from India came to Bangladesh and became known as Biharis. In the early years, there were occasional clashes between communities, but the most severe rupture occurred in 1971. A significant portion of the Bihari population aligned themselves with Pakistan and actively participated in pro-Pakistani paramilitary forces such as the Razakars and Al-Badr. However, it is important to note that some Biharis also fought as freedom fighters or supported the liberation of Bangladesh\nAfter Bangladesh’s victory on December 16, 1971, the Bihari community faced widespread persecution due to their perceived collaboration with the Pakistani military and paramilitary forces during the Liberation War; while some Biharis had supported independence, many were collectively punished, with thousands killed in reprisals, and survivors forced into displacement and confinement in camps such as Geneva Camp in Dhaka, where they endured decades of statelessness, poverty, and social stigma; although later court rulings granted citizenship rights to younger generations born after 1971, older Biharis remain marginalized, struggling with limited access to education, healthcare, and employment, and often compelled to conceal their cultural identity to avoid discrimination.\nI believe the Bihari community in Bangladesh has largely blended into Bengali society, often out of necessity rather than choice. Many families had to adopt a Bengali identity to survive socially and economically. For example, my grandfather’s neighbor was Bihari — though they spoke Bangla and lived like Bengalis but in the end they cant left their identity as bihari . We maintained a good relation with them. Later, one of my uncles(my grandfather's sister's son} even married a girl from that family.",
  "votes": "4",
  "comments": [
    {
      "text": "While I agree that they deserve better lives, your post sort of gives a vibe that all the responsibilities are from our govt side. A few points I want to mention.\nThere were attempts from govts to naturalize them, which they denied. They believed in Pakistan and left their own land for it. Pakistan only needed them for political reasons, and never accepted them after the liberation war. Hands are tied on this side, you can not just normalize life for stranded foreigners without papers. Most countries take much serious action on cases like this.\nYou already mentioned their assistance to the pak army during the war. However you failed to mention how they continued that even after war. In areas where Biharis controlled, atrocities continued even after war. Some famous people like jahir rayhan were murdered.\nThe differences between the people were huge. Biharis, before liberation, had a superiority complex, thinking themselves superior to Bengalis, like their Punjabi overlords. Even after liberation, they kept their separate identity, intentionally. I remember, even in the 2000s, I saw Pakistani flags in mirpur 11 no Bazar, and no, not world cup season. For the old gen, I think it was the hope that someday their country (Pakistan), will take them, and they will not have to deal with this country anymore.\nThere is an underlying religious issue here. Biharis practice a few things, which are not really accepted by most traditional Bengali Muslims. So 'muslims under one banner' thing also never worked for them.\nI feel like, they somehow kept the door closed, and an assimilation was always gonna take some time, even if they wanted it. The way things are going, probably is the easiest way. New gen of Biharis, do not really consider themselves as Pakistanis, rather most of them have taken Bangladeshi citizenship. New gen of Bengalis also don't see the Biharis that negatively, and it's gonna get better overtime. We will someday learn to accept them completely, as our own people.",
      "votes": "14",
      "replies": []
    },
    {
      "text": "The post convinently ignoring the fact that thr biharis were continuing the fight even lomg after Pakistan surrendered in 16th december. Also they rejected becoming bangladeshi citizen.",
      "votes": "23",
      "replies": [
        {
          "text": "This post was removed as it breaks reddiquette, which is a set of guidelines that all users of r/bangladesh follow in order to make the subreddit a civil discussion space.\nThis also includes discrimination or offensive language which is not tolerated here. This includes racism, misogyny, xenophobia, homophobia, and/or religious discrimination.\nBe civil. Remember the human that you're interacting with.\nWhile your post may have had substantive content, either right or wrong, we have had to remove this in order to be fair about enforcing the rules. Thank you for understanding.\nRule #1. Follow Reddiquette.\nএই পোস্টটি সরানো হয়েছে কারণ এটি রেডিকেট লঙ্ঘন করেছে। রেডিকেট হলো একটি নিয়মাবলী যা r/bangladesh এর সকল সদস্য মেনে চলে, যাতে এই প্ল্যাটফর্মটি শালীন এবং গঠনমূলক আলোচনার পরিবেশ বজায় রাখতে পারে।\nএই সাবরেডিটে কোনো ধরনের বৈষম্যমূলক বা আপত্তিকর ভাষার অনুমতি নেই। এর মধ্যে পড়ে বর্ণবাদ, নারীবিদ্বেষ, জেনোফোবিয়া, কুইয়ারফোবিয়া, এবং ধর্মীয় বৈষম্য।\nআপনার আচরণে শালীনতা বজায় রাখুন। মনে রাখবেন, যার সঙ্গে আপনি কথোপকথন করছেন, তিনিও একজন মানুষ।\nআপনার পোস্টে হয়তো গুরুত্বপূর্ণ কিছু বিষয় ছিল, তবে নিয়মের প্রয়োগ নিশ্চিত করতে এটি সরাতে হয়েছে। বিষয়টি বোঝার জন্য আপনাকে ধন্যবাদ।",
          "votes": "2",
          "replies": [
            {
              "text": "This post was removed as it breaks reddiquette, which is a set of guidelines that all users of r/bangladesh follow in order to make the subreddit a civil discussion space.\nThis also includes discrimination or offensive language which is not tolerated here. This includes racism, misogyny, xenophobia, homophobia, and/or religious discrimination.\nBe civil. Remember the human that you're interacting with.\nWhile your post may have had substantive content, either right or wrong, we have had to remove this in order to be fair about enforcing the rules. Thank you for understanding.\nRule #1. Follow Reddiquette.\nএই পোস্টটি সরানো হয়েছে কারণ এটি রেডিকেট লঙ্ঘন করেছে। রেডিকেট হলো একটি নিয়মাবলী যা r/bangladesh এর সকল সদস্য মেনে চলে, যাতে এই প্ল্যাটফর্মটি শালীন এবং গঠনমূলক আলোচনার পরিবেশ বজায় রাখতে পারে।\nএই সাবরেডিটে কোনো ধরনের বৈষম্যমূলক বা আপত্তিকর ভাষার অনুমতি নেই। এর মধ্যে পড়ে বর্ণবাদ, নারীবিদ্বেষ, জেনোফোবিয়া, কুইয়ারফোবিয়া, এবং ধর্মীয় বৈষম্য।\nআপনার আচরণে শালীনতা বজায় রাখুন। মনে রাখবেন, যার সঙ্গে আপনি কথোপকথন করছেন, তিনিও একজন মানুষ।\nআপনার পোস্টে হয়তো গুরুত্বপূর্ণ কিছু বিষয় ছিল, তবে নিয়মের প্রয়োগ নিশ্চিত করতে এটি সরাতে হয়েছে। বিষয়টি বোঝার জন্য আপনাকে ধন্যবাদ।",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "",
          "votes": "-15",
          "replies": [
            {
              "text": "You have a duplicate para though, assuming mistakenly 😅",
              "votes": "5",
              "replies": []
            },
            {
              "text": "How do you consider it is a short post? Better to acknowledge you intentionally left an important issue!",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "They belong here if they let go of their foolish \"Pakistani\" roots",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Biharis should obtain citizenship through a formal naturalization process. This requires renouncing any remaining allegiance to Pakistan and taking an oath of loyalty to Bangladesh.\nCitizenship should not be granted solely on the basis of being born after 1971.\nAppropriate incentives should be designed to support their integration, and they should also participate in a structured reform and orientation process.\nAll the camps should be abolished.\nRohingyas are also not going back as per my understanding. So the same should be done.",
      "votes": "10",
      "replies": [
        {
          "text": "Dont know about biharis but rohyngyas should not be given Bangladeshi citizenship. Yes we should care for them but that doesn't mean give them citizenship. We already have enough people",
          "votes": "3",
          "replies": [
            {
              "text": "Rohingyas are not Bangladeshi citizens. They are Burmese citizens.\nThey are from Myanmar. Myanmar discriminates against them and doesn't give them their rights.\nIt's like if we take the Buddhist tribal people in South East Bangladesh and tell them they are not Bangladeshi, they don't \"look\" Bangladeshi and their religion is not typical Bangladeshi's religion so they are not from this country.\nThose are the same \"reasons\" they are using against Muslim (and minority Hindu) Rohingya in Myanmar, especially that they \"look\" Bengali.\nAnd Bangladesh government should do more to pressure Myanmar to take their citizens back with rights. Speak up. We are stronger and richer than them anyway. Myanmar is so happy Bangladesh takes care of its burden it doesn't want, for free, without complaint.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Agree with you that Biharis should get full rights and citizenship. However, this should be bound to the recognition of war of liberation and Bangladeshi sovereignty. These days I feel like there are some right wing individuals trying to rewrite history…",
      "votes": "6",
      "replies": [
        {
          "text": "agreed",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "The High Court ruled in 2008 that Biharis are citizens.\n(Old article from 2009)\nOn May 18 last year (2008) the HC ruled that about three lakh Biharis living in the country are citizens of Bangladesh.\nhttps://www.thedailystar.net/news-detail-72960",
      "votes": "2",
      "replies": []
    }
  ],
  "id": 132
}