{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p8n3eo/what_is_your_views_of_salimullah_khan/",
  "hash": "c52a0efdaabde1e7669c573cb84e737f",
  "scraped_at": "2025-12-08T11:54:29.515932",
  "title": "What is your views of Salimullah Khan?",
  "description": "Is Salimullah Khab really a good intellectual? What is his actual contribution? And why does he never answer anything he is asked?",
  "votes": "90608",
  "comments": [
    {
      "text": "What is his views? Does he have anything of his own? He crammed up lot of theories. Whenever he attempts to use theories to describe something he fails badly. Jumps from one to another. He can never conclude anything. He has lots of biases. Sometimes he lies Between lines. Misquotes other philosophers. He just got lucky to be in an age when seems to be an intellectual void in Bangladesh. No good debaters or speakers are present. So he goes away with bullshits.",
      "votes": "5",
      "replies": [
        {
          "text": "I wouldn't say he is necessarily biased. Just highly idealistic. Apparently a lot of philosophers are like that, Plato or even Marx.",
          "votes": "5",
          "replies": [
            {
              "text": "Is he A philosopher??!! 🤣 It's a joke, right?",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": null,
      "replies": []
    },
    {
      "text": "Like how strongly he emphasizes using Bangla as the medium of instruction. Dislike his soft corner for madrasha jongis.\nIf you consider everything, dude's ok.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Solid Mollah Khan?",
      "votes": null,
      "replies": []
    },
    {
      "text": "He is what I would call a populist lefty messenger.",
      "votes": null,
      "replies": []
    },
    {
      "text": "complete fraud who never read any of the books he talks about",
      "votes": null,
      "replies": []
    },
    {
      "text": "He is very intellectual albeit purely idealistic. He is one of the people who is plunged into his theory and is unsure how the real world actually works.\nOtherwise he is quite intelligent, especially considering his view on scientism.",
      "votes": null,
      "replies": []
    },
    {
      "text": "I just find it funny that he went from full on Shahbagi to July Biplobi to Gongi sympathetizer in Bangu progressives' eyes.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Knowledgeable but not intelligent. If you are not confused enough, go listen to him.",
      "votes": null,
      "replies": []
    }
  ],
  "id": 135
}