{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p8innr/back_in_history_in_december_1992_sheikh_hasina/",
  "hash": "fd62bb46532025ba074181321a6bebb0",
  "scraped_at": "2025-12-08T11:55:02.002263",
  "title": "Back In History.. In December 1992 Sheikh Hasina ordered the author to create mob and vandalize Mandirs to have Hindu-Muslim riot",
  "description": "Sheikh Hasina has a history of harming her own supporters to gain political leverage. Almost 33 years back in December 1992 she ordered the author (Matiur Rentu) to hire local criminals to vandalize Mandirs. She wanted to achieve two objectives:\nTraumatize the Hindus so that they stop supporting Jahanara Imam’s efforts into Ghatak Dalal Nirmul Committee.\nEmbarrass the then BNP government right before the 1992 SAARC symposium.\nShe has not been brought to justice for this action.\nHere are the screenshots from page 64-66 from Matiur Rentu’s -Amar Fashi Chai.\nhttps://mazams.weebly.com/uploads/4/8/2/6/48260335/amar_fashi_chai_bangla.pdf",
  "votes": "3",
  "comments": [
    {
      "text": "Be careful with every right wing crap circulating",
      "votes": "19",
      "replies": [
        {
          "text": "As a kid I have witnessed the Dhakeswari Mandir vandalism from a rooftop at a safe distance, though I didn’t know who was responsible, until I read the book.",
          "votes": "-1",
          "replies": []
        }
      ]
    },
    {
      "text": "Jei boi poira janlen seta to mone hoy 1ta asmani kitab tai na? Erokom hajare hajare gajakhuri kahini niye manush boi likhse. Sob believe korben? Brain ta re ektu use koren.",
      "votes": "10",
      "replies": [
        {
          "text": "Let's say this story is false. But the Mandir vandalisms did take place. The author took responsibility of making it happen. It is rare that someone confessing his part in this crime. Most part of the authors book seems to be written from his personal diaries. Looking at Sheikh Hasina's personality it is hard for me to not rule out her part. She is very much capable of doing this. With the authors confessions+ Sheikh Hasina's personality it is very much believable story to me.\nIf this is a false story why let's not investigate and prove it false?",
          "votes": "0",
          "replies": [
            {
              "text": "It’s actually not rare at all for people to make dramatic confessions. you often hear things like “evil influenced me” or “I wasn’t myself then.”\nAnd about Hasina’s “personality”: how exactly are you evaluating that? Were you her friend? A family member? Obviously not. You only know her through second-hand accounts from people who themselves carry biases. So your view of her is shaped by those biases, not by direct knowledge.\nWhat you’re doing is building a frame that feels convincing to you. Anything that fits your frame you accept, and anything that contradicts it you reject. But reality doesn’t work that way.\nIf you really want an investigation and you have the authority to conduct one, go ahead. But you’re already starting from a biased position, so you’ll naturally interpret every piece of information in a way that confirms your existing beliefs. That means the outcome won’t be credible.",
              "votes": "7",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "This book used to be read in the right wing circles in the naughties. People are treating it like some new discovery\nPeople believe matiur rahman rentu? He was kicked out of the party, he has reason to be agreived. No one with any reputation has corraborated this claims.",
      "votes": "10",
      "replies": [
        {
          "text": "Matiur Rentu has taken full responsibility for his actions of executing these plans in his book(at the end). It is hard to believe that he did this out of the blue as he could be brought to justice.",
          "votes": "1",
          "replies": [
            {
              "text": "He was given safe exit and asylum. Kiser brought to justice.",
              "votes": "6",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Many of the stories in the book are facts, are known among BAL insiders, and has been corroborated too.\nFor example, the bribe she took from Ershad to participate in sham elections, making her জাতীয় ইতর in her own words (she said anyone who participates in sham elections in the 80s is a জাতীয় ইতর). This was corroborated by Obaidul Qader in a leaked interrogation video during the 1/11 time.\nAnother is her taking kickbacks for buying MiG29 during her first reign in the 90s, which was unnecessary for an impoverished country, also corroborated in the same interrogation video. There are several more such backup of claims, except those were not lucky enough to be caught on tape like the ones by Qader.\nThis particular incident is hardly surprising. BAL activists and veterans themselves always take pride in how they were the more vicious party, able to sow chaos, mayhem and destruction more effectively than their BNP rivals.",
      "votes": "-2",
      "replies": [
        {
          "text": "Bangladeshis are extremely unfortunate to haver this psycho lady as a leader. With almost the entire family gone she has become vengeful and came to Bangladesh to take her revenge. Still many people blindly support her. Only way to tackle these people is to present factual evidence.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-5",
      "replies": [
        {
          "text": "As a kid I have witnessed the Dhakeswari Mandir vandalism from a rooftop at a safe distance, though I didn’t know who was responsible, until I read the book.",
          "votes": "3",
          "replies": [
            {
              "text": "That's so terrible to witness. I see the usual downvotes are already all over your post and these comments.",
              "votes": "-4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "many Bangladeshi Hindus will still blindly support BAL because BAL have cloaked themselves as \"the secular saviors of hindus in '71\" meme and because BAL is the shining light of their bharot chetona.",
      "votes": "-4",
      "replies": [
        {
          "text": "One should read 'Orokkhito Shadhinotai Poradhinota' by Major Abul Jalil to see how 'actively' BAL participated in the Liberation War of '71.",
          "votes": "3",
          "replies": []
        },
        {
          "text": "Your right wing crap propaganda doesn't work on them.",
          "votes": "2",
          "replies": [
            {
              "text": "??? what does this even mean? Im not a right winger, modna",
              "votes": "-2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Awamileague is the biggest terrorist organization in Bangladesh. The BAL supporters can cry denial all day but they will never come up with a counter argument. Guess why?",
      "votes": "-2",
      "replies": []
    },
    {
      "text": "ওরে কমেন্ট রে!! আওয়ামী লীগের মানুষ বই লিখছে ওইটাও বিশ্বাস করা যাবে না। বিএনপি, জামাত বই লিখলেও বিশ্বাস করা যাবেনা। শুধুমাত্র শেখ পরিবারের এপ্রুভড বই বিশ্বাস করা যাবে। ওইটাই রাইট বাকি সব রং।",
      "votes": "-1",
      "replies": [
        {
          "text": "This is called confirmation bias- to believe what we want to believe even if someone presents facts. The commenters are just being humans with their biases :)",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "I’m probably older than most people on this sub. I read this book a few years ago. There were several events in the book that matched what I overheard well connected uncles say decades ago.\nI also recognize that there is a possibility that the author may have just repackaged rumors from that period into a book.\nThe issue with most books about Bangladeshi political history is that they are based on anecdotal evidence. There may be some truth to what’s written, but it’s always good to question the context.",
      "votes": "1",
      "replies": [
        {
          "text": "I agree. But here on this particular incident the author is taking responsibility of executing this crime. There is no question of the authors responsibility. Only question is:'Is it true that his boss (Sheikh Hasina) order this?'",
          "votes": "1",
          "replies": [
            {
              "text": "My personal view is that this order had to come from someone and based on context and how all power rests in one person, it’s probable that it was ordered by Hasina.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 137
}