{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pgi9hu/if_the_liberation_war_was_a_scam_then_does_a/",
  "hash": "c84bdb34323a0f19fce102e9703bacb0",
  "scraped_at": "2025-12-08T11:20:03.454602",
  "title": "If the Liberation War was a scam, then does a country called ‘Bangladesh’ even exist or not? People may have different opinions, but how reasonable is it to call your own nation’s war of independence a scam?",
  "description": "https://www.facebook.com/share/p/1Cq8v4CUeD/",
  "votes": "88",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Another bastard",
      "votes": "37",
      "replies": []
    },
    {
      "text": "Pakistane pathano hok manoshik chikhishar jonno!!",
      "votes": "26",
      "replies": []
    },
    {
      "text": "We are perhaps the only country where you'll find people studying at some of the most renowned universities, sitting in some of the most important roles in the places, and publicly denying the entire existence of their own country without any fear. Irony",
      "votes": "26",
      "replies": [
        {
          "text": "These people have deep-rooted inferiority complex in themselves.\nThey wanna erase the nation's history because they were the villains in it. And you'll see suit-tie wearing people supporting this actually. \"Academics\",\"bureaucrats\" talking about 1971 as if it was just a phase. They wanna suck Pakistan's dick so bad.",
          "votes": "10",
          "replies": []
        },
        {
          "text": "প্রথম, দ্বিতীয় বিশ্বযুদ্ধের ইতিহাস এখনো অটুট, আর আমাদের স্বাধীনতার ৫৫ বছর হতে না হতেই ইতোমধ্যে ইতিহাস বদলানো শুরু হয়ে গেছে, কারণটা কি জানেন? ওই জাতিগুলা জেনারেশন এর পর জেনারেশন ধরে তাদের নিজেদের ইতিহাস গর্বের সাথে ওন করে গেছে, আর আমাদের জেনজিদের তো ইতিহাস নিয়ে মাথা ব্যথা নাই, যে আইসা যেই ইতিহাস বুঝাবে তাই গিলবে, সুন্দর সুন্দর কথা শুনে নিজেদের দাদা দাদি নানার নানির জেনারেশনকে গণহত্যা ও ধর্ষণ করা দলকেও হাসতে হাসতে ক্ষমতায় বসাবে, কারন এদের ইতিহাস গুনার টাইম নাই।",
          "votes": "9",
          "replies": []
        },
        {
          "text": "yea. Freedom of speech / garbage 🤌",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "ভাবতে অবাক লাগে যে এরা DU এর ছাত্র ছাত্রীদের দ্বারা নির্বাচিত হয়েছে, বড় culprit তো তারা।",
      "votes": "21",
      "replies": [
        {
          "text": "\"Democracy is by the people, for the people..but people are retarded.\"",
          "votes": "14",
          "replies": []
        }
      ]
    },
    {
      "text": "I guess it makes sense !! that’s what they wanted to do all along",
      "votes": "14",
      "replies": [
        {
          "text": "Here’s more",
          "votes": "10",
          "replies": []
        },
        {
          "text": null,
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "Its kinda sad and pathetic when u call your mother who gave birth to you is scam. It can only happen to a fatherless bastards!",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Ederkei manush abar vote dibe mind it",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Bujhlam na ekta legit history niye eto controversy korte chaitese keno, and labh tai ba ki",
      "votes": "10",
      "replies": []
    },
    {
      "text": "Egulo terrorists. History would wipe them out upon time!",
      "votes": "5",
      "replies": []
    },
    {
      "text": "If the liberation is a scam, then these people probably should leave the country. They don’t need to be part of a country that they do not believe in.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "আল bot ওর এর বাচ্চা",
      "votes": "4",
      "replies": []
    },
    {
      "text": "And they are the unwanted ba*tard grandsons of their grandfathers in Pakistan. It's good that July protests were successful and these people have come out with their full face. Otherwise we won't understand what they are really capable of. No Lungibir now. Full on \"I'm a proud Rajakar mode on\" 🤡🙏",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Fing porki lovers. Era holo traitor. Juice dei lab nai. Paki ra neche dheke amader regardless.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "শাহীন নোডির পোলারে ধরে ফেল।",
      "votes": "3",
      "replies": []
    },
    {
      "text": "হুদ্দাই তো গর্বের সাথে বুক ফুলিয়ে কেউ বলতে পারেনা তুমি আমি রাজাকার।",
      "votes": "5",
      "replies": []
    },
    {
      "text": "India >> Pakistan\nYou can ask me why?\nIndia could've taken us over during the 1971 war and own us. Did they? They did business with us, and helped us develop our industries. They gave refugee to hindus as they do so in afghanistan and pakistan.\nIndia also invested in Afghanistan!! Why do you think they love India so much.\nPakistan's political parties have ties to gangs and terror groups. That entire state is a terror state more or less. Ethnic rivalries are not rare in that country. Also, less than 25 percent of bengalis stranded there have papers and they mostly work as servants, and manuel labour. Many of them are taken advantage of by the locals especially gangs.\nI'll say something that'll hurt a lot of people but : Punjabi ethnic superiority(that you'll find amongst even in indian punjabis although they're better) + Islam extermism = deadly combination. That's why on one hand they oppress, exploit the resources of balochs and try to spread terror to India.\nI will ALWAYS side with India. I don't care if they call us kanglus, I don't care if they resent us.\nI'd rather work with someone with their values intact (India) even if they hate us than someone with loose morals as you've seen them betray time and time again throughout history. If you knew how fucked up they were as a people (I know because I've made the mistake of befriending them), you'd know that trust me when i say this: I would rather hang with an islamaphobic indian than a pk from punjab or karachi. Because at least the islamaphobic indian is pure in its beliefs and there's something you can work with but when I say the pakistani ones, there's something seriously psychologically wrong with them, i mean it.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "আল সাবাহ কবেকার বাংলাদেশী নাম? এরতো জন্মতেই সমস্যা",
      "votes": "2",
      "replies": []
    },
    {
      "text": "মুক্তি যুদ্ধ অইটা যা দিয়া এদের টাইট দেওয়া হবে। বেটার, যে ওরা ওদের রিভেল করতেছে। এদের প্রাপ্য এদের বুঝিয়ে দেওয়া হবে অতি সন্নিকটে।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Majhe majhe monehoy , agei valo chilam. Hakao andolon korlam. sigh",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Ei kuttar bacha gula BAL gula abar anbe",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Well I guess you people are regretting for participating in that so-called 'July Revolution' now, or are u still in delusion?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "This is disheartening.",
      "votes": "1",
      "replies": [
        {
          "text": "Well I guess you people are regretting for participating in that so-called 'July Revolution' now, or are u still in delusion?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Well I guess you people are regretting for participating in that so-called 'July Revolution' now, or are u still in delusion?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Jamaat will face same fate BAL did...",
      "votes": "-3",
      "replies": [
        {
          "text": "question is who‘ll do it? For BAL it was jamat shibir’s meticulous plan, who will do it to remove jamat shibir?",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "No pakistan, no India. Bangladesh is Bangladesh. No training to bndhu rashtro and then \"Honey Trap\". Bangladeshi peoples mindset must be ready for any type of misadventure by \"Bondhu Rashtro\".",
      "votes": "0",
      "replies": []
    }
  ],
  "id": 14
}