{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p7zxwe/whats_with_indians_obsession_with_bangladesh_this/",
  "hash": "b79ff6fb8fb28517f150cd3a092dea35",
  "scraped_at": "2025-12-08T11:57:04.501966",
  "title": "Whats with indians obsession with Bangladesh. This is not just in this vido. I often see these comments other videos as well",
  "description": null,
  "votes": "197",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "They act as if they don't take a shit on their beach every day.",
      "votes": "80",
      "replies": [
        {
          "text": "just beaches? youre practically complementing them (and their cows)",
          "votes": "27",
          "replies": []
        }
      ]
    },
    {
      "text": "It's not their obsession with Bangladesh. It's their \"superiority complex\".",
      "votes": "101",
      "replies": [
        {
          "text": "More like inferiority complex.",
          "votes": "58",
          "replies": [
            {
              "text": "More like insecurities complex",
              "votes": "20",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "they are too insecure",
      "votes": "63",
      "replies": []
    },
    {
      "text": "They're acting like my TOXIC relatives and Kudni aunty.",
      "votes": "32",
      "replies": []
    },
    {
      "text": "They are insecure, hypocrite and too much narcissistic. and still like to bootlick US and Israel but hate their neighbours.",
      "votes": "41",
      "replies": [
        {
          "text": "Yes, Tata is sending equipment to Is-r3al to help the genocide! And they are defending it!",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "They love to lift their balls everywhere. During Diwali, I saw an American man complaining that Diwali was risking his wooden house. And a prominent rightwing content creator wrote: \"Why are you people so backward?? Look at a developed country like India. We make houses with concrete...\"",
      "votes": "18",
      "replies": [
        {
          "text": "yeah big deal, indians are the only ones in the entire Eastern hemisphere who build houses with bricks and concrete, right?! did they claim to have invented that too yet lol mojadar genre er delulu ohonkar eder bhai",
          "votes": "10",
          "replies": [
            {
              "text": "They think the sun orbits them, and they used to have a civilization that flew flying cars thousands of years ago. They invented everything, and the whole world stole their innovations... Thanks to whatsapp university where they study...",
              "votes": "7",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "আমি আজকাল ওদের এইরকম মেন্টাল ইস্যুগুলো নীরবে এনজয় করি। পৈশাচিক একটা আনন্দ পাই।",
      "votes": "15",
      "replies": []
    },
    {
      "text": "Snobby cunts they are. Most of them, and hatred is their religion. We shouldn't become like them by hating them back. Lets not take pride in what we didn't do and not hate someone we dont know. By the way, our metrorail is one of the best in the world and best in class. So fcuk em.",
      "votes": "13",
      "replies": []
    },
    {
      "text": "Let them do the dance",
      "votes": "12",
      "replies": []
    },
    {
      "text": "They're also obsessed with this sub too",
      "votes": "11",
      "replies": []
    },
    {
      "text": "Too insecure they have to compare their country that’s 10 million times bigger 100x the population to a country like BD the size of England, 98% homogeneous and still doing better than them in some regards what a waste of Poojeet inferior dna genes.",
      "votes": "13",
      "replies": []
    },
    {
      "text": "They got the bootlicking mentality. If there is a white man praising India they would strip off their clothes out of enjoyment cause they always seek the white men validation.",
      "votes": "11",
      "replies": []
    },
    {
      "text": "Insecurity, jealousy and bigotry",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Bro Indian supremacists can not leave us alone",
      "votes": "4",
      "replies": []
    },
    {
      "text": "How can a person with a name like Amit Pandey talk? Seriously. Bengalis don’t do enough to give it back (maybe that’s a good thing)",
      "votes": "4",
      "replies": []
    },
    {
      "text": "What more could you expect from streetshitters.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "This is the \"দিল্লি না ঢাকা\" slogan at its peak 🔥",
      "votes": "3",
      "replies": []
    },
    {
      "text": "They are obsessed with themselves",
      "votes": "3",
      "replies": []
    },
    {
      "text": "I’m a content creator who has made videos in Bangladesh and India… it’s true. Some of the most liked comments are about how “this is better in India” or “this is better in Bangladesh” and them commenting about each others moms and shit underneath. Just sad.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "India online RAW and Unit 8200 (Israel) alliance is the problem.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Both are obsessed with each other. Tell me why I'm suddenly an indian for voicing my opinion with logic and reasoning that shatters their worldview. I think poop eating hendutvas and mutkhor bangu momins are obsessed with each other , let's not bring our country down with these shitheads. Make them kiss each other instead.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Everyone's obsessed with each other in South Asia, we're the worst!",
      "votes": "-2",
      "replies": [
        {
          "text": "More like everyone’s obsessed with us. Indians and Pakistanis both take an unusual/creepy/weird curiosity to our country and people. You’ll know this especially if you’re overseas.",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "LoL torao to sarakhon India nia pore thakos",
      "votes": "-2",
      "replies": []
    },
    {
      "text": "",
      "votes": "-10",
      "replies": []
    },
    {
      "text": "What's with Bangladeshis' obsession with India? Same pinch.",
      "votes": "-4",
      "replies": []
    },
    {
      "text": "Op, please share insight of this post.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 144
}