{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p7z0da/is_there_any_cat_parent_in_here_i_need_some_info/",
  "hash": "2a26cd706cf8354e9e210d1740c1bb66",
  "scraped_at": "2025-12-08T11:57:59.153615",
  "title": "Is there any cat parent in here? I need some info",
  "description": "Yep I am that guy who is bringing his cat to bangladesh, everyone is like eito taka koros kore k ane biral bangladesh e obab nai. So beforehand litterbox and litter kine rakhte hobe. She would be staying for 4months. 4 Years old about to go on her first travel journey I'm a bit stressed she must travel inside the cargo. So I was checking online many litter brands are available confused which one is good. Any suggestions",
  "votes": "7",
  "comments": [
    {
      "text": "Once got meowpets but our Desi cat shits in the backyard on raw mother nature soil so no idea.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "The vet specifically told to feed gastrointestinal cat food, so right now the brand is buy is royal canin, is it available in bangladesh",
      "votes": "1",
      "replies": [
        {
          "text": "Hey, Cat dad here. Yeah, u should have royal canin in bd. It's available.",
          "votes": "1",
          "replies": [
            {
              "text": "Royal canin gastrointestinal cat food, I searched online couldn't find anywhere",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "When I was in Bangladesh, I tried using the cheapest cat litter, which was 300 Tk for 5 kg (Haisenpet Bentonite Cat Litter). Glad to know you’re bringing your cat with you. When I moved to the USA, I took our cat with me in the plane’s cabin (not in cargo) without any dalal (I handled everything from veterinary to CAAB authority).",
      "votes": "1",
      "replies": []
    },
    {
      "text": "That's a long journey for a cat to be in (especially cargo), you might want to consult a vet. Perhaps need to be medicated for a long journey?",
      "votes": "1",
      "replies": [
        {
          "text": "The vet gave the health certificate, fit to travel",
          "votes": "2",
          "replies": [
            {
              "text": "Ok, good. They have drugs they can give to reduce stress",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I have Persian cats and have lived in the US and in Bangladesh. The best cat litter I've found which is similar to the ones I've seen in the US is hands down- Coziecat. It also eliminates odors. However, coziecat is almost always first to stock out so you need to keep checking with the petshops/stock up when you find them. The best cat food similar to the US standards are: Lara, BonaCibo, SmartHeart and for wet cat pouches- Purina Felix.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Another concern today i noticed my cat struggling to sleep because of a fly. How will she adjust in bangladesh for 4months? Mosha drives us crazy",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 147
}