{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p78wgn/do_we_have_a_castetribe_system_within_the_bengali/",
  "hash": "1997599e47df493c2c8e3d19af2ceb4b",
  "scraped_at": "2025-12-08T11:59:21.634772",
  "title": "Do we have a caste/tribe system within the Bengali Muslim population?",
  "description": "I was just wondering, in Pakistan and India it seems to be more pronounced in the Muslim communities. (Please leave out replies regarding Hindu or Tribal communities, pleases focus on Bengali Muslim community. Thanks)",
  "votes": "12",
  "comments": [
    {
      "text": "Yes 2 tribe, have monies vs have not monies",
      "votes": "45",
      "replies": []
    },
    {
      "text": "No",
      "votes": "31",
      "replies": []
    },
    {
      "text": "the bangladeshi caste system is (a) money (b) skin color",
      "votes": "34",
      "replies": [
        {
          "text": "Mostly money lol. Skin color is not an issue if you are rich. 🤑",
          "votes": "31",
          "replies": []
        },
        {
          "text": "This is universal.",
          "votes": "5",
          "replies": []
        },
        {
          "text": "",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "Anyone who says yes, is a liar. Bangladeshis do not have caste nor tribe.",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Our caste system is political party",
      "votes": "10",
      "replies": []
    },
    {
      "text": "Fortunately, we don't have religious caste system among Bengali muslims for almost 100 years now. I just saw a video today where an indian IAS officer was saying he can't even thinking about marrying a Brahmin girl despite having arguably the top job of the subcontinent. I didn’t know Pakistan have the caste system despite being Muslims, it's very unfortunate.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Yes Bangladesh does have a caste system practiced among the Hindu population.\nArticle from 2015: https://www.vice.com/en/article/a-tragedy-of-dignity-life-as-one-of-bangladeshs-untouchables/\n\"A 2013 study by Mazharul Islam and Altaf Parvez pointed out that while sample surveys indicate that there are between 5.5 and 6.5 million “Dalit” people, designated as “untouchables,” living in Bangladesh, the country’s census does not record information about them. The report notes that “the lack of concrete data contributes to the invisibility, marginalization, and disempowerment of these communities,” and prevents any moves to politicize the issue, including claims for “special measures, representation, or participation in policy making, development, employment, and equality of access to basic services.”\n...\n“People are always in disagreement here,” Ratan said. “There are two communities here, one is Horijon and the other is Basfur. Horijons are perceived to be a better community, of a better caste, and they usually live in a better environment. A Horijon will not enter our house, they will not touch what we’ve touched, or eat what we eat. But we eat what they’ve touched.\n“Horijons are usually better educated than Basfurs, even though we do similar work. There is a caste system even among us — in the same slum — which divides us. Horijons look down on us, as we are considered a lower class.”\nJournal articles about the caste system in Bangladesh https://link.springer.com/article/10.1007/s10767-015-9202-6 (2016)\nhttps://idsn.org/wp-content/uploads/user_folder/pdf/New_files/Bangladesh/Caste-based_Discrimination_in_Bangladesh__IIDS_working_paper_.pdf (2009)\nhttps://www.manusherjonno.org/wp-content/uploads/2019/05/DALIT-REPORT-for-Publication-from-RDC.pdf (2010)",
      "votes": "3",
      "replies": []
    },
    {
      "text": "There are tribes amongst indigenous people. But in the Bengali Muslim population, nope. Hindus do not do that either much.\nInteresting to see how Pakistani Muslims rebranded their formerly Hindu caste system",
      "votes": "7",
      "replies": [
        {
          "text": "Kind of ironic how they claimed Bengalis were more influenced by Hinduism when this caste nonsense is unheard of among us but found in their communities lol.",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "No. No caste/tribe system within the Bengali Muslim population in Bangladesh.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "There are three castes: upper class, middle class and lower income groups.",
      "votes": "9",
      "replies": [
        {
          "text": "This isn't caste, it is social/ economical class!",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "Money and somewhat skin color and education, and also how religious/pious the better.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "\"Caste is buzz word\" among white people.\nThere is no caste structure in Bangladesh, including among Muslims, Hindus, Christians, and tribal peoples.\nIf you ask the younger generations of Bengali Hindus, they scarcely know about it.\nIn India and Pakistan, \"caste systems\" are prevalent due to employment and college seat reservations.\nIf you still have doubts, consider the \"zamindar system,\" which still exists in Pakistan rather than Bangladesh or Kolkata.\ncaste and zamindar systems have profound link with each other.\nAfter East Pakistan was founded, West Pakistan abolished the \"zamindar systems\" system because 95% of Bangladesh's zamindars were Hindus and 2% were Muslims.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Indirectly and not codified in any law. Most Hindu castes who converted to Christianity or Islam could not leave the social aspect of their class. So after a Dalit became Muslim, they’d be the same Muslim living in the same slum, with the same dalit community connections, with the same wealth in your account. Even after many generations of not being in any official caste, the place in the social hierarchy would remain the same.\nMy mothers side were garments factory owners for generations, so safe to say that side was some sort of merchant class. My dads side was a line of really respected hujurs and imams in the wider sonargaon community, wealthy and would build mosques in extreme rural villages to spread islams influence. Safe to say his caste would’ve always been somewhere in proximity to Brahmins or some spiritual elder pre conversion to Islam.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Yea, caste system in Paki Muslim is well established!",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Yes. I'm familiar with this. In my village, there is a separate part of a society. The ancestors of that part were the working class people of the many of the families of our localities. I have seen no one from this side went to attend the working class people's family function even if they got invitations. Though they are financially equal now but still they are not treated equally in the society. A love relationship is also considered as a crime between these two parts. This is no representative of them in the mosque committee.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Caste is something u are born into and u cannot escape it....ur next generation is also born into the same caste....\nPeople who mention minority issues or economic classes like middile class etc. Have no real idea whatsoever....",
      "votes": "3",
      "replies": [
        {
          "text": "100% agree feel like most did not grasp the core of the issue",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "Caste is vanished in Bangladesh but their some signs remain in our society by using Sur names. Sayyed Pathan, Sheikh, Chowdhury,Sarkar, Bhuiyan, Pramanik, Talukdar and many more.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Yes, like in every community people get judged by the family they come from, their job and the social status aka money. It's not so easy to shift socially.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Instead of looking at it through a caste or tribe angle, look at it through the lens of feudalism. Fundamentally, what we have instead of a caste system is an informal differentiation between those who have land / money, and those who don't. Economic status correlates to social standing. This is not a perfect analogy, of course, but it's a good basis to start.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "The Choudhury/Chowdhury name hype needs to come to a complete end.",
      "votes": "3",
      "replies": [
        {
          "text": "Is this really a thing? I grew up in America and have not heard this? The Chowdhury’s I know and Bhuyians don’t act like it’s something.",
          "votes": "5",
          "replies": []
        },
        {
          "text": "What about the bhuiyans lol",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "In Sylhet, there are two clearly distinct class.\nPeople who sell Fish - they are considered untouchable, people from other caste/tribe will never marry into this community.\nBasically people who don't sell fish.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Yes. There are 3 castes:\nMuktijodda (all somehow supports the same party)\nRajakar\nAlso Rajakar........ somehow",
      "votes": "2",
      "replies": []
    },
    {
      "text": "India pakistan foinni\nWe da best music 🤟",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Among Bengali Muslim communities, if you are found out not praying, they will treat you with less social value and avoid communications individually unless they meet you as a group and implicitly tries nudging you to hone their Islamic principles. They can cast you out as an outsider if you don't pray at all despite having familial upbringing as a Muslim, but they will insist you rejoin the faith and pray regularly. There isn't a discrete caste or tribal system like in Hinduism, but it's rather indirect and more nuanced socially when the majority of the community is strongly pious. You are seen with respect and value, the more consistently you are reflecting towards the faith, basically, and vice-versa. My opinion.",
      "votes": "-1",
      "replies": [
        {
          "text": "lol as a Bengali Muslim I have extremely religious family members and also ones who are not at all— no one bothers anyone and everyone minds their business",
          "votes": "17",
          "replies": []
        },
        {
          "text": "To be honest though the threshold for \"not praying\" is basically going to Jummah for friday prayers and maybe the occasional Maghrib or Isha prayer at the mosque.\nI would also state that the majority of the community is not \"strongly pious,\" but rather traditionally observant.\nOn the whole I agree with your point that people who are seen to be more religious have greater social capital, but I don't necessarily agree that it's on the same level as a caste system.",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "খাতা কলমে নাই, তবে বাঙ্গু মুমিনদের মনমানসিকতায় আছে, যেমন তাদের কাছে কাইল্লা রোহিঙ্গারা নিচু জাতের মুসলমান, আর তুর্কি আরবের ফসসা মুসলমানেরা উচা জাতের মুসলমান।",
      "votes": "0",
      "replies": []
    }
  ],
  "id": 152
}