{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p78hvq/perhaps_irrelevant_does_anyone_know_whats_the/",
  "hash": "7dd19c4227faef67507f03da637b6dcb",
  "scraped_at": "2025-12-08T11:59:42.909807",
  "title": "Perhaps irrelevant: Does anyone know what's the post-education settling situation is like in Canada?",
  "description": "Say you complete your MS. What do you do afterwards? What's the job situation like for immigrants?",
  "votes": "3",
  "comments": [
    {
      "text": "Terrible. As someone said, people are working min. wage or full-time Uber/Lyft/Instacart to survive while living expenses tripled/quadrupled since 2021!\nForget proper jobs, there are millions of people with NO jobs!!\nEvery other month there would be some sort of large layoffs - companies are either leaving Canada or scaling their production down\nGovt. decided to limit expenses - so even govt. jobs are hard to get one\nTrades and HealthCare (the proper ones, like nurse or doctor) are the ones with jobs - (assumption) but even Trades will not stay lucrative for very long as govt. is pushing people there that the supply-demand + wage are going to go downhill like the trucking industry",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Besides the doom sayers here, really depends on what field you are in. A lot of industries are actually booming with a lot of investment expected as Canada shifts from the US. But if you aren't in a technical field or don't build up actual work experience during your education, it's tough out there.\nBut if you do, you will have recruiters constantly trying to poach you for jobs.\nThere are lots of jobs for people with the right experience or skillset.\nDont judge based on people who either went to garbage diploma mills or shitty universities, studied a useless subject, or did not spend any of their education getting real world experience. Those people don't have jobs anywhere in the world.",
      "votes": "4",
      "replies": [
        {
          "text": "Spot On!!\nThe comment said the truth nothing else but the truth. Please OP, don't watch news channel, read news articles or blogs or reddit or anything or don't even try to dissect the recent Statistics - I beg of you - just hop on a plane and be over here as soon as possible. Please.\nYou never know you might get an early bird discount on plane fares - so be here ASAP.",
          "votes": "-3",
          "replies": [
            {
              "text": "Lol ya sure buddy, because the media and reddit are such great places of information. As for statistics, Canada's economy is doing fine, weathering the storm, while there are tens of billions of dollars of new investments coming. Those are the actual facts.\nAnd no, no one has told OP to come to Canada. The question was is there jobs? And the answer is yes, plenty, if you don't have a garbage degree and actually spent time during your education to get real work experience.\nBut of course, people who aren't getting jobs are the same ones with low reading comprehension who can only react in hyperbole.",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "I’m going for electrical engineering and hoping to get into the hardware industry. Do you know what the job situation is like with that?",
          "votes": "1",
          "replies": [
            {
              "text": "It's neither booming nor crashing at the moment. Hardware industry is typically limited to heavy industry in Canada historically and the auto industry. Heavy industry is doing all right for now but the auto industry is struggling with Trump tariffs. Most of them are in holding patterns waiting to see if the Trump tariffs stay or not.\nAs an electrical engineer, you may find a lot more opportunity if you go broader. If you have a comp sci background with your electrical engineering, then also lots of good opportunities with data centres and companies like AMD, but you do need more sci education and experience for that.\nMost importantly if you come here with a plan for masters, make sure it's a program that has collaboration with actual industry and gives you actual work experience. It's very difficult to find a job without actual western work experience in industry unless you have a phd in which case they are hiring you for much more specialized roles.",
              "votes": "3",
              "replies": []
            },
            {
              "text": "For electrical there will always be demand for anything related to power. High voltage, medium voltage, low voltage. This area I don't think will ever run out of jobs so I'd say focus on it and the related software. Try to get a few related internships and have connections because if you have no connections as a fresh graduate you'll feel like there's no job here.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Not good right now. A lot of people are relying on minimum wage jobs and food delivery gigs to stay afloat while battling rising food prices and rent.",
      "votes": "2",
      "replies": [
        {
          "text": "So no proper jobs?",
          "votes": "2",
          "replies": [
            {
              "text": "There are proper jobs but they are very competitive.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "It depends on where you are in CA.\nThe job market is pretty tough right now, particularly in Toronto / the GTA. The current govt's new budget has apparently earmarked a lot of money for defense and infrastructure, so over the coming years there will be more opportunities in those sectors (e.g. non CS engineering), which would be a buffer for the massive tech sector layoffs.\nThere are ongoing and upcoming acute shortages in healthcare particularly with regards to GPs / doctors, but Canada has been incredibly useless at getting foreign-trained doctors licensed (unlike the UK or the USA) so that's also a no-go.\nIf you're able to drive and wiling to work away from Toronto, there are slightly more options, depending on training and qualifications. Landing a job when you don't have direct, relevant experience in Canada is also a roadblock, but that's kind of been the case for this country for the past twenty plus years.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I've a friend who completed her masters and now work for govt. Shes gonna get PR",
      "votes": "1",
      "replies": [
        {
          "text": "Is it in engineering?",
          "votes": "1",
          "replies": [
            {
              "text": "No",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I did my master's in Canada, could not find a skilled job, worked in customer servicing for like 2+ years, could not get PR, so came back home. Now got admitted to a fully funded PhD program in USA (just started in August) -- let's see what happenes.",
      "votes": "1",
      "replies": [
        {
          "text": "Did you get anyrelevant industry experience during your masters? I feel like this is a mistake a lot of people make where they think their education alone qualifies them for a job which is not the case, especially in the west. The jobs that do look for academia are typically looking for phds so hopefully things will be better for you this time around.",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 153
}