{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p76sra/tawhidi_janata_attack_on_bauls_at_the_thakurgaon/",
  "hash": "2f1c33a54d80a561289791a5f77c4015",
  "scraped_at": "2025-12-08T12:00:16.294361",
  "title": "Tawhidi Janata attack on bauls at the Thakurgaon court premises. Two baul artistes injured in the attack.",
  "description": null,
  "votes": "136",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Arent they supposed to bring peace and tolarence through islam or does it only apply when they are the victims?",
      "votes": "48",
      "replies": []
    },
    {
      "text": "শান্তির নোবেল এসে দেশের সব শান্তির গোয়া মেরে দিছে",
      "votes": "32",
      "replies": [
        {
          "text": "",
          "votes": "10",
          "replies": []
        }
      ]
    },
    {
      "text": null,
      "votes": "62",
      "replies": []
    },
    {
      "text": "Genuinely concerning, the situation is getting worse day by day. These \"touhidi jonota\" need to face illegal repercussions someday.",
      "votes": "26",
      "replies": []
    },
    {
      "text": "moulvi shahebra ashteche",
      "votes": "18",
      "replies": []
    },
    {
      "text": "দুনিয়ার সব থেকে বকাচুদা গুল হোল এই তৌহীদি জনতা। এদের থেকে এমন গণ্ডমূর্খ, মাথা মোটা, অশিক্ষিত, বুকাচুদা দুনিয়াতে আর কেউ নাই।",
      "votes": "17",
      "replies": []
    },
    {
      "text": "That one guy wearing sonar bangla circus t-shirt at 2:45 is peak irony",
      "votes": "14",
      "replies": []
    },
    {
      "text": "These terrorists terrorize every non muslims who live in their Muslim majority country then they wonder why so many people around the world hates these terrorists. When they do shit they do Jihad when others do it to them it's Islamophobia.",
      "votes": "11",
      "replies": []
    },
    {
      "text": "",
      "votes": "53",
      "replies": []
    },
    {
      "text": "Where are they getting all these confidence from? There are video proofs of them doing illegal things and they won't get arrested?\nAlso some of these thouhidi janata are wearing jeans 👖! If we wore jeans wouldn't they beat us the same way and say we were causing earthquakes?",
      "votes": "26",
      "replies": [
        {
          "text": "You are still wondering the source of their confidence? The government has basically gave them free reign to do anything, the government itself is the source of their confidence, unless they do something that's too hard to hide, they are free to do so.",
          "votes": "24",
          "replies": []
        }
      ]
    },
    {
      "text": "জুলাই মুমিন 🤡",
      "votes": "31",
      "replies": []
    },
    {
      "text": "তৌহিদী যৌনতা, সবসময় খাড়ায় থাকে এদের",
      "votes": "14",
      "replies": []
    },
    {
      "text": "",
      "votes": "21",
      "replies": [
        {
          "text": "যখন সরকার প্রধান নিজেই মব কে ক্ষোভের বহিপ্রকাশ বলে নির্লজ্জের মতো ডীফেন্ড করেন, তার প্রেস সচিব বলেন প্রেশার গ্রুপ, তখন আপনি কি আশা করেন?",
          "votes": "13",
          "replies": []
        },
        {
          "text": "The government encourages mob",
          "votes": "23",
          "replies": []
        },
        {
          "text": "চেষ্টা করলে না হয় বলা যেত ফেইল, চেষ্টাই তো করেনাই।",
          "votes": "8",
          "replies": []
        },
        {
          "text": "মব মারানি হাসনাত থাকতে আর কি লাগে",
          "votes": "8",
          "replies": []
        },
        {
          "text": "They are letting things slide which will create more civil unrest. These criminals openly beating ppl for being different",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "এদের হাত থেকে বাচ্চারাও রেহাই পায় না, আর বাউলদের কথা তো বাদই দিলাম। আমার মনে হয় শাপলা চত্বর এর মতো ঘটনা আবার ঘটলে মানুষ আর এদের জন্য দুঃখ পাবে না।\nমাদ্রাসায় ১৫ মাসে ধর্ষণের শিকার ৬২ ছেলেশিশু, মৃত্যু ৩ https://samakal.com/bangladesh/article/58399/%E0%A6%AE%E0%A6%BE%E0%A6%A6%E0%A7%8D%E0%A6%B0%E0%A6%BE%E0%A6%B8%E0%A6%BE%E0%A7%9F-%E0%A7%A7%E0%A7%AB-%E0%A6%AE%E0%A6%BE%E0%A6%B8%E0%A7%87-%E0%A6%A7%E0%A6%B0%E0%A7%8D%E0%A6%B7%E0%A6%A3%E0%A7%87%E0%A6%B0-%E0%A6%B6%E0%A6%BF%E0%A6%95%E0%A6%BE%E0%A6%B0-%E0%A7%AC%E0%A7%A8-%E0%A6%9B%E0%A7%87%E0%A6%B2%E0%A7%87%E0%A6%B6%E0%A6%BF%E0%A6%B6%E0%A7%81-%E0%A6%AE%E0%A7%83%E0%A6%A4%E0%A7%8D%E0%A6%AF%E0%A7%81-%E0%A7%A9\nhttps://bangla.bdnews24.com/samagrabangladesh/4cd00c7701ee\nhttps://www.jugantor.com/country-news/955802\nhttps://www.prothomalo.com/bangladesh/district/06nyi8d53y",
      "votes": "19",
      "replies": []
    },
    {
      "text": "I just love these tauhudi Janata, their integrity is unquestionably correct unlike Yunus and lal bodors. They are trying to do what they says. Yunus and his minions says something and doing exactly opposite.",
      "votes": "14",
      "replies": []
    },
    {
      "text": "Wait till Jamaat comes to power, Bangladesh would become Afghanistan overnight.",
      "votes": "10",
      "replies": []
    },
    {
      "text": "সোনার বাংলা শ্মশান হয়ে গেল।",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Terrorist basically",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Fuckin jihadis",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Next Afghanistan! this is just a start! Their intention is against development, make only male dominant society. The July propaganda was all about it but some ppl was brainwashed to support them. Slowly, they will silence voices by fear mongering through religious excuses and false narrative. Majority of these Tawhidi Janata do sins behind the scenes while in front they punish others for being different. I don't support the Baul singer for saying inappropriate things, but that doesn't mean all baul should be boycotted. Also, Yunus is an evil, he came to destroy Bangladesh.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Yunus er Bangladesh 👍.",
      "votes": "18",
      "replies": [
        {
          "text": "Apanra akon keu ber hon na keno? Hasina shomoy tho shobai ber holen? Ai criminal der er jonnoi tho police rastay namsilo July te!",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Going East Pakistan",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Now think how they will behave if Jamaat wins.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 155
}