{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p72plk/need_urgent_advice_roommates_blaming_me_for/",
  "hash": "9f06cfada0e272045cf51ce9f58528a4",
  "scraped_at": "2025-12-08T12:02:32.247532",
  "title": "Need urgent advice — roommates blaming me for electrical damage or",
  "description": "I’m staying in a shared room, and something serious happened. I need unbiased advice because my roommates are putting extreme pressure on me.\nRecently I plugged my laptop charger into a cheap multi-plug. When I did that, there was a popping sound and the room lights went off. After that we found: One wall socket got damaged The light holder got damaged The wiring in the room may have been affected\nNow my roommates are blaming everything on me and trying to force me to pay the entire repair cost. Akhon ki kora jay 🙂‍↕️",
  "votes": "3",
  "comments": [
    {
      "text": "How are they sure your multiplug caused the issue and not the other way around? Maybe the wall socket caused your multiplug to short-out. Don't accept blame if you don't wanna pay.",
      "votes": "3",
      "replies": [
        {
          "text": "You are right man;)",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Isolate the power from mains. Open the socket and have a look at the wiring, if you can’t do that bring in someone who has electric know how or an electrician. They’ll conclude whether it was your fault or not. Simple. If it’s not your fault and it was infact a faulty socket then lay the facts to them and tell them to shut the f up.",
      "votes": "2",
      "replies": [
        {
          "text": "Thanks buddy 💥 Sadly they got full payment after telling my father",
          "votes": "1",
          "replies": [
            {
              "text": "You got bullied to pay up, they went to your father. That could have been a corroded/burnt live terminal or wire.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 163
}