{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p7286j/dhaka_becomes_second_largest_city/",
  "hash": "c8097c35fae132500aefe094d1afd6ce",
  "scraped_at": "2025-12-08T12:02:48.346337",
  "title": "Dhaka becomes second largest city",
  "description": "Rampant slums, frequent earthquakes, drying up of the rivers- what do you think is the future of Dhaka city?",
  "votes": "90608",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "And yet it only got a metro line recently. It's crazy how the infrastructure was and still is neglected to the max.",
      "votes": null,
      "replies": []
    },
    {
      "text": "2nd largest bosti",
      "votes": null,
      "replies": []
    },
    {
      "text": "Dhaka is dead\nWe need to decentralize dhaka",
      "votes": "1",
      "replies": [
        {
          "text": "Eto lok na thakle ncp polapan joro korbe kemne?? 🥺🥺",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "yes and number 1 in pollution..",
      "votes": null,
      "replies": [
        {
          "text": "Delhi with its triple digits aqi (~3000 during diwali)",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "This is after Jakarta came out as the biggest but there is a lot of fudging happening with the numbers there. They are counting which parts that aren't really Dhaka city at all.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Close the gates during eid ffs",
      "votes": "1",
      "replies": [
        {
          "text": "Don’t they leave dhaka during eid? (Ik they dont anymore)",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Bangladesh has less inequality than Pakistan and India, but it's far more visible because how close we all live to each other. People moving to urban areas for jobs is not shocking, but the country since 1991 with the shift through free markets has done a terrible job of creating other large areas with opportunities outside of Dhaka. We are falling into the UK problem where a super centralized (our government is centralized by the nature of the structure with very weak local autonomy) has meant that all the development and investment go to the capital because that's all the centralized government cares about (most votes, most money, most jobs all in one city creates a vicious cycle).",
      "votes": null,
      "replies": []
    },
    {
      "text": "Overpopulation is a big issue",
      "votes": null,
      "replies": []
    },
    {
      "text": "The future is grim to say the least. There is already severe infrastructure strain which would only worsen and lead to more traffic congestion and overcrowding. And let's not even talk about the pollution problems.",
      "votes": null,
      "replies": []
    },
    {
      "text": "There’s no future for Dhaka if we continue like this. Some steps are absolutely necessary now:\nStrict land-use and building regulations inside Dhaka to stop uncontrolled expansion.\nStart planning a new capital nearby. At some point we’ll have to relocate major administrative functions anyway, just like Indonesia did with Jakarta. Better to plan early than be forced later.\nDevelop other cities for decentralization, such as Rajshahi, Khulna, and Mymensingh. Invest in housing, transport, education, and healthcare so people actually want to move. Strengthen local government in other cities so they can manage growth responsibly.\nIncentivize industrial decentralization. Imposr higher taxes on factories inside Dhaka, and offer tax benefits or subsidies for companies that move to the designated cities.\nEncourage corporates to expand outside Dhaka. Provide incentives for opening regional branches and shifting part of their workforce.\nLet Dhaka heal. Take strong green initiatives to revive the city like cleaner water, more green zones, strict control of pollution, and proper urban planning.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Is this stat correct? This would mean 1/4th of the country lives in Dhaka.",
      "votes": "2",
      "replies": [
        {
          "text": "Your numbers seem ancient. This would mean a little less than a fifth of the country resides in the capital.",
          "votes": "2",
          "replies": [
            {
              "text": "180 million, isn't it? Or is it more now.?",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "curse of the centralization",
      "votes": null,
      "replies": []
    },
    {
      "text": "That's why I am doing my part by trying to find a good job outside dhaka. I am leaving this place as soon as I get one.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Not something to be proud of, more poverty, more declining infrastructure, more urban decay",
      "votes": null,
      "replies": []
    },
    {
      "text": "Other cities need to be developed to reduce the dependence and stain on Dhaka like Khulna and Chittagong.",
      "votes": null,
      "replies": []
    },
    {
      "text": "dhaka died years ago. now all i see is braindead zombies sitting and roaming on bangla tesla.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Decentralization of Dhaka city is mandatory immediately, I don't know why any political parties are not showing interest in this.",
      "votes": null,
      "replies": []
    },
    {
      "text": "well not the best thing to be proud of honestly 😅😅",
      "votes": null,
      "replies": []
    }
  ],
  "id": 164
}