{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p6uzj2/visiting_bangladesh_want_to_make_english_speaking/",
  "hash": "de157acef78707cfb5d8f63d00b32c11",
  "scraped_at": "2025-12-08T12:03:07.639963",
  "title": "Visiting Bangladesh, want to make English speaking Bengali friends",
  "description": "So I’m in Dhaka for a couple months, I’m from Maryland USA I’m 25 😭😭 and I wanna make friends here so I can go outside and travel more with someone knowledgeable, going with a relative is really annoying idk how to explain it but it doesn’t feel natural and doesn’t feel fun and it’s hard for me to communicate. I want to meet people or someone I can just vibe with and chill anyone’s free to shoot me a dm also I just got my e sim activated so feel free to shoot me a dm I’ll send u # idk where im going with this but yeah",
  "votes": "25",
  "comments": [
    {
      "text": "Go to Gulshan and you can make a couple of female friends there. As you are a foreigner there are a lot of girls from Gulshan who will date ya",
      "votes": "0",
      "replies": [
        {
          "text": "How would I even approach someone LMAO",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-7",
      "replies": [
        {
          "text": "Is this ChatGPT 😭",
          "votes": "12",
          "replies": []
        },
        {
          "text": "bruh why are you using chatgpt to respond to reddit posts",
          "votes": "3",
          "replies": [
            {
              "text": "probably using it to translate from Bangla to english.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "-3",
      "replies": [
        {
          "text": "Dang",
          "votes": "1",
          "replies": []
        },
        {
          "text": "I mean what you're saying is definitely not true. Yes English isn't that widespread here but still there's a good number of people who are pretty well versed in it",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Hello!",
      "votes": "1",
      "replies": []
    },
    {
      "text": "So you want crackers?",
      "votes": "1",
      "replies": [
        {
          "text": "So you want crackers?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Dm me",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Dm",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 165
}