{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p6go77/bal_bnp_jamaat_twitter_accounts_all_3_linked_to/",
  "hash": "a7c934bbea9ce910c2d7710dc4c68eb7",
  "scraped_at": "2025-12-08T12:03:40.912503",
  "title": "BAL, BNP & Jamaat Twitter accounts; All 3 linked to foreign countries",
  "description": "Source: https://x.com/sumonkais/status/1992691136604074176",
  "votes": "90608",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "It's not the silver bullet that you think it is. In BD political violence and imprisonment is very common. So every party's media team operates from the USA.\nIf we jail everyone, the media team will still remain operational.",
      "votes": null,
      "replies": [
        {
          "text": "Not only US, BAL is controlling their account from India. And, that’s the point, gundas living abroad are controlling their accounts lol",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "So I'm guessing BAL account was made by Joy from US and is now operated by BAL in India. BNP's user is from US as well so naybe Tareq isn't on this account?",
      "votes": "2",
      "replies": [
        {
          "text": "Tarique’s account is ran through US too lol",
          "votes": "2",
          "replies": [
            {
              "text": "He's probably using a VPN for safety reason.",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "Joy doesn't even run his own account, let alone the BAL account. These are run by paid lowlives. Same goes for BNP, there is zero chance that Tareq runs this.",
          "votes": "1",
          "replies": [
            {
              "text": "Why would big politicians like them run these accounts themselves? They have social media managers for that. Lol reading all these comments made me wonder- are you guys kids? Because most of y’all don’t know anything",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Jamaat propaganda clearly.",
      "votes": "1",
      "replies": [
        {
          "text": "You cannot read clearly? Jamaat’s account was made with Canada App Store. All 3 accounts are linked to foreign countries + not unlikely Jamaat’s location will change too",
          "votes": "1",
          "replies": [
            {
              "text": "Bangladesh is one of the very few countries in the entire world where Apple doesn’t have an official App Store, so people just use other country App Stores.",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "Why dont you go to X and check yourself? This information is publicly available for all to see.",
          "votes": "1",
          "replies": [
            {
              "text": "",
              "votes": null,
              "replies": []
            },
            {
              "text": "Who tf is downvoting? Mad @ facts 🤣",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Depends on what region is your appstore acc. You can’t open a Bangladesh region App store , it’s either troublesome,server issue or doesn’t exist. Most appstores in bd runs on Other regions like us,canada,singapore . Simple.",
      "votes": null,
      "replies": [
        {
          "text": "BAL & BNP’s accounts are ran through India & US",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "Yes because Bangladeshi iPhones are usually imported from other countries, thus the Jamat one. This is a nothing story. Also Tarique and Joy are/were both living in foreign countries, so that explains those two.",
      "votes": null,
      "replies": [
        {
          "text": "Phone being imported has nothing to do with this. This is based on the IP address the account is created from and is being run in.",
          "votes": null,
          "replies": []
        },
        {
          "text": "US/Canada aren’t even where most iPhones in BD come from though. Their accounts run from the US and India are still suspicious. Give it a few months and Jamaat’s account will probably start showing other foreign locations too, because none of these parties actually keep their interests inside Bangladesh",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "What’s the point of this post?\nSocial media accounts are handled by social media teams. These teams are composed of expatriate Bangladeshis.\nYou’re trying to make it seem like the CIA and RAW are managing these accounts.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "It’s not normal for a party to be so cucked to India & yet obsessed with wanting to bring ruin to this country. BAL gundas posts misinformation from their account while sitting happily in India & it’s worth pointing out.",
      "votes": "6",
      "replies": [
        {
          "text": "It’s not normal for a party to be so cucked to India & yet obsessed with wanting to bring ruin to this country. BAL gundas posts misinformation from their account while sitting happily in India & it’s worth pointing out.",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "5",
      "replies": [
        {
          "text": "says their account was made through Canada App Store",
          "votes": "5",
          "replies": [
            {
              "text": "most iPhones come from the Canada, US etc anyways and the app comes preloaded with all iphones so this is a very nothingburger argument.",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Wow, jamat is desh premik 😋",
      "votes": null,
      "replies": []
    }
  ],
  "id": 167
}