{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p6eepw/same_same_but_different/",
  "hash": "14bbc644f0c40a72c9bf03a32c4ad3da",
  "scraped_at": "2025-12-08T12:04:16.130710",
  "title": "Same Same But Different",
  "description": null,
  "votes": "61",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "we woj aryanz vs we woj turkz\nnightmare blunt rotation",
      "votes": "8",
      "replies": []
    },
    {
      "text": "পৃথিবীর ইতিহাস মূলত রাজনীতির ইতিহাস। পৃথিবীর ইতিহাস মূলত অর্থনীতির ইতিহাস। আরবের কুরাইশরা যারা মুহাম্মদ স: এর বিরোধিতা করেছিল , তারা ছিল নবী মুহাম্মদ সঃ এর চাচা। কিন্তু তবুও তারা মুহাম্মদ স: এর বিরোধিতা করতো ! কারণ তারা ভেবেছিল মুহাম্মদ সঃ এর সাম্যবাদি ধর্ম প্রতিষ্টা পেলে তারা কাবার কাস্টোডিয়ান এর অধিকার হারাবে ,তাতে করে তাদের বছর বছর হজ এর রাজস্ব দিয়ে যে শত শত অর্থের income সেটা বন্ধ হয়ে যাবে!\nআমাদের ইতিহাস পড়তে হবে এখন ! কোনো মোল্লাকে অন্ধ বিশ্বাস করা যাবে না",
      "votes": "1",
      "replies": []
    },
    {
      "text": "জিনিসটা comparable হবে জামাত ক্ষমতায় গিয়ে প্রধানমন্ত্রী হওয়ার পর। দুই দলেরই যথেষ্ট পরিমাণে জেনোসাইড এর নজির আছে। তবে ভারতের জনগণের মত দুই হাতে ভোট দিয়ে 550 সিট এর 400 টা যেমন বিজেপি কে দিয়েছে, সেরকম কিন্ত বাংলাদেশে হয় নাই।",
      "votes": "0",
      "replies": [
        {
          "text": "জিনিসটা comparable হবে জামাত ক্ষমতায় গিয়ে প্রধানমন্ত্রী হওয়ার পর। দুই দলেরই যথেষ্ট পরিমাণে জেনোসাইড এর নজির আছে। তবে ভারতের জনগণের মত দুই হাতে ভোট দিয়ে 550 সিট এর 400 টা যেমন বিজেপি কে দিয়েছে, সেরকম কিন্ত বাংলাদেশে হয় নাই।\nঠিক। কিন্তু কারণটা এইটা না যে বাংলাদেশের সাধারণ জালেমগণ ইন্ডিয়ার সাধারণ জালেমগণের চেয়ে ভাল। পার্থক্যটা এইখানে যে বাংলাদেশে এতদিন সাধারণ জালেমগণকে ঐক্যবদ্ধ করে তাদের সুপ্ত ফ্যাশিজম উস্কায়ে দেয়ার মত নেতা তৈরী হইতে দেয়া হয় নাই বাকস্বাধীনতা না থাকার সুবাদে। এখন পিনাকি, ইলিয়াসরা সাধারণ জালেমগণের ফ্যাশিস্ট ইনস্টিংক্টকে বাস্তবায়ণ করার আদর্শিক ন্যারেটিভ তৈরী করে দিচ্ছে।",
          "votes": "8",
          "replies": [
            {
              "text": "জামায়াত আমাদের স্বাধীনতা যুদ্ধে শত্রুপক্ষের হয়ে আমাদের লক্ষ লক্ষ মানুষকে গণহত্যা, ধর্ষণ ও লুটের মতো যুদ্ধপরাধ করেছে, যেটা বিজেপি করে নাই, ঐদেশের লোকেদের বিজেপিকে ভোট দেয়া আর এইদেশের লোকেদের জামায়াতকে ভোট দেয়া এক হোলো না।",
              "votes": "3",
              "replies": []
            },
            {
              "text": "আপনার কথার সাথে খুব একটা একমত হতে পারছি না। গতকালেরই নিউজ দেখেন। বাংলাদেশে এমন মনে হয় না কিছু কখনো সম্ভব!\nhttps://www.scobserver.in/journal/sc-upholds-dismissal-of-christian-army-officer-for-refusing-to-enter-temple-sanctum/",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "জামায়াত আমাদের স্বাধীনতা যুদ্ধে শত্রুপক্ষের হয়ে আমাদের লক্ষ লক্ষ মানুষকে গণহত্যা, ধর্ষণ ও লুটের মতো যুদ্ধপরাধ করেছে, যেটা বিজেপি করে নাই, ঐদেশের লোকেদের বিজেপিকে ভোট দেয়া আর এইদেশের লোকেদের জামায়াতকে ভোট দেয়া এক হোলো না।",
          "votes": "7",
          "replies": []
        },
        {
          "text": "হিন্দু ধর্মের বড় একটা বিষয় ভক্তি।। ভারতীয়রা-তো প্রায় ১০০ জিনিসের মধ্যে ৯৯টা জিনিসে ভক্তি খুঁজে পায়।। আর যারা রাজনীতির মাঠে ধর্মকে হাতিয়ার করে কথা বলবে, তাদের প্রতি ভক্তি জাগবে না কেন ভারতীয়দের?? ভক্তি না জন্মানোটা বরং অবাক করার মতো।। কিন্তু বাঙালিরা কাউকে কখনোই ভক্তি করে না।। এরা করে চাঁটাচাটি।।\n(হিন্দুধর্মের অনেক বড় ক্ষতি করে দিয়ে যাবে এই ভক্তি বিষয়টা।।)",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 169
}