{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p6b2jc/what_would_your_perfect_education_system_look/",
  "hash": "396615351ff2d9323b619068e67c7388",
  "scraped_at": "2025-12-08T12:04:47.782142",
  "title": "What would your perfect education system look like if you were in charge?",
  "description": "Recently I saw an article about how the English section in the Korean high school graduation exam was harder than the SAT, but only a few students who passed could hold a semi-fluent conversation in English. I saw another video about Germany where your possibility of achieving higher education is mostly decided at grade 4. After this I dug a little deeper and found that almost no education system was flawless. So this made me think, what would your ideal education system be? Would love to hear all of your opinions",
  "votes": "10",
  "comments": [
    {
      "text": "Any education system will fail to produce the desired outcome without qualified teachers. Have you guys ever seen any dynamic teacher in BD? Our teachers are the product of the system, until we change the teachers quality we’ll end up with similar results.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Interesting. Actually I never thought about it.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Sadly it seems true.\nI noticed abroad that many East Asians (Japanese, Chinese) are very careful are disciplined in studying. They study a lot. But their spoken English is not that good at all compared to other nationalities, they actually struggle. The way they learn English does not help their fluency at all.\nI also heard a lot about the hidden racism discrimination in Germany and other European countries (Netherlands etc) against the children who are immigrants or whose parents are immigrants. or who have immigrant background.\nThe teachers may discriminate against them in marks and many teachers actually discourage them from going to university, encouraging them to go to vocational school or technical school after high school, so they remain less qualified for the rest of their life. That's why you see many of the immigrant background people everywhere on the streets but in the universities there's few of them, you see instead mostly the white locals. All this helps encourage the stereotype immigrants don't like to study, don't want to study when the truth is their teacher decided their future with intentionally bad advice and stuffs.",
      "votes": "3",
      "replies": [
        {
          "text": "Very different case, but I heard many cases where religious hujur engineering and science university professors also intentionally discourage talented and capable Muslim female students from research or such related jobs after graduation because of her gender. If she was male student, he would suggest research opportunities and help to publish papers.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "replicate the Scandinavian system",
      "votes": "3",
      "replies": [
        {
          "text": "For that, you will need a rational society, which we lack. Furthermore, Scandinavia is a developed reason and the circumstances are different from ours. Therefore, instead of copying others Why not make our unique system?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "I personally think we need a more holistic approach to evaluating students. For higher education, I believe we should re-introduce Vivas in public universities as well as a psychology test. These will help to find out the more unique thinking students among the best. Admission shouldn't only be based on memorization or narrow way of judging merit.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I'm afraid my idea will get stolen!! JK However, I do have an alternative idea. But, it is not polished yet!!",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Education system change korlew ki, eigula execute korar moto teacher to nai. So agee teacher change/train kora dorkar. But if you ask about the system specifically, I think, National University theke funding komaye polytechnic e aro focus kora uchit. We don't need another political science/Islamic history major in a country where half of the youth are jobless.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 171
}