{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p6auxd/bangladesh_will_either_be_france_or_afghanistan/",
  "hash": "5ea5b35f961d98b6d891456cce4289d9",
  "scraped_at": "2025-12-08T12:05:04.600728",
  "title": "Bangladesh will either be France or Afghanistan. NCP wants to make BD like France, democratic and pluralistic.",
  "description": null,
  "votes": "44",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Wasn’t everyone boycotting france 4 years ago lmao",
      "votes": "28",
      "replies": []
    },
    {
      "text": "Shishu Jamaat acting Secu! That would be the day!",
      "votes": "21",
      "replies": []
    },
    {
      "text": "NCP is Jamat in sheep’s clothing.",
      "votes": "15",
      "replies": []
    },
    {
      "text": "আফগানিস্তান করতে অনেক দল কাজ করছে, সেই আগুলে ঘি ঢালতে আসিনি\nএই আগুনকে ঘি না ঢালার কথা বলে কেন? আফগানিস্তান না করার জন্য সবচেয়ে জরুরি হইলো এই আগুনে পানি ঢালা। এত পেচাইন্না পলিটিক্যাল গড়িমসি করলে বুঝা যায়, ক্ষমতা পাইলে যেই কে সেই-ই হইবো।",
      "votes": "8",
      "replies": []
    },
    {
      "text": "France? Give me a fuggin break.\nThe way young people talk about the student movement and the NCP as if its inspired by or parallel to the French Revolution and the republics that followed is so bizarre.\nAnyone with a high school education, or the equivalent reading comprehension level, and a small dose of common sense, would cringe upon hearing such delusions, let along share it themselves.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Another psyop from jamat to bait lefties .\nকয়দিন আগে না তুর্কী - এরদোগান হওয়ার কথা ছিল !",
      "votes": "31",
      "replies": [
        {
          "text": "এনসিপির সমস্যা হইলো দলের মধ্যে থাকা কিছু ডানপন্থীর কারণে পুরা পার্টি গালি খায়",
          "votes": "5",
          "replies": [
            {
              "text": "না। তারা ডানপন্থী বইলাই গালি খায়।",
              "votes": "10",
              "replies": []
            },
            {
              "text": "Ncp is right. They cant even act centrist.",
              "votes": "5",
              "replies": []
            },
            {
              "text": "\"Kichu\". I thought leftists cannot be any more political dumbfucks but you guys keep proving me wrong. NCP has some liberals and mostly right-wing people. Nasir is ex-shibir, Hasnat and Sarjis are hardcore right. The leadership stays with right-wingers, so there is no way NCP has \"kichu\" hardcore right-wingers.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "NCP = jamaat team b",
      "votes": "19",
      "replies": [
        {
          "text": "But we have already have jamat team b! So more like a c.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "ইলেকশন সামনে, এখন দেখি এনসিপি, ইনকিলাব মঞ্চ পর্যন্ত তাদের টিপিকাল ফ্যাশিস্ট জালেমগণদের ভাঙচুরে উস্কানি দেয়া, গণতোষণমূলক কথাবার্তা আর নোংরা বিনোদন দেয়া বন্ধ করে গঠণমূলক কথা বলে কিছু ভোট বাড়ানোর চেষ্টা করতেছে।",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Fake! I won't believe it unless Hasnat and Sarjis publicly kiss to prove it /s",
      "votes": "15",
      "replies": []
    },
    {
      "text": "NCP er kono bail nai. NCP project failed. Eisob bal sal Reddit e post dia lav hobe na. Kivabe bideshe palaba shei chinta kor.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "হাহাহাহাহা। হাসতে হাসতে পেদে দিলাম।",
      "votes": "6",
      "replies": []
    },
    {
      "text": "ohhh nice. I like france more than singapore.\nwell, bangladesh jokhon france hoye jabe, tokhon ki france er visa bank balance charai paoya jabe !!\nI would like to party with Mbappe.\nkhek khek",
      "votes": "2",
      "replies": []
    },
    {
      "text": "এসেছে নতুন সোনামণি, ঝুলাতে এসেছে মূলা।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "সত্যি বলতে আমি আর ট্রেডিশনালিসমে বিশ্বাস করি না।। বাংলাদেশিদের আরো প্রোগ্রেসিভ হইতে হবে।। কিন্তু কিছু ডানপন্থী চাচ্ছে জনগনকে ধার্মিক বেইট দিয়ে বঁড়শিতে গাঁথতে।। বামদের কথা নাহয় নাই বললাম।।",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Cool. Yknow who has actually ruled the country before and has largely minted pluralism and delivered high economic growth by opening up the country to investment? The BNP.",
      "votes": "5",
      "replies": [
        {
          "text": "No one is talking abt opening up the economy. Every govt. after Ziaur rahman kept the same neoliberal model. And neoliberalism always gives rise to reactionary sentiments in the broader society and this is why the rise of fundamentalism was inevitable (parties like BNP, BAL has accelerated this process). And historically BNP has also sided with the far right. And the so-called \"economic growth\" was never enjoyed by majority of the ppl of this country.",
          "votes": "8",
          "replies": [
            {
              "text": "What? That's not really true, Bangladesh was neoliberal under Zia and then again 1991+. The AL also did a lot of nationalization from 2009 onwards compared to when the BNP was in power.\nIt was experienced by most of the people in the country. Bangladesh had a huge famine in 1974 and neoliberal policies has been a huge boom to the country in the sense of far fewer people starving. It's been unequal, but there has been huge upliftment of the poor in the sense of education and food availability.",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "BNP imported islamist poltics and always sided with right wing. Them and pluralism is not in the same set.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Hope they can keep their promise",
      "votes": "0",
      "replies": []
    },
    {
      "text": "NCP needs a face. They need a man in his 40s or 50s who is in line with their agenda.\nThey also need a purpose. They need to specify what vision they have for the country and within how much time frame they will do it",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Hope so, but need to cut off their vocal right wing yappers in party 1st",
      "votes": "0",
      "replies": []
    }
  ],
  "id": 172
}