{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p6a27y/finally_got_strong_passport_but_still_feel_sad/",
  "hash": "0feac53a4bd26de1dfa1bd47434e52bc",
  "scraped_at": "2025-12-08T12:05:38.969122",
  "title": "finally got strong passport but still feel sad for bangladeshi passport",
  "description": "finally i got a strong country passport and now i see how much pain i went through with my bangladeshi passport before. long visa wait long queue at immigration extra questions delay for no reason. with this new passport everything is smooth and fast. same person different passport. i feel happy for myself but also guilty and sad for people back home. i really wish one day our bangladesh passport is strong and respected at least in south asia so people can travel and study and work without this stress. i know i cannot change politics and corruption alone. any real suggestion what normal people like us can do to help make our passport stronger or should we just focus on our own life and accept that nothing will change",
  "votes": "33",
  "comments": [
    {
      "text": "Do holders of red passports get special privileges? I always notice BCS cadres traveling anywhere they want without any hassle",
      "votes": "4",
      "replies": [
        {
          "text": "I think the main advantage is that you can visit a lot of countries without a visa for X number of days.",
          "votes": "5",
          "replies": [
            {
              "text": "The disadvantage is that you can't travel abroad without NOC",
              "votes": "6",
              "replies": []
            }
          ]
        },
        {
          "text": "I don't think BCS cadres get red passport. Diplomatic passport is reserved for very high level positions like ministers. BCS cadres don't have issue travelling cuz why should they? They are going for a specific government approved purpose, it doesn't raise suspicion of illegal immigration.",
          "votes": "1",
          "replies": [
            {
              "text": "Many government employees went for office tour and never came back.\nI may know dozens of those people.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "what do you mean strong passport? passport of which country?",
      "votes": "2",
      "replies": [
        {
          "text": "Australia, USA, Uk, Italy, Germany maybe",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Canada 🇨🇦 probably",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 174
}