{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p63j3d/bangladesh_named_by_pope_in_prayer_for_persecuted/",
  "hash": "9c7a5cda6de5ab4b43e59291c65d4435",
  "scraped_at": "2025-12-08T12:06:28.444241",
  "title": "Bangladesh Named by Pope in Prayer for Persecuted Christians Worldwide",
  "description": "https://x.com/Pontifex/status/1990064816208404603?s=20",
  "votes": "74",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "One one hand, our track record of how we treat religious minorities is not great, and given the resurgence of fuckwit mollas, it's not going to get better.\nBut at the same time, how is Bangladesh ahead of Nigeria and Sudan on this list? No one's out here kidnapping entire schools full of kids. This is just fucking lazy.",
      "votes": "35",
      "replies": []
    },
    {
      "text": "Is he wrong?",
      "votes": "37",
      "replies": [
        {
          "text": "But this type of of sudden attacks often helds in USA also. So, do you say christian community is attacked on US also? This thing doesn't justify Bangladesh's name beside Sudan and other countries. My country is far far more better than those countries.",
          "votes": "1",
          "replies": []
        },
        {
          "text": "Yeah bro we all know who did that",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Adds Bangladesh but ignores the churches destroyed in Palestine. Says a lot boys",
      "votes": "60",
      "replies": [
        {
          "text": "Exactly.",
          "votes": "4",
          "replies": [
            {
              "text": "The pope has spoken out against the genocide In Palestine.",
              "votes": "10",
              "replies": []
            }
          ]
        },
        {
          "text": "Whataboutism, look it up...",
          "votes": "-2",
          "replies": [
            {
              "text": "Do provide non Indian sources then please my friend.",
              "votes": "8",
              "replies": []
            },
            {
              "text": "Whataboutism: A rhetorical tactic employed by those who seek to evade accountability by avoiding applying the same standards to themselves that they impose on the ones they oppose.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "5",
      "replies": []
    },
    {
      "text": "And? This is a known fact. Non Muslims suffer in bangladesh.",
      "votes": "20",
      "replies": [
        {
          "text": null,
          "votes": "5",
          "replies": []
        },
        {
          "text": "Everyone suffers in Bangladesh regardless of their religion. Bangladesh has been held hostage first by the Brits, then the Pakistanis, and now Indians. All of whom claimed to have done so for their own religions.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Well Christians do suffer ill treatment and discrimination in Bangladesh.\nAnd there IS frequent attack on communities and places of worship in Bangladesh.",
      "votes": "11",
      "replies": []
    },
    {
      "text": "When? What!? Is Pope doing this from Trumps orders because Donald Trump found this Christian genocide thing recently. I especially didn't hear about Christans since 2024 uprising.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "please correct me if I'm wrong and sorry for being ignorant , other than the one incident that happened awhile ago , I never heard any attack on Christian people?",
      "votes": "8",
      "replies": [
        {
          "text": "He didn't say attack on Christian people, he said that the attacks are common on communities and places of worship.\nBut yeah iirc two churches, a missionary school and a college got crude bombed this month.",
          "votes": "22",
          "replies": []
        }
      ]
    },
    {
      "text": "Can we see proof of non Muslim suffering in Bangladesh besides being on the weaker side during financial disputes? As a Muslim family we’re too suffering for four decades with land related case as the opponents manages to be friend with the powerful people in the area. It’s called corruption. Not persecution of minorities.",
      "votes": "0",
      "replies": [
        {
          "text": "They live with a constant subconscious fear of being the outcasts and someone to blame if shit goes down. They don't dare to speak up against certain things because they fear the backlash.",
          "votes": "12",
          "replies": []
        }
      ]
    },
    {
      "text": "Our country's name just gets thrown around with others without any proof. We need a strong PR team",
      "votes": "1",
      "replies": []
    },
    {
      "text": "ভারতের নাম নিলো না যেখানে খ্রিস্টানরা মৌলবাদী হিন্দুদের হাতে চরমভাবে নির্যাতিত",
      "votes": "1",
      "replies": [
        {
          "text": "They are even trolled online, extremists Hindus cal Christians rice bags! I have seen many times, I can only imagine how it is irl if that’s how they are treated online",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "When they were under attack? Maybe an earthquake or a flash flood attacks them.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Mentioned Bangladesh but India, Israel?",
      "votes": "-3",
      "replies": []
    },
    {
      "text": "No mention of what Israel is doing to Christians and historic churches in Palestine and Lebanon tho. Says it all really.",
      "votes": "-3",
      "replies": []
    },
    {
      "text": "Are PopePaglu 🤘",
      "votes": "-4",
      "replies": []
    },
    {
      "text": "Oh thats ridiculous statement. rather in various parts of Bangladesh churches are involved in migrating poor Bangladeshi from Muslim to Christianity",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 177
}