{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p5sgdl/first_time_voting_as_an_nrb_kinda_hyped_but_also/",
  "hash": "c6c01936526d780a5ac72fa1bf34be64",
  "scraped_at": "2025-12-08T12:06:47.745144",
  "title": "First time voting as an NRB. kinda hyped but also side-eyeing the whole situation",
  "description": "NRB voting finally becoming a reality feels like a big step. As someone voting for the first time, I’m genuinely excited about it. It’s a milestone, and I’m glad we get to be included in the process.\nAt the same time dot I really hoped that after the end of Hasina’s regime, the political scene in Bangladesh would shift in a more constructive direction. more focus on plans, transparency, and accountability. But it still feels quite familiar, just with different faces.\nI visited Bangladesh right after the July revolution, and talking to people there gave me mixed feelings. Someone literally told me, “bro, politics in Bangladesh doesn’t change, only the names do”, and that stuck with me. it honestly felt like many people weren’t expecting much improvement.\nWith the upcoming election, it’s hard not to notice that the main opposition party seems unprepared in terms of real agendas. Their leader looks very active and eager for votes, but there’s barely any discussion about what they plan to deliver if elected. I even saw a video of their representatives abroad encouraging people to ask for votes door to door, yet still no clear manifesto or detailed vision. we can’t just vote based on enthusiasm. there should be ideas to vote for.\nAnd speaking of our representation abroad dot the embassy experience really needs improvement. When I visited in 2022, it honestly felt like being back in a typical government office in Bangladesh. slow service, dismissive attitude, zero sense of responsibility to the citizens they’re supposed to serve. It’s frustrating, especially because it represents our country outside its borders.",
  "votes": "2",
  "comments": [
    {
      "text": "Dont take it otherwise. Given that you NRBS are voting. Do you guys reqlly have a skin the game?\nYou will vote for cadidats and parties whose actions post election will not affect you.",
      "votes": "1",
      "replies": [
        {
          "text": "Technically yes, since the domestic political situations and a lot of govt policies directly influence foreign policy attitudes towards NRBs. Plus, citizens of the country, still have families and relatives, it impacts a lot more than people think",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 178
}