{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p5f7ym/wtf_is_going_on_in_jamuna_future_park/",
  "hash": "f25600b57eb73be23f63b9c21ca0a5a5",
  "scraped_at": "2025-12-08T12:07:52.187309",
  "title": "WTF is going on in Jamuna Future Park",
  "description": null,
  "votes": "102",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Isn't this a publicly accessible area, why can't someone capture a video?",
      "votes": "36",
      "replies": [
        {
          "text": "I think the inside of the building would be considered private property",
          "votes": "13",
          "replies": [
            {
              "text": "There should be a clear sign stating that you can't take videos, like a policy. Also, she didn't step over or go beyond those ribbons.",
              "votes": "8",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Looks like they are trying to cover up a crack from the earthquake.",
      "votes": "26",
      "replies": []
    },
    {
      "text": "Still remember they advertised by saying jamuna future park can withstand up to magnitude-8 earthquake.",
      "votes": "27",
      "replies": [
        {
          "text": "the building might be able to but what about the ground we forgot that we live on clay",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "এটা তো একটি ব্যস্ত পাবলিক প্লেস এখানে যদি হঠাৎ কোনো দুর্ঘটনা ঘটে, সেই দায়ভার কে নেবে? একজন সচেতন নাগরিক হিসেবে ওই মহিলা ভিডিও করছেন, আর আমার কাছে মনে হয় তিনি ভুল করছেন না। বরং তাকে বাধা দেওয়া হচ্ছে এই ভয়ে যে সত্যিটা ধরা পড়ে যাবে।",
      "votes": "18",
      "replies": []
    },
    {
      "text": "Is this a crack by the earth quake!?",
      "votes": "26",
      "replies": [
        {
          "text": "A thorough audit should be conducted nationwide because, sometimes, prevention is better than a cure.",
          "votes": "25",
          "replies": []
        }
      ]
    },
    {
      "text": "The entire city is a ticking time bomb",
      "votes": "9",
      "replies": []
    },
    {
      "text": "I am talking out of my ass so people feel free to correct me, but isn't diagnal cracks like this post means the cracks aren't deep or structural?",
      "votes": "8",
      "replies": [
        {
          "text": "i dunno but the main problem for us IMO is our foundation is literally soft soil which will slide away before our buildings get the chance to show their anti earthquake prowess",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Kamlar etoboro gola kemne? Chhobi uthaibona, eita ki or baaper jayga!",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Scaffolding + Painting",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Chuna lagake",
      "votes": "2",
      "replies": []
    },
    {
      "text": "এলিট বুর্জোয়ারা কাউকে মানুষ মনে করে না",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Most probably cracked paint nothing serious",
      "votes": "0",
      "replies": []
    }
  ],
  "id": 182
}