{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p5f3sq/%E0%A6%9A%E0%A6%B2_%E0%A6%9C%E0%A6%9F_%E0%A6%AC%E0%A6%A7%E0%A6%B2%E0%A6%87_%E0%A6%AC%E0%A6%89%E0%A6%B2_%E0%A6%B9%E0%A6%AF_%E0%A6%A8_%E0%A6%A6%E0%A6%96%E0%A6%A8_%E0%A6%8F%E0%A6%87_%E0%A6%B2%E0%A6%95_%E0%A6%95%E0%A6%A4%E0%A6%9F_%E0%A6%AB%E0%A6%89%E0%A6%B2_%E0%A6%8F%E0%A6%95_%E0%A6%85%E0%A6%AC%E0%A6%B6%E0%A6%AF%E0%A6%87/",
  "hash": "2f49ff909a3abf1c92020c573cc3cfd0",
  "scraped_at": "2025-12-08T12:08:14.111949",
  "title": "চুলে জটা বাঁধলেই বাউল হয় না। দেখেন এই লোক কতটা ফাউল। একে অবশ্যই গ্রেফতার করে ভিতরে নিয়ে যাওয়া ঠিক হয়েছে না হলে মানুষ তাকে পিটিয়ে মেরে ফেলতে পারে",
  "description": "ঢিল আগে কে ছুড়ে? ঢিল ছুড়লে মৌমাছির চাক তো ভাঙ্গবেই। বাউলের সম্মান কি আল্লাহর চেয়ে বেশি নাকি?\nhttps://youtu.be/fKf6PhPT-xc?si=jMOxExz2uF4RhpLG",
  "votes": "0",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "জি সক্রেটিস এর মৃত্যু দণ্ড ও জায়েজ ছিল ,কি বলেন ?",
      "votes": "8",
      "replies": []
    },
    {
      "text": "আমি জানি না ইনি যা বুঝাতে চেয়েছেন তা আমি বুঝতে বা ভাবটা উপলব্ধি করতে পেরেছি কিনা কারণ সাহিত্যের দখল আমার কম উপরন্তু ভিডিওটিও আংশিক।কিন্তু আমার দৃষ্টিতে এনার বাচনভঙ্গি ঠিক লাগে নাই। তবে, আমাদের দেশে হুজুর, ওয়াজ করে বেড়ানো \"ধর্ম ব্যবসায়ী\" এবং তৌহিদী জনতাদের প্রতিনিয়ত ভিন্নমত কে ছোট করে দেখা এবং দমনের চেষ্টাই কিন্তু এসব তৈরির পিছনে কাজ কর‍তেছে।আর আইনত ওদের কিন্তু বিচার হওয়ার দরকার কিন্তু ঐ যে, মুসলিমরা এই দেশে তো সংখ্যাগুরু! যে দেশে আমরা মুসলিমরা সংখ্যাগুরু সেখানে চাই শরীয়া, ইসলামি উগ্রবাদী, সামপ্রদায়িকতা আর যেদেশে সংখ্যালঘু সেখানে চাই অসাম্প্রদায়িকতা।",
      "votes": "13",
      "replies": [
        {
          "text": "কষ্ট কইরা পুরোটা শুনতেছি , ভালোই তো , গান আছে যুক্তি আছে প্রেম আছে ফুল প্যাক বিনোদন সাথে ভাবনার খোরাক এই জিনিস বেশি বেশি প্রচার হওয়া উচিত ।",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "হ্যাঁ, আমার কাছে বাউলের সম্মান বেশি। তাদের নামে অন্তত মানুষ আরেকজনকে ধইরা কোপাইতে চায় না; আমি কাউরে এখন পর্যন্ত বাউলের নামে অন্যেরে কতল করতে শুনি নাই। আল্লাহর নামে কুপাকুপি করলে ইসলাম রক্ষা হইবে নি?",
      "votes": "7",
      "replies": []
    },
    {
      "text": "অযৌক্তিক কি বলেছে?",
      "votes": "3",
      "replies": []
    },
    {
      "text": "ভাই কথা ঠিক বলছেন, আসলেই উনি গণপিটুনি শিকার হতে পারতেন। কিন্তু উনাকে যারা পিটাতো তাদের সাথে মৌমাছি তুলনা করা ঠিক হয় নাই, মৌমাছি তো খুবই উপকারী একটা প্রাণী, এইসব ধর্মান্ধ মৌলবাদী দের হাগুর উপর ঘুরতে থাকা মাছি বলতে পারেন, যেখানে যায় সেখানেই নিজেদের দুর্গন্ধ ছড়িয়ে বেড়ায়। অবশ্য একই সাথে মনে হয় ওয়াজ মাহফিলে মাইক বাজিয়ে মূর্তিপূজারী, নাস্তিক,বেপর্দা মহিলা, সুদখোর, কাদিয়ানী, আহমদিয়া সবার গুষ্টি উদ্ধার করা বন্ধ করাও উচিৎ, সবার জন্য তো এক নিয়ম তাই না।",
      "votes": "3",
      "replies": []
    },
    {
      "text": "এই পোস্টটা পড়েন মন দিয়ে। মুরোদ থাকলে যুক্তি তর্ক করে দেখান, কেমন করে অপমান হলো এখানে। ব্যাপারটা এমন যে অপরাধীর অভিনয় করার পর নাটকে অভিনেতাকে গ্রেপ্তার করা হচ্ছে সে কেন অপরাধ করল!\nমৌমাছির চাক তো ভাঙছেই, কিন্তু আপনি যেটা বুঝছেন সেটা না। এখনো বুঝতে পারছেন না এই মৌমাছি আপনাদেরও খাবে। আর আল্লাহর সম্মানটা কী বলেন তো শুনি। এই যে ধর্মের নামে মানুষের ওপর জুলুম চালাচ্ছেন এবং তার বৈধতা দিচ্ছেন, আপনার কি মনে হয় এসব দেখে অন্য মানুষের আপনাদের ধর্ম এবং আল্লাহর প্রতি সম্মান বাড়ে? মুখের ভাষা আটকে দেবেন, সেটা হয়তো পারবেনও। কিন্তু সেই “সম্মান” দিয়ে কী করবেন যদি অন্তরে আপনাদের কর্মকাণ্ডের কারণেই বিদ্বেষ থাকে?",
      "votes": "7",
      "replies": []
    },
    {
      "text": "সব কিছু নিয়ে প্রশ্ন করতে তো আল্লাহই বলেছে,জ্ঞান অর্জন করতে বলেছে। তাই করছে।",
      "votes": "3",
      "replies": []
    },
    {
      "text": "https://youtu.be/fKf6PhPT-xc?si=jMOxExz2uF4RhpLG",
      "votes": "-1",
      "replies": []
    },
    {
      "text": "",
      "votes": "-5",
      "replies": [
        {
          "text": "ইয়ে...মানে...অন্য ধর্মের আল্লাহকে অপমান করলে পার পাওয়া যাবে কিনা...",
          "votes": "6",
          "replies": [
            {
              "text": "কবি এখানে গ্রেপ্তার!",
              "votes": "5",
              "replies": []
            }
          ]
        },
        {
          "text": "অযৌক্তিক কি বলেছে?",
          "votes": "3",
          "replies": []
        },
        {
          "text": "জি বুঝতে পেরেছি আপনি মহান গিয়ানি বুদ্ধিমান ,আমরা আসলে পৃথিবীতে ভাড়া থাকতে আসছি ,ধন্যবাদ আমাদের দয়া করে থাকতে দেয়ার জন্য",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "প্রশ্ন করায় যায় কিন্তু বাচন ভঙ্গি এমন হলে তো সমস্যা। উত্তম মধ্যম খেতে বাধ্য।",
      "votes": "-2",
      "replies": [
        {
          "text": "শিশু ধর্ষক হুজুরেরা যখন ওয়াজে অন্য ধৰ্ম নিয়ে কটূক্তি করে, এই বিচার কি তখন তাদের জন্যও প্রযোজ্য?",
          "votes": "6",
          "replies": [
            {
              "text": "আইনে থাকলে সেটাও প্রযোজ্য",
              "votes": "-1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Heinous attack on him and followers is no way justifiable when Bangladesh has law against hate speech against religion and community that people can use to sue him.\nI do find it concerning that him and many figures are outright \"সম্প্রদায়িক\" and Islamophobic while the this identity of being \"অসাম্প্রদায়িক\" artist gets them pass from certain people in society who were rallying saying this dude got attacked simply for music and is absolutely innocent, Bangladesh became Afghanistan Bla bla.",
      "votes": "-2",
      "replies": []
    }
  ],
  "id": 183
}