{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p55o8p/canadian_open_work_permit_from_bangladesh/",
  "hash": "b3c54f6deed4eeb5dbc2f3a8dea3b219",
  "scraped_at": "2025-12-08T12:09:37.867240",
  "title": "Canadian Open Work Permit from Bangladesh",
  "description": "Hi everyone! I asked this question in some other immigration subreddits and forums but never received any reply. Trying my luck here.\nI applied for an spousal open work permit for Canada on June 2nd. A few days after that, I submitted my biometrics at VFS Global in Gulshan. Since then, I've received zero updates from IRCC, all it shows is \"background check\" . I've tried calling them and raising a webform and the only reply I got from them is that \"it's processing\". My friend who applied last year got his within 3 months. IRCC website shows processing time as 12 weeks, but it's been over 6 months for me.\nHas anyone here applied for a Canadian work permit from Bangladesh before? How long does it typically take? Any information would be greatly appreciated. Thank you.",
  "votes": "9",
  "comments": [
    {
      "text": "- Background check is \"normally\" the longest one/step in the processing\n- IRCC is going through historical/unprecedented backlog (last I heard, some 1.5-2 million backlog)\n- the immigration minister getting grilled (for the current mess) in the parliament/senate\n= thus the delays + more scrutiny + more/longer background check + (not to scare you) more rejections rate\nIf it's SOWP then, I assume, the spouse is in Canada in some sort of permit (could be study or OWP) - why not file for GCMS note?\nIt cost like 5$ and, normally (as in, in normal scenario), GCMS tend to fasten up the file/process\nAbout your friend's case: Each case would be different - your friend's processing timeline would be different than yours/anybody's! One of my friend's wife's file took 2 to 2.5 months from filing to being here mid-this year!\nGood luck :)",
      "votes": "5",
      "replies": [
        {
          "text": "Thank you so much for the detailed reply!\nYes my wife is currently on PGWP working as a civil engineer in Halifax, Nova Scotia. I didn't know about GCMS notes, I'll look into it now. I've also been told by someone that contacting the MP can help? But I'm not so sure about that.\nAnd about the background check, does it usually take longer if I have an extensive travel history? I did my O and A Levels in UAE, completed my medical degree from China, went to Rwanda for training, and have been working in Bangladesh since 2022.\nAlso, if I used the services of a Regulated Canadian Immigration Consultant (RCIC), would my application be processed faster? And if I get rejected once, does it negatively impact future applications?\nI'm really sorry for bombarding you with all these questions. You've already been a huge help and I'm just really nervous about this whole thing. Thank you once again.",
          "votes": "2",
          "replies": [
            {
              "text": "I've also been told by someone that contacting the MP can help\nNot sure. If MP office decides to entertain your request/email then they will follow up with IRCC but that doesn't guarantee the process would get faster - especially current time. But sure, you can still send an email/call MP's office, nothing to loose here.\nExtra info: Current Immigration Minister's , Lena Diab's, riding is Halifax, so who knows your email/request might get to her office!!\ndoes it usually take longer if I have an extensive travel history?\nNo, not really. It's just backlogs - not enough agents against applications!\nExtra info: (sharing my case - could be different than yours) My ATIP note had background check with 5 Eyes but no mention of Bangladesh + 2 countries I used to live. I am assuming (I could be wrong/mistaken) they don't do background check other than those 5 countries!\nI used the services of a Regulated Canadian Immigration Consultant (RCIC), would my application be processed faster?\nNo.\nif I get rejected once, does it negatively impact future applications?\nNo.\nI understand the frustration but it's not just you - everybody's application is getting delayed these days. IRCC already said they are reducing backlogs and I am assuming (could be wrong), once Bill C-12 gets passed, it is in 3rd reading right now, processing time will get back in normal!\nIf you/your wife haven't submit anything fake/mis-represent + and, most importantly, didn't forget to submit any document - all you could do is wait.\nGood luck :)",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "It took a year for me when everyone around me was getting it within 3 months. Have patience, you will also get it. Lots of backlogs also delaying the process for everyone. Don’t worry",
      "votes": "3",
      "replies": [
        {
          "text": "Thank you, knowing that this isn't out of the norm gives me a some solace.",
          "votes": "2",
          "replies": []
        }
      ]
    }
  ],
  "id": 188
}