{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p53sxo/is_there_still_pakistani_cultural_influence_in/",
  "hash": "95071ab0646e1db6878b6f3fed8cde4b",
  "scraped_at": "2025-12-08T12:10:09.983967",
  "title": "Is there still Pakistani cultural influence in modern day Bangladesh? Like food and common meals, clothing, song, dance, instruments, famous celebrities, behaviours, architecture, sports, common hobbies etc.",
  "description": "I'm not including religion because Bangladeshis were already quite religious before 1971 and India has plenty of religious Muslims despite splitting away from Pakistan and partition happening.",
  "votes": "5",
  "comments": [
    {
      "text": "No. Nothing comes to mind. Even if there is, it has to be very very niche.\nBangladesh didn’t share an ounce of cultural similarity with Pakistan even when it was a colony of that country.",
      "votes": "16",
      "replies": [
        {
          "text": "Food",
          "votes": "-2",
          "replies": [
            {
              "text": "Which Pakistani foods do you see in Bangladesh? Do Pakistanis eat mach-bhaat or pithas during winters? Biryani is something we also have and it’s not only eaten in Pakistan. The same goes for shawarma, it originally came from the Middle East. Bangladesh doesn’t really have Pakistani food",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "You’re kidding me right? Nehari? I hear people say mushkil more than kothin these days. Even the fact that we say Namaaj and not Salaah like Arabs. The huge kebab culture here is from Pakistan. Even Salwar Kameez and Punjabis. A traditional Bengali outfit is a shorter version of the Punjabi something more like a Kurta and lungi.",
          "votes": "-2",
          "replies": [
            {
              "text": "literally never seen anyone say \"mushkil\"",
              "votes": "5",
              "replies": []
            },
            {
              "text": "“Mushkil”?? in my entire life, I have never seen anyone say “mushkil.” Me, my family memes, my relatives, my neighbors, everyone says “kothin.” Kebab came through the Mughals I think. Moreover, kebab isn’t a Pakistani thing, it came from Turkey. Kurta came from Pakistan? Are you kidding me? Don’t Indians wear kurtas too? As far as I know, Panjabi (kurta) came to Bengal first through Indian Punjabis, because there was no kurta in Bengal initially. When they saw Punjabi communities wearing it, they started calling it a Panjabi. Pakistanis and Indians say “namaz” while Bangladeshis say “namaj.” People in the subcontinent say “namaj” and Nihari isn’t something Bangladeshis eat daily, there are Bangladeshis who never even tried this (cuz in some Bangladeshi families they don’t eat cow’ toes). Bangladesh mostly learned this from Bollywood, not from Pakistan. The lehengas Bangladeshis wear at weddings are inspired by Bollywood\nBangladeshis learned Hindi by watching Bollywood movies, not Pakistanis",
              "votes": "2",
              "replies": []
            },
            {
              "text": "The words, they are Persian/farsi. Bangla or entire subcontinent adopted them, just like Urdu, especially the religious words, like roja, namaz. Even Tamil Muslims say namaz, not Salah, that's not Pakistani influence. Rest, I agree with.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "When was there ever a Pakistani cultural influence in Bangladesh? Most Bangladeshis don’t even know Urdu (which has more Persian- or Arabic-based words), they mostly know Hindi (from Bollywood) and because of that, they can understand Urdu.\nPakistan and Bangladesh never really had anything in common except for religion. Bengalis wanted to celebrate Bengali New Year, Pohela Boishakh and other festivals, but Pakistanis were always against it. Bangladesh never really had Pakistani culture, to be honest. My grandmother, who lived during that time, was more Bengali than we are today, she always wears saree, she never wore any salwar kameez or anything like that. I never see Pakistani culture in our country. We never have the same food. Even now, I have never had any Pakistani food. We always have Bengali (like hilsa fish, rice, other fish curries and veg curries - If it’s similar to any region, it would be eastern India) food. As for kebab and naan, these are common in India, Pakistan, and other surrounding countries. You have some misconceptions\nBtw, Bangladeshis were not very religious during 1971, most of them didn’t even know the “Kalima”. This is one of the reasons why many Bengali Muslims were killed by the barbaric Pakistani army. I heard they used to kill people after asking them to recite Kalima.",
      "votes": "10",
      "replies": []
    },
    {
      "text": "Pakistan er under e thakar poreo kono cultural similarities nai. Kintu eidike amar gf hindi te kotha koy ar hindi movie dekhe. Edit: almost all the girls I've dated had significant indian influences",
      "votes": "2",
      "replies": [
        {
          "text": "lol he’s Pakistani who posted😂",
          "votes": "1",
          "replies": [
            {
              "text": "No, I'm British Bangladeshi my Pakistani friend asked me about this earlier. So I thought I'd ask here?",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Pakistan has several cultures. Punjabi, Pashtun, Sindhi and Baloch culture. To answer your question, none of them have had any lasting influences in Bangladesh",
      "votes": "2",
      "replies": []
    },
    {
      "text": "I miss the good ol days of saying Khuda Hafez/Hafiz whatever. Every time I hear Allah f*cking Fafez, it makes me cringe.\nImported from Pakistan, this trend started after Ziaul Haque died in a plane crash. Well, both countries are controlled by Uncle Sam, with their selected neoliberal puppet government, no wonder, this is why religious fundamentalism is highly favored and promoted.\nTwo failed countries can sink together now.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "We share some common stuff maybe.\nBiriyani, for food. A couple of years ago, peshwari style beef became a craze. Some restaurants serving those, became in demand.\nPunjabi, for clothing. Last Eid, Pakistani designer brand Junaid Jamshed did major business here, and hearing the price tags, I doubt many Pakistanis can actually afford those unless they are sold cheap there 😅 girls here are crazy about Pakistani dress brands, like Gul Ahmed, Zara shahzahan etc.\nMany people love celebrities like Atif Aslam (multiple successful concerts here), hania amir (came for brand endorsement , possibly doing local movie soon) etc and even though they are small in number, there are viewers of Pakistani drama in Bangladesh\nBack in the days, Pakistani cricketers like wasim Akram and Shahid Afridi were cherished. Cricket is a shared sport both countries love\nMuslim architecture is shared in historical buildings only.",
      "votes": "-1",
      "replies": []
    },
    {
      "text": "",
      "votes": "-1",
      "replies": [
        {
          "text": "UK is full of Sylhetis, they tend to be very religious and dress more like Arabians. Living with them doesn’t mean the entire Bangladesh is like that. Your opinion doesn’t count. We’ve never even heard of machboos or kabsa",
          "votes": "2",
          "replies": [
            {
              "text": "",
              "votes": "0",
              "replies": []
            }
          ]
        },
        {
          "text": "U live in UK dude",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Maybe you watch but we watch Bangla movies. Bangladeshis understand Hindi but they can’t speak it. Who said Bangladeshis can’t speak Bangla? Go to the theatres, you’ll see that all Bangla movies are houseful. Stop spreading wrong information",
      "votes": "4",
      "replies": [
        {
          "text": "Maybe you watch but we watch Bangla movies. Bangladeshis understand Hindi but they can’t speak it. Who said Bangladeshis can’t speak Bangla? Go to the theatres, you’ll see that all Bangla movies are houseful. Stop spreading wrong information",
          "votes": "4",
          "replies": []
        },
        {
          "text": "Notice how most Bangalis know Hindi better than they know Bangla.\nWhere the fuck in Bangladesh is this?\nThey watch more Bollywood than they do natok.\nThis is indeed true. The hegemony of bollywood as the sole representative of South asian cinema on the international stage is obviously disheartening and has set the stage for people in south asia to see it as the entertainment standard.\nBut I can’t just overlook Bangladesh’s fault in killing its own movies. The Bangladeshi film industry suffered both from the state and internal elite capture. Bangladeshi movies had a distinct taste in their early days but fell off trying to mimic bollywood’s success. Besides Bangladesh produces only a handful of movies every year compared to bollywood’s surplus, so it naturally becomes a case for people to watch that instead of their own films. You can’t force people to watch shit. I don’t think i really have to spell it out that Sakib Khan at best would be a main lead in B-grade bollywood movies. Industry revival will only be possible when elite capture is thrown out and the old norms are broken.",
          "votes": "0",
          "replies": [
            {
              "text": "You are wrong. Bangladeshi movies are back on track again. The new Shakib Khan movies are doing well and other movies too. Ever since the movie Hawa with Chanchal Chowdhury, everyone has been going to watch Bangla movies at the theatres and getting tickets has been very hard because all shows are houseful. Bollywood movies don’t release in Bangladesh much, just a few, mostly SRK-related, last year and before",
              "votes": "-1",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 190
}