{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p4lswi/a_simple_act_of_love_and_the_netizens_lose_their/",
  "hash": "40c1da067f27e53d3918e609e2319486",
  "scraped_at": "2025-12-08T12:11:29.532202",
  "title": "A simple act of love and the netizens lose their mind. Why are we like this?",
  "description": "So today, a couple standing in front of Rokeya Hall at DU hugged each other while saying goodbye, since the university administration announced a long closure for all halls. A cameraman from a well-known TV channel happened to capture that moment, just a simple farewell hug, nothing inappropriate.\nBut for some reason, the clip went viral on social media. Meme pages are mocking them, Facebook groups are dragging them, and the trolling has gotten so bad that I genuinely feel sorry for the couple.\nWhy are we like this? Why can’t we treat a harmless act of affection between two adults as something normal and move on? Is it really that strange that we have to make fun of them? Why is showing love viewed so negatively in our country?",
  "votes": "96",
  "comments": [
    {
      "text": "Misery loves company, so you can see all the miserable lot banding together. Don't pay heed to them.",
      "votes": "48",
      "replies": []
    },
    {
      "text": "miserable mfs can't stand others being happy",
      "votes": "29",
      "replies": []
    },
    {
      "text": "I remember hugging my girlfriend goodbye everyday in front of that gate back in our days. Alhamdulillah we are still together after a decade. Back in our days, these hugs were very normal and considered a very heartfelt and genuine form of love that nobody objected to. It was the outsiders that had an issue with this, but nobody from within the campus ever complained.\nDear DU, how badly are you rotten these days? Thanks for the beautiful memories while I was there. I feel like I have studied during the golden time for DU except for Guestroom culture. No murders on campus or no significant violence. We entered the campus right after Shahbagh, went to the '18 quota movement and road safety movement. Even though league goons were there, we could still make some breathing space. By the end of our time, the DUCSU election was becoming a reality and I voted in the election as a masters student. Due to DUCSU, guestrooms were also somewhat lenient afterwards, until COVID.\nSeems like post-COVID DU is something that I do not know to be my university anymore. Our university is gone, what remains is not ours anymore, it's very unfamiliar, unknown.",
      "votes": "32",
      "replies": [
        {
          "text": "18-19 session??",
          "votes": "-1",
          "replies": [
            {
              "text": "How is that 18-19 session? Do you have any idea how the DU session works? Your undergrad admission session is your session forever.",
              "votes": "4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Life’s so miserable for some people that they can’t handle others being happy or in love. That's it",
      "votes": "9",
      "replies": [
        {
          "text": "Agree, no happiness in their own lives so they act out all their jealousies.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "জাশি ক্ষমতায় এলে এইটাই হবে দ্যা নিউ নরমাল",
      "votes": "6",
      "replies": []
    },
    {
      "text": "These fb meme pages are insufferable",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Jihadis can’t stand love they can only tolerate control",
      "votes": "4",
      "replies": []
    },
    {
      "text": "It's islam",
      "votes": "10",
      "replies": []
    },
    {
      "text": "They treat PDA as some kind of sin. God forbid people are in love and show some affection💀🙏",
      "votes": "6",
      "replies": []
    },
    {
      "text": "I see many people are commenting Religion/Jamat/DU. I have a different opinion. As society we are not there to call our self citizens.\nI have been living abroad for a while and observed behavior both home and abroad. I have a few Indian friends and we share the same interests. According to them people in India are generally like that too. Collectively the behavior is pretty similar. We don’t want to listen, being blind during arguments, trash talk, mocking and completely unable to follow basic social norms.\nEven when we moved to first world country collectively we fail to do so as well. You can see it in large gatherings like during Ramadan in the mosque or during Puja or Diwali.\nIt’s not the religion or economic situation, it’s us who do not understand how people in the society should treat each other’s. I am not sure why is that.\nOne theory my friend had is that it’s the low grade treatment we had during British colonial time. The oppression of 200 years broke the basic norm among us. An argument for that is our love for English. Whether we use it or not we (subcontinent) love and respect people who speak English fluently as it represent superiority.\nYou can also argue against that it’s been a while, why we haven’t been improved. My opinion is it’s because we have not been shown how to be a citizen by our leaders (political and social). As while our country runs in a way that helps this type of behavior. We start doing it every where. Office, family, couples, kids.\nSorry for the long comment. But just blaming shortly is no a good idea. It’s a chronic problem.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I mean, people make memes out of anything they can get their hands on.... can't really complain about that.",
      "votes": "-1",
      "replies": [
        {
          "text": "So you choose to ignore or not speak up about it because people will do it no matter what?!!",
          "votes": "1",
          "replies": [
            {
              "text": "I choose not to speak up cuz..... that'd be a waste of calories. (No puns intended, not that it matters really).",
              "votes": "-1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "This post was removed as it breaks reddiquette, which is a set of guidelines that all users of r/bangladesh follow in order to make the subreddit a civil discussion space.\nThis also includes discrimination or offensive language which is not tolerated here. This includes racism, misogyny, xenophobia, homophobia, and/or religious discrimination.\nBe civil. Remember the human that you're interacting with.\nWhile your post may have had substantive content, either right or wrong, we have had to remove this in order to be fair about enforcing the rules. Thank you for understanding.\nRule #1. Follow Reddiquette.\nএই পোস্টটি সরানো হয়েছে কারণ এটি রেডিকেট লঙ্ঘন করেছে। রেডিকেট হলো একটি নিয়মাবলী যা r/bangladesh এর সকল সদস্য মেনে চলে, যাতে এই প্ল্যাটফর্মটি শালীন এবং গঠনমূলক আলোচনার পরিবেশ বজায় রাখতে পারে।\nএই সাবরেডিটে কোনো ধরনের বৈষম্যমূলক বা আপত্তিকর ভাষার অনুমতি নেই। এর মধ্যে পড়ে বর্ণবাদ, নারীবিদ্বেষ, জেনোফোবিয়া, কুইয়ারফোবিয়া, এবং ধর্মীয় বৈষম্য।\nআপনার আচরণে শালীনতা বজায় রাখুন। মনে রাখবেন, যার সঙ্গে আপনি কথোপকথন করছেন, তিনিও একজন মানুষ।\nআপনার পোস্টে হয়তো গুরুত্বপূর্ণ কিছু বিষয় ছিল, তবে নিয়মের প্রয়োগ নিশ্চিত করতে এটি সরাতে হয়েছে। বিষয়টি বোঝার জন্য আপনাকে ধন্যবাদ।",
      "votes": "1",
      "replies": [
        {
          "text": "This post was removed as it breaks reddiquette, which is a set of guidelines that all users of r/bangladesh follow in order to make the subreddit a civil discussion space.\nThis also includes discrimination or offensive language which is not tolerated here. This includes racism, misogyny, xenophobia, homophobia, and/or religious discrimination.\nBe civil. Remember the human that you're interacting with.\nWhile your post may have had substantive content, either right or wrong, we have had to remove this in order to be fair about enforcing the rules. Thank you for understanding.\nRule #1. Follow Reddiquette.\nএই পোস্টটি সরানো হয়েছে কারণ এটি রেডিকেট লঙ্ঘন করেছে। রেডিকেট হলো একটি নিয়মাবলী যা r/bangladesh এর সকল সদস্য মেনে চলে, যাতে এই প্ল্যাটফর্মটি শালীন এবং গঠনমূলক আলোচনার পরিবেশ বজায় রাখতে পারে।\nএই সাবরেডিটে কোনো ধরনের বৈষম্যমূলক বা আপত্তিকর ভাষার অনুমতি নেই। এর মধ্যে পড়ে বর্ণবাদ, নারীবিদ্বেষ, জেনোফোবিয়া, কুইয়ারফোবিয়া, এবং ধর্মীয় বৈষম্য।\nআপনার আচরণে শালীনতা বজায় রাখুন। মনে রাখবেন, যার সঙ্গে আপনি কথোপকথন করছেন, তিনিও একজন মানুষ।\nআপনার পোস্টে হয়তো গুরুত্বপূর্ণ কিছু বিষয় ছিল, তবে নিয়মের প্রয়োগ নিশ্চিত করতে এটি সরাতে হয়েছে। বিষয়টি বোঝার জন্য আপনাকে ধন্যবাদ।",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "This post was removed as it breaks reddiquette, which is a set of guidelines that all users of r/bangladesh follow in order to make the subreddit a civil discussion space.\nThis also includes discrimination or offensive language which is not tolerated here. This includes racism, misogyny, xenophobia, homophobia, and/or religious discrimination.\nBe civil. Remember the human that you're interacting with.\nWhile your post may have had substantive content, either right or wrong, we have had to remove this in order to be fair about enforcing the rules. Thank you for understanding.\nRule #1. Follow Reddiquette.\nএই পোস্টটি সরানো হয়েছে কারণ এটি রেডিকেট লঙ্ঘন করেছে। রেডিকেট হলো একটি নিয়মাবলী যা r/bangladesh এর সকল সদস্য মেনে চলে, যাতে এই প্ল্যাটফর্মটি শালীন এবং গঠনমূলক আলোচনার পরিবেশ বজায় রাখতে পারে।\nএই সাবরেডিটে কোনো ধরনের বৈষম্যমূলক বা আপত্তিকর ভাষার অনুমতি নেই। এর মধ্যে পড়ে বর্ণবাদ, নারীবিদ্বেষ, জেনোফোবিয়া, কুইয়ারফোবিয়া, এবং ধর্মীয় বৈষম্য।\nআপনার আচরণে শালীনতা বজায় রাখুন। মনে রাখবেন, যার সঙ্গে আপনি কথোপকথন করছেন, তিনিও একজন মানুষ।\nআপনার পোস্টে হয়তো গুরুত্বপূর্ণ কিছু বিষয় ছিল, তবে নিয়মের প্রয়োগ নিশ্চিত করতে এটি সরাতে হয়েছে। বিষয়টি বোঝার জন্য আপনাকে ধন্যবাদ।",
      "votes": "1",
      "replies": [
        {
          "text": "This post was removed as it breaks reddiquette, which is a set of guidelines that all users of r/bangladesh follow in order to make the subreddit a civil discussion space.\nThis also includes discrimination or offensive language which is not tolerated here. This includes racism, misogyny, xenophobia, homophobia, and/or religious discrimination.\nBe civil. Remember the human that you're interacting with.\nWhile your post may have had substantive content, either right or wrong, we have had to remove this in order to be fair about enforcing the rules. Thank you for understanding.\nRule #1. Follow Reddiquette.\nএই পোস্টটি সরানো হয়েছে কারণ এটি রেডিকেট লঙ্ঘন করেছে। রেডিকেট হলো একটি নিয়মাবলী যা r/bangladesh এর সকল সদস্য মেনে চলে, যাতে এই প্ল্যাটফর্মটি শালীন এবং গঠনমূলক আলোচনার পরিবেশ বজায় রাখতে পারে।\nএই সাবরেডিটে কোনো ধরনের বৈষম্যমূলক বা আপত্তিকর ভাষার অনুমতি নেই। এর মধ্যে পড়ে বর্ণবাদ, নারীবিদ্বেষ, জেনোফোবিয়া, কুইয়ারফোবিয়া, এবং ধর্মীয় বৈষম্য।\nআপনার আচরণে শালীনতা বজায় রাখুন। মনে রাখবেন, যার সঙ্গে আপনি কথোপকথন করছেন, তিনিও একজন মানুষ।\nআপনার পোস্টে হয়তো গুরুত্বপূর্ণ কিছু বিষয় ছিল, তবে নিয়মের প্রয়োগ নিশ্চিত করতে এটি সরাতে হয়েছে। বিষয়টি বোঝার জন্য আপনাকে ধন্যবাদ।",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "The internet may be more of a curse than a blessing as it catalyze these toxic behaviors. People need to go touch grass.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "People are envious of others when others have what they don’t have. Most of the commentators are probably incels who don’t have a partner.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Poverty can lead to extremism. Our country is not built to equip this many people and majority are below the poverty line. There’s economic desperation. Lack of education. Hierarchical exclusion. So they try and find solace in religion. It makes it easier for extremists to recruit them. That’s why you see the world becoming more and more polarized, not just in Bangladesh. Others have racism, nationalism. And we have religious extremism. I am a Muslim. And I hate how these mullahs who know nothing about the Quran will use it as a weapon to spread hate and vitriol. Theyre ruining the name of muslims and making it much harder for us to live in this world. May Allah show them the way.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 195
}