{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p4lrw2/we_getting_scapegoated_in_place_of_our_neighbours/",
  "hash": "8d086c33aa35979c39e3fdb10bd8eec3",
  "scraped_at": "2025-12-08T12:11:50.154381",
  "title": "We getting scapegoated in place of our neighbours again",
  "description": null,
  "votes": "49K",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Same case in different way",
      "votes": "25",
      "replies": []
    },
    {
      "text": "Could be fake news like this one",
      "votes": "13",
      "replies": [
        {
          "text": "",
          "votes": "11",
          "replies": [
            {
              "text": "",
              "votes": "12",
              "replies": []
            }
          ]
        },
        {
          "text": "every time i think humanity has reached its absolute bottom, some indians prove me wrong\nthey made an enemy out of the only country that loved them the most as recently as 2011, only for them to ruin our good graces and violate us with two-faced egotism and misuse of power every chance they got. Karma will bring her wrath on the evil deceivers of the subcontinent like she has done so many times before.",
          "votes": "19",
          "replies": [
            {
              "text": "The bots also made fake news that the shoplifting case in US earlier is Bangladeshi. Remember \"Voice of Bangladeshi Hindus\"? It was India run and got banned from X for impersonation or something. You also get mass reported for pointing these out.",
              "votes": "8",
              "replies": []
            }
          ]
        },
        {
          "text": "",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "Bangladesh definitely has bot farms because we have a relatively cheap labor base (a bit more expensive than Pakistan or some parts of India like UP or Bihar, but still relatively cheap) who speak English. India definitely has more and they are the leader in this sector with whole cities littered with these bot farms, but this is not scapegoating per se.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Bangladeshis have less than zero reasons to support trump and majority internet users here dont even know what xitter is. Why is Bangladesh being scapegoated here inside a false stat that most definitely belongs to the big fat far-right scam epicenter next door notorious for being behind big western larp operations and ai slop churning on xitter literally caught on tape worshipping trump's picture because he hates immigrants and muslims?",
      "votes": "9",
      "replies": [
        {
          "text": "Do you have any idea how many large scale bot farms operate from Bangladesh? There is no scapegoating here, Bangladeshi bot farms are being used because the labour is cheap here.",
          "votes": "20",
          "replies": []
        },
        {
          "text": "",
          "votes": "5",
          "replies": []
        },
        {
          "text": "While I kinda don't doubt this could be a scapegoat issue. This also could be real. You would be surprised how many Bangladeshi likes Trump mainly cause his entire political ideology currently is very anti trans. Also you gotta remember the far left making these comment about Bangladesh has no reason to just name Bangladesh, they'd happily namecall India as it is.",
          "votes": "0",
          "replies": [
            {
              "text": "I don't think trans issues are top of mind for most people in the US and certainly not in Bangladesh.",
              "votes": "2",
              "replies": []
            },
            {
              "text": "Liberalchodas and so called progressives of the west especially america are subconsiously and/or covertly racist towards the third world, especially SA and SEA. they love using our names to get a cheap buzz or a laugh just like in op post. just a few weeks ago i saw this particular camp of americans take on rw indians on xitter who were being racist against Bangladeshis by calling us the k-word (as usual) and the markin libbchodas brilliant hit back against them was \"no one cares about your local racist slurs\". bewildering how little self awareness and narc-y even the \"good\" guys in that shuorer desh are",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "I wonder what type of shit my father consume to be as much delusional as you guys thinking of conspiracy shit when the country itself it's filled with scumbag and there's been multiple proves.\nThis Is not about scapegoat but just reality you refuse to not accept",
          "votes": "0",
          "replies": []
        },
        {
          "text": "There are Indian right wingers doing it but it's far smaller than Indian bot farms. I am sure there are a few Bengalis doing it for the love of the game but most Bangladeshi posting are also bot farms and/or paid operators. Labour is fairly cheap here and Bengalis have good written English skills relative to cost of labour. Pakistan also now has bot farms because labour is even cheaper there",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "lol 90% of those troll account turned out to be from Varaat and this post willfully neglects to mention it. You can tell amount of copium they are snorting",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Epic fact:\nRussians are behind hate speech against Indians, and Indians buy defence products from Russia.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I don't think we're being scapegoated. I personally know lots of people who like Trump. Therefore, I don't find it surprising that many of these accounts originate from Bangladesh.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "This should clear things up Guardian made an article about this",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 196
}