{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p4hlvw/how_can_i_actually_become_fluent_in_english_as_a/",
  "hash": "c1de3f6c47dc41853c53ee5f673de62d",
  "scraped_at": "2025-12-08T12:12:38.083472",
  "title": "How can I actually become fluent in English as a Bangla medium student?",
  "description": "I'm a Bangla medium student in 10th grade. Most Bangla medium schools dont actually teach English in a way that builds fluency. Students who become fluent usually learn on their own.\nRight now I'm stuck : (\nI aint that terrible at english cause probably i listen to shit tons of podcasts and consume english content, i can understand around 90 percent of what i hear. i even can hold very basic hi hello conversations and i can read english non fiction\nBut I cant write properly anymore and I definitely cant speak confidently. I think this happened because I always use AI now and I only give prompts to translate (like ei post ta lol, bhai ami sentence making porjonto bhule gesi) instead of writing on my own\nHow to speak English confidently\nHow to write English naturally\nHow to avoid sounding very deshi",
  "votes": "4",
  "comments": [
    {
      "text": "I am also on the same stage 😭",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Best way to learn is through emerging yourself. Watch English TV shows and Podcasts. You wont be able to understand fully but you’ll improve a lot.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Skip Ai and grammerly. It will dull your language skills.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "The best way in my opinion is watching movies and TV shows. We learn our first language through listening so why not do the same with a 2nd language right? Then you could try to think in English. That'll help you improve a lot",
      "votes": "2",
      "replies": []
    },
    {
      "text": "The main barrier, imo, is social anxiety. Like loke ki vabbe, I started learning British accent, I almost started doing great,I liked it irl. But kisu mathamoda ASE oigula British accent bujhe nh, American o bujhe nh,shit. Eder Jonno indian accent e perfect.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "You're already really good in English, better than a lot of people. Keep watching TV shows and movies, maybe listen to songs if you like them. And buy some books that you really like and read them again and again so it doesn't feel like a chore. I'd suggest watching some reality TV shows , it can be cooking shows or travel shows whatever you like. I think the thing I find the hardest during speaking and even writing is that I end up making grammatical mistakes and it irks me a lot. But I think I've gotten better at it as time passed. I don't claim to be an expert really but keep trying and focus on always being grammatically correct and learn some idoms and phrases from books or the media",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 199
}