{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pgvo3l/the_national_slogan_for_bangladesh_should_be_joy/",
  "hash": "7013903766ad8c96af475fdb80ea65c9",
  "scraped_at": "2025-12-08T11:16:17.365284",
  "title": "The national slogan for Bangladesh should be \"Joy Bangladesh\"",
  "description": "Why are we fighting over whether \"joy Bangla\", \"Allahu Akbar\" or \"Bangladesh zindabad\" should be the national slogan? It's ridiculous. Don't get me wrong, I mean I kinda get why \"Joy Bangla\" shouldn't be the national slogan, as it ignores the other ethnic minorities in the country, but still, it was the slogan that led us to victory during the Liberation War. I also don't understand why \"Bangladesh Zindabad\" would be a slogan, since it's not even in Bangla, the word \"Zindabad\" comes from Persian. But having \"Allahu akbar\" as the national slogan of the nation literally undermines all the other religious and ethnic minorities in the nation. I don't get why the people from the Jamaat-E-Islam and other hardcore Islamic conservative groups want to force others to accept their religion. Don't get me wrong, I am a Muslim, but I do not believe in forcing my beliefs down other people's throats.\nMy point is, since all of these slogans are somewhat controversial, why not just use \"Joy Bangladesh\" as the national slogan? It's a more secular and more nation-focused slogan that also recognizes the regional and ethnic language in the name through the word \"Joy\".",
  "votes": "1",
  "comments": [
    {
      "text": "It's only because of we don't have nationalism.\nAnd a group of people can't accept the independent Bangladesh.\nIslamists wanted to capture the power like Afgan.\nAnti - liberation groups wanted to chant Pakistan Zindabad, but they can't - so they comes up with Bangladesh Zindabad.\nAnd Joy Bangla is the slogan of our victory, slogan of independent Bangladesh.\nIf you get the docs, then you will get BNP use Joy Banlga - Bangladesh Zindabad back in 1991- 2001 times. You may get videos.\nUntil you don't have nationalism, then this debate won't be settled.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Joy Bangla's bangla refers to Bengal. We are a Bengali Nation-state. Jati Rashtro. And inheritor of historical bengal. Our liberation movement and war was fought with that slogan. It has nothing to do with ignoeing minority.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I don't think this post should be allowed here. This post sounds like the person is against Freedom fright of our nation. This is so disrespectful in the month of victory!",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 2
}