{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pgbr6q/%E0%A6%95%E0%A6%B0%E0%A6%A4_%E0%A6%95%E0%A6%89_%E0%A6%8F%E0%A6%95%E0%A6%9C%E0%A6%A8_%E0%A6%AA%E0%A6%B0%E0%A6%B6%E0%A6%A8_%E0%A6%95%E0%A6%B0%E0%A6%9B%E0%A6%B2_%E0%A6%86%E0%A6%AA%E0%A6%A8_%E0%A6%86%E0%A6%97_%E0%A6%AE%E0%A6%B8%E0%A6%B2%E0%A6%AE_%E0%A6%A8_%E0%A6%AC%E0%A6%99%E0%A6%B2_%E0%A6%A8_%E0%A6%AC%E0%A6%B2%E0%A6%A6%E0%A6%B6/",
  "hash": "03c830cd9ff4719cd0fa2999761cf3f4",
  "scraped_at": "2025-12-08T11:21:41.289747",
  "title": "কোরাতে কেউ একজন প্রশ্ন করেছিল: আপনি আগে মুসলিম, না বাঙালি, না বাংলাদেশি?",
  "description": "কোরাতে কেউ একজন প্রশ্ন করেছিল: আপনি আগে মুসলিম, না বাঙালি, না বাংলাদেশি?\nআমার উত্তর হচ্ছে এটা: এগুলো আলাদা আলাদা পরিচয়। এগুলো যথাক্রমে ধর্ম, নৃগোষ্ঠী, এবং জাতীয়তা+নাগরিকত্বের পরিচিতি। আমি তিনটাই। আগে-পরের কোনো বিষয় নেই, এবং আমি এর মধ্যে কোনো যুক্তিও খুঁজে পাই না। একজন বাঙালি বাঙালিই; একজন মুসলিম মুসলিমই; একজন বাংলাদেশি বাংলাদেশিই।\nধর্ম মানুষের বিশ্বাসের উপর ভিত্তি করে তৈরি। তাই কেউ যদি আমাকে জিজ্ঞাসা করে আমি কোন ধর্মে বিশ্বাসী, স্বাভাবিকভাবেই আমি বলব যে আমি ইসলামে বিশ্বাস করি। ধর্মের সাথে নৃগোষ্ঠীর বা কোনো জাতির কোনো সম্পর্ক নেই এবং জাতির ধর্ম (religion of nation) বলে কিছু হয় না।\nবাঙালি হওয়ার জন্য বাংলাদেশি হওয়ার প্রয়োজন নেই। বাংলা ভাষা, বাংলার সংস্কৃতি নিজের আত্মার সাথে মিশিয়ে নিতে পারলেই সে বাঙালি। তার জন্য স্টেট-লেভেল বা গড-লেভেল সার্টিফিকেশনের কোনো প্রয়োজনীয়তা নেই।\nআর কোনো ব্যক্তি অবাঙালি হলেও বাংলাদেশের জাতীয়তা ও নাগরিকত্ব নিয়ে পারে। এটা স্টেট-লেভেল আইডেন্টিটি বা রাষ্ট্র-পর্যায়ের পরিচয়।\nআপনি কি মনে করেন যে আপনি যে প্রশ্ন করেছেন, সেটা কি যৌক্তিক?\nআমার উত্তর হচ্ছে এটা: এগুলো আলাদা আলাদা পরিচয়। এগুলো যথাক্রমে ধর্ম, নৃগোষ্ঠী, এবং জাতীয়তা+নাগরিকত্বের পরিচিতি। আমি তিনটাই। আগে-পরের কোনো বিষয় নেই, এবং আমি এর মধ্যে কোনো যুক্তিও খুঁজে পাই না। একজন বাঙালি বাঙালিই; একজন মুসলিম মুসলিমই; একজন বাংলাদেশি বাংলাদেশিই।",
  "votes": "18",
  "comments": [
    {
      "text": "One cant escape his ethnicity, can he ? But surely can change religion or choose not to be !!! Ethnicity or religion are 2 different things, not really comparable !!!",
      "votes": "4",
      "replies": []
    },
    {
      "text": "সমস্যা কি ?আপনি তাকে জিজ্ঞাসা করবেন আপনি আগে পুরুষ না আগে মুসলিম ।",
      "votes": "7",
      "replies": []
    },
    {
      "text": "If you can truly become a real Bengali first, then you can definitely become a true Bangladeshi. Bangladesh’s main culture and ethnicity are Bengali, not Arabian.\nAs for our religion, we definitely don’t have Arab or Turkish blood. Most of us have brown skin and look similar to the people of Eastern India. This shows that our religion changed over time, maybe we were Buddhists or Hindus before and then after Bakhtiar Khilji’s arrival, we became Muslim.\nSOO I WILL SAY I AM BENGALI FIRST",
      "votes": "4",
      "replies": []
    },
    {
      "text": "We are Bengali first, we are ethno-linguistically Bengali first and foremost. Our citizenship and religious believe comes after that imo as a Bengali can be a citizen of a different country and be of a different religion.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Both are different, why one needs to come ahead of other. Maybe one is ethnically bengali and muslim in religion!!! Why its even an issue !!!",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "It usually boils down to, if Islam and Bengali culture gives 2 conflicting opinions, which one I shall follow, not out of self interest, but because you prioritize that particular culture.\nAnd considering how Islam claims to be an entire life system (not just a religion), you are on some high dose copium if you think they do not conflict.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Brahman",
      "votes": "1",
      "replies": []
    },
    {
      "text": "সবার আগে মানুষ হন ভাই, তারপর নাহয় বাঙালি / মুসলিম আরও বাকি যা যা হওয়ার হয়েন!!",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 20
}