{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p4hffn/jamaat_leader_explains_their_plan_to_rig_the/",
  "hash": "0c4182172f1fd17cca5545a598a44fdc",
  "scraped_at": "2025-12-08T12:12:54.169390",
  "title": "Jamaat leader explains their plan to rig the upcoming election using the administration",
  "description": null,
  "votes": "64",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Probashi people who plan to vote for these fuckers whilst staying in Europe and NA are the biggest hypocrites!",
      "votes": "43",
      "replies": [
        {
          "text": "Word",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "These guys are so backwards they dont even know it",
      "votes": "29",
      "replies": []
    },
    {
      "text": "ফ্যাসিস্ট ফ্যাসিস্ট করতে করতে এখন বাংলাদেশ আসল ফ্যাসিস্ট পাইছে🤣🤣",
      "votes": "20",
      "replies": []
    },
    {
      "text": "Fuck them, you still call hasina' term bad!! I doubt your question-forming ability. Hasina was very right about these genociders.",
      "votes": "24",
      "replies": [
        {
          "text": "you still call hasina' term bad\nBruh you don't need to use them as an excuse for hasina apologia lmao",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "And many Gen Z and teenage youth drool over these guys?\nDownvote me, but yes they’re horrible and corrupt but I’d take Mr 10% and his gang over Jamaat any day of the week.\nAt least when the BNP robs me they won’t give me a khutbah along with it trying to justify it islamically",
      "votes": "11",
      "replies": []
    },
    {
      "text": "Source: https://www.facebook.com/watch/?v=1581338789888244",
      "votes": "4",
      "replies": []
    },
    {
      "text": "This is basically the first and maybe last administration. BNP will return to power if there's any semblence of a free election. The only Jamat voters are people in urban areas. In rural areas, it's all local leaders who get elected which Jamat doesn't have. Mullah's stay inside mosques in vast majority of the country.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Jamaat will rule for the next 15 to 20 years.",
      "votes": "0",
      "replies": [
        {
          "text": "BAL will come to power even before Jamat",
          "votes": "11",
          "replies": [
            {
              "text": "Never underestimate the power of “herd of sheep” that believes in an Islamic state of Bangladesh",
              "votes": "16",
              "replies": []
            }
          ]
        },
        {
          "text": "Honestly bhai dui bhabe dekhi eitah.\n1)what I believe Jamaat still doesnt win .\n2)Jamaat wins and the country doesnt even last 10 years for them to rule that long",
          "votes": "3",
          "replies": []
        },
        {
          "text": "They will never come to power by means of election.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-8",
      "replies": [
        {
          "text": "Bro jamaat is far far worse. People don't realize just how bad things can get because people are idiots.",
          "votes": "21",
          "replies": []
        },
        {
          "text": "Bhai oi logic e shobai same. But thats not the case. Jamaat will strip away basic human rights",
          "votes": "15",
          "replies": []
        },
        {
          "text": "The word you are looking for is : “ Similar” One sells religion Another sells liberation war",
          "votes": "1",
          "replies": [
            {
              "text": "One killed and rape millions for their Paki friends. The other killed few hundred to protect own police, administration and public property. Now you judge it!",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "উবাবা। জামাত খারাপ ঠিকাছে। কিন্তু কমেন্টে আওয়ামী কুত্তারা ঘেউ ঘেউ করতেছে আর প্রচুর আপভোট। জামাত আর আওয়ামিলীগ সেইম। ২ জনই দেশের মানুষ মারছে। একজন কম মারছে আরেকজন বেশী মারছে দিয়ে বিচার কইরা লাভ নাই। আওয়ামিলীগ অনেক জামাত ঢুকাইছে, ক্ষমা করছে স্বয়ং সেক্স মুগিব। আর কমেন্টে ইন্ডিয়া থেকে ভিউ বেশী আসে কেন ভাই? 🤣🤣🤣 এইগুলা কিন্তু আবার রাজাকারি না 🤣🤣🤣",
      "votes": "-1",
      "replies": [
        {
          "text": "I'm convinced most of the commenters genuinely don't hate jamaat as much as they just love BAL and this is one of the last remaining platforms where they can express that.",
          "votes": "1",
          "replies": [
            {
              "text": "Oh you are exactly right too. If they truly hated jamaat and had good ideology they would choose to support hundreds of other groups in our country who have expressed concern about jamaat. But nooo they have to support the looting corrupting, murdering and not to mention raping political party.",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "BAL idiots emerging where they see a chance, lol",
          "votes": "0",
          "replies": [
            {
              "text": "Recently dekhi onek bere gese. shob gula koi diye ashlo, eto boro opinion change dekhi nai ei subreddit e. Ei subreddit e even jokhon people used to think Hasina was the best option out of all evil tao pochaito tare, ekhon toh pura murder justify kortese , saying anything else is downvote. Kuno notun Whatsapp group khulse naki?",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "BAL 🤝 Jamat",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 200
}