{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p4dktr/is_first_date_that_weird/",
  "hash": "65b845b46e0221df401ccc74b2d79f1d",
  "scraped_at": "2025-12-08T12:13:58.856530",
  "title": "Is First Date that weird?",
  "description": "I[21M] went on a date some days ago with a girl[21F] I thought I liked. We having been talking for quite a long time [6 months] and I knew her from high school days. Then we confessed that we liked each other . She said she wanted a date . I agreed. In fact, it was the first date in life for both of us. I had very high expectations so did she. Initially I was so excited I instantly proposed her(shouldn't have done that but We both are noob) but then through the later part I was not much interested, in fact I was so disappointed that it was even considered a date. So I end things there and she insisted we take some photos which we did and then I accompanied her to the place I picked her up from. I think either she is head over heels for me or she believes she needs to marry whom she dates first in life(She told me that while talking also I was used to believe that).But I am not interested anymore(kind of).I am so confused right now. I can't even wrap my head around it.What's your two cent? Is it okay(pls no religious lesson)?\nUpdate(5 December 2025):I couldn't eat my breakfast. Food felt like tasteless rock. I cried in the back garden of the hall. I feel like I am a coward. I let my first love down just because I feared my academics will be hampered and I couldn't change myself. I think I deserve no one. There is no love for coward in the world. She deserves someone better than me, Someone who would fight against the world for her , someone who would make her feel like a queen. I still can't forget about the things we talked about and her beautiful and innocent face, her excitement when she talked with me. But she is not there for a coward like me. So I should just let her find her real hero.",
  "votes": "0",
  "comments": [
    {
      "text": "Stop wasting people's time and tell her straight you want to end things.",
      "votes": "12",
      "replies": []
    },
    {
      "text": "It's better to be honest and quickly cut things off than randomly vanish",
      "votes": "8",
      "replies": []
    },
    {
      "text": "You're not interested after talking for months and liking her enough to go on a date?\nWhat changed?\nRegardless of what changed your mind, don't keep stringing her on. Make it a clean break; let your thoughts known to her and move on",
      "votes": "7",
      "replies": [
        {
          "text": "she kept pressuring me for lifetime commitment (like kosom sorta things.I get it that she still has childhood dream of her prince charming and happily ever after).I was not there to fuck around though but it turned me off.I talked with her about it though(today) we decided to go on another date and see where things go.I am giving it another try since she is the first girl I proposed.",
          "votes": "0",
          "replies": [
            {
              "text": "The whole dynamic is giving sus vibes honestly. You and her, both. It just doesn't seem right, I don't know how else to describe it.\nIt's never anyone's obligation to go on a date with anyone. But, I don't know the whole story... Maybe it will work out in the end 🤷🏻‍♀️",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "In which country and city this happened? What did you expect from your first date? For what did you propose her?\nPlease answer so that we can evaluate your situation more. However, you aren’t mature enough to be in a relationship, so move on immediately.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 203
}