{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p4bfn8/if_you_own_a_business_in_bangladesh_and_some/",
  "hash": "296bcb1dec75d641482304a956f84115",
  "scraped_at": "2025-12-08T12:14:14.969380",
  "title": "If you own a business in Bangladesh and some thugs demand ‘protection’ fee, how do you realistically deal with this?",
  "description": "Will calling the police help?",
  "votes": "22",
  "comments": [
    {
      "text": "You find the bigger thug for protection.",
      "votes": "19",
      "replies": [
        {
          "text": "Eitai. You play by the rules of the area.",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "Have something to protect yourself. Saving your own life is sacred before anything - self-defense is always a priority.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Calling RAB might be better. But it's important to get help from a bigger thug.",
      "votes": "4",
      "replies": [
        {
          "text": "RAB take share from the thug revenue,all the people in the justice system are aware of these kind of things",
          "votes": "8",
          "replies": []
        }
      ]
    },
    {
      "text": "That's why you get protection from a bigger badder gang beforehand.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "একটু সাবধানতার সাথে এগুলো হ্যান্ডেল করা উচিত ,কারণ লোকাল মানুষ জন ই এতে জড়িত থাকে ,ওদের লিডার এর সাথে কথা বলার চেষ্টা করুন পারলে কিছুদিন অপেক্ষা করতে বলুন আর যদি দেখেন ক্ষমতার দাপটে উল্টোপাল্টা কিছু করে ফেলতে পারে তবে খুব সামান্য পরিমাণ দিয়ে আপাতত ঠান্ডা রাখুন তবে খুব সাবধানে একবার টাকা পাইলেই এরা আবার চাইতে আসবে ...",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Seek Allah's protection from such people. It's disgusting that this is the state of a Muslim country.",
      "votes": "-3",
      "replies": []
    },
    {
      "text": "You get a bigger thug to protect you.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "22 Gauge",
      "votes": "1",
      "replies": []
    },
    {
      "text": "yes. It helped before. But not now. Until the rule of law is established, you are destined to lead a life under this chaos.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Get the bigger thug or give in to it,Getting on their bad side will directly be a threat to your life also",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 204
}