{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p4apuj/bangladesh_really_i_would_think_there_are_more/",
  "hash": "8391c36e8107c53211c5c95458ca606c",
  "scraped_at": "2025-12-08T12:14:31.963382",
  "title": "Bangladesh? Really? I would think there are more far right Indian ran accounts on twitter",
  "description": null,
  "votes": "49K",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "ফ্রিল্যান্সিং আরকি, এসব প্রোপাগান্ডার জন্য বিভিন্ন কোম্পানিকে পে করে তখন তারা এশিয়া/আফ্রিকায় কম খরচে আউটসোর্সিং করে। আমার হোস্টেলের একজন এ কাজ করতো, পোস্ট আর রিচ হিসেবে পেমেন্ট হয়",
      "votes": "22",
      "replies": []
    },
    {
      "text": "I wonder why India wasn’t mentioned? They are notoriously known for larping as other nationalities.",
      "votes": "44",
      "replies": [
        {
          "text": "because all of this are propaganda",
          "votes": "18",
          "replies": []
        },
        {
          "text": "They are the biggest. On r/politics it mentions India. It's just classic Indian move of Indian posters blaming all their garbage on us.\nhttps://www.reddit.com/r/technology/s/BMYvGQYczu",
          "votes": "13",
          "replies": []
        }
      ]
    },
    {
      "text": "BANGLADESH MENTIONED 🗣🔥🔥🔥",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Check X's India bot accounts, they are editing photos and putting \"Bangladesh\". They crap online and then put the blames on India and Pak to hide themselves or damage control.",
      "votes": "14",
      "replies": []
    },
    {
      "text": "বাংলাদেশের মানুষ টুইটার চেনে? অনেকে রেডিটের নাম শুনছে বুয়েটের ঘটনার মাধ্যমে। যে টুইট করছে এ কি drunk ছিল।?",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Not surprised. When they had the convoy protest in Ottawa back in 2022, their Facebook group was managed by some bangladeshi dude.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Fake news, it's indians",
      "votes": "20",
      "replies": [
        {
          "text": "its Indian saaar",
          "votes": "3",
          "replies": [
            {
              "text": "Shut it bindian.",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "the heat map showing bangladeshis larping as europeans was fake, it was a circumcision map",
      "votes": "8",
      "replies": []
    },
    {
      "text": "most likely indian bots routing through Bangladesh. Bangladesh and Nigeria simply doesn’t have the resource to run such campaigns themselves.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Matro arekta post e comment korlam, but chinta koro how many Bangladeshi likes trump cause he actively push anti trans shit.",
      "votes": "3",
      "replies": [
        {
          "text": "While lot's of Bangladeshi shares the same view as Trump that is not why accounts are on Bangladesh.\nThere are lots, I mean lots of bot farm in Bangladesh. They are cheap in western currency but in our currency they are earning shit load of money.\nSource: পশ্চিমদিক ফিরা কইতাছি and, I was approached to develop some tech for similar farms.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "This feature is still on, I dont know that is the legitimacy of this tweet.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Pretty sure that redditor is from India, as they are notorious for speeding misinformation and propaganda.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "সিলিকন ভ্যালি টিভি শো দেখে থাকলে জানবেন, ওই শোতে বাংলাদেশের ক্লিকফার্ম দেখিয়েছিল। যদিও শুটিং লোকেশন দেখে বুঝেছিলাম ওটা ইন্ডিয়ায়। অর্থাৎ আমরা আরও দশ বছর আগেই ক্লিকফার্মের জন্য আমেরিকায় পরিচিতি পেয়েছি।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "বট ফার্মিং, \"ফ্রি-ল্যান্সিং\"\nপাকিস্তান, ইন্ডিয়া আর আরো সব গরিব কান্ট্রির লোকেশন থেকে এইসব কাজ করা হয়।",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Well maybe Indians don't use Twitter that much we just say that to cope",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Bangaldeshi ra twitter e to use kore na lol",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Your thoughts are not fact",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Indians creating their own happiness 😂😂😂",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 205
}