{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p42atd/giant_earthquake_predictions/",
  "hash": "d1e892df96d9a9becb454a0a43c518ee",
  "scraped_at": "2025-12-08T12:15:21.529822",
  "title": "Giant earthquake predictions?",
  "description": "Guys I heard that before a huge earthquake comes smaller ones come one by one. We definitely built alot of buildings in the past years, I wonder if it's the reason for these earthquake.. please let me know!",
  "votes": "7",
  "comments": [
    {
      "text": "Buildings don't cause earthquakes, movement of tectonic plates do. For the last 20 years people have been saying Bangladesh will be hit with a disastrous 8-9mag earthquake, akin to a nuclear bomb. anyways there is some truth in that, someday it will happen. We just don't know when.",
      "votes": "15",
      "replies": [
        {
          "text": "There hasn't been a 7.9 yet tho.. but we won't even think of surviving a 6",
          "votes": "2",
          "replies": [
            {
              "text": "Search on Google about the 1762 Chittagong earthquake, which had a magnitude of 8.5-8.8",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Geologists have been predicting a massive earthquake for the last hundreds of years. Essentially one is due considering the massive power stored near the fault line. However, nobody knows when it will happen, it might happen tomorrow, next year, next decade or century. However, if there are several low magnitude earthquakes, the probability of a massive earthquake may be low.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "If big buildings were the cause of the earthquake, NYC and Dubai would be decimated by now.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Big buildings probably would not cause earthquake. But how those buildings were made, safety exit, road condition etc will determine the survival rate and after effect rescue operation.\nThere are roads where a big car can not even go in normal condition, just imagine in a disaster condition how they will do the rescue operation !!",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 208
}