{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p3qufp/need_suggestions_regarding_the_public/",
  "hash": "b5e8c0395c833bdd7d9251bb5f78f3e0",
  "scraped_at": "2025-12-08T12:18:03.901554",
  "title": "Need suggestions regarding the public universities in Bangladesh? Are they worth it???",
  "description": "[ This post is not to offend anyone here, just for some perspective ]\nHey, so i just finished my HSC this year from a renowned college in Bangladesh and am currently into the admission process for Public University. My family comes from a military background, although we are not so much \"hi-fi\" type rich people that my parents can afford my education in any of the private universities here.\nMy dream is to become a corporate lawyer and i want to live in one of the New York boroughs in my 30s and work somewhere like latham and watkins or Kirkland and Ellis. This is a very rough plan, but i envision it to be something just like this.\nNow the thing is, it's been almost two months since i started going to multiple coaching centers and i am literally getting culture shock. The competition is insane and i am totally fine with that, but the philosophy of some kids here is out of this world. They kind of worship dhaka university/ dmc/ buet; it's like they are not enthusiastic about what they wanna be in life, rather they are enthusiastic about just the university tag, that's all.\nAnd why am i getting culture shock? I graduated high school from a military residential college (i don't want to disclose but ig you can guess) and i have been active in various competitions, stage, sports, enjoyment of life and whatnot. I have never been with people who are only obsessed with education; i have been with people who are enthusiastic about improving themselves. But let's move on to something more real.",
  "votes": "90609",
  "comments": [
    {
      "text": "If you can, go to London for studying law. The path will be much more easier and smoother. Also, in public universities, you would find the best minds of the country. There will be different type of people as well.( Ganjakhor theke bookworm, shob). You don't have to live in a hall, you know.\nHowever, I don't know about how up to date the facility and the curriculum for law are. So, try to get into the best law university in the country. If you can't, then try for British universities with scholarships of course.\nEdit: Assignment, Report habijabi syllabus sesh korei time kulaite pari nai. Dari Katar o somoy thakto na. So, sorry if I might have discouraged someone to study in a public varsity with my abysmal appearance.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Not all departments are equal in universities. So if you get qualified for any universities whether it's public or foreign, talk with students from that department to get an idea of how the facilities are. Public universities at least has open space to move around and talk with people.",
      "votes": null,
      "replies": []
    },
    {
      "text": "You can definitely reach your dreams of being a lawyer at a new york white shoe law firm. Your undergrad doesn't matter much if you choose to do your undergrad in Bangladesh. The best option would be to apply to private US universities and liberal arts colleges, those who liberally provide 100% merit based financial aid. If that doesn't work out, go to DU or Jahangirnagar if you can and then apply to law schools in the US after your undergrad.",
      "votes": null,
      "replies": []
    }
  ],
  "id": 218
}