{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p3mpd1/is_the_lack_of_safety_in_bangladesh_exaggerated/",
  "hash": "abd130c852ad94b35c676848c0eaf0de",
  "scraped_at": "2025-12-08T12:18:35.272611",
  "title": "Is the lack of safety in Bangladesh exaggerated?",
  "description": "Anytime I say I wanna move back to Bangladesh the most common reply is Bangladesh is dangerous. I also hear lots of people want to leave Bangladesh cuz of the lack of safety, even if they are doing financially well, have stable jobs, own houses, etc. So I’m wondering how bad is the safety level in Bangladesh that makes people leave their ‘comfortable’ lives to move abroad? What exactly is meant when it’s said Bangladesh is dangerous? Because crime exists in every country. When I visit bd I don’t see anything out of the ordinary that makes me feel unsafe",
  "votes": "34",
  "comments": [
    {
      "text": "Your property is suddenly not yours if one of your relatives/neighbours/renters decides they can take it. Your daughter can get targeted for smoking cigarettes, wearing no orna or a conservative guy having a bad day decides he just can’t stand women leaving their home. You can’t run a business without paying to political parties. Or be a landlord without regularly paying some local unemployed guys. There’s no workplace laws. No law at all unless you know someone working in the law enforcement or someone politically connected.\nI can go on and on.",
      "votes": "47",
      "replies": [
        {
          "text": "Word!!\nThere are some toxic and problematic people with whom I stay in touch just so that if I ever need help, I can it get solved without having to go through and bribe multiple government officials and law enforcers.\nMakes me sick to the core but it is what it is.",
          "votes": "10",
          "replies": []
        }
      ]
    },
    {
      "text": "No rule of law.",
      "votes": "22",
      "replies": []
    },
    {
      "text": "How long have you lived in/visited bd? Depends on many factors.\nFrom a female perspective, BD is very unsafe for us. Now this is in comparison to the Middle East where i've lived my whole life, but i spent a few years in BD during my university years.\nPublic buses are the scariest. Once i enter, men will be staring and 'accidentally' brush past my body despite the space to move. Same with people on the crowded streets. There were quite a few times where random men came up to me and tried to start a conversation/followed me till my house.\nI studied at NSU, and although i loved my university, some interactions with the guys there really disturbed me. I dont know if it is the education or the upbringing, but many do not know how to talk appropriately to a woman or maintain their boundaries. And surprisingly, most women are okay with it and intentionally ignore them because apparently its very normalized?? There's a very ugly phenomena going around where they approach only to score a date or other benefits. Fortunately, i still met a few good guys who actually wanted to be friends. I guess the right circle matters.\nEveryday felt like a battle to me when i stepped out, but alhamdulillah im back to the middle east where women are respected more and gazes are lowered by men.",
      "votes": "21",
      "replies": [
        {
          "text": "The Middle East in general is very very very safe. It is a lot safer for women there, very different to Bangladesh.\nThe whole \"chele dhora\" (child snatching) doesn't exist when you ask them, they get surprised because it doesn't exist in their cultures. Little kids walk in the streets and buy groceries all the time and come home safe.\nYour typical Arab has never heard of \"stranger danger\" or grew up with it, it's that safe. And given their bold personalities, Arab kids bully and yell at strangers who try to harm them, not the other way around.\nThe Arab kids all grew up buying little groceries like buying bread from the bakery or other food items their mother needed for lunch/dinner alone or with their brothers/sisters.\nA lot of men here are very very rude to women which is normalised, they speak in a rude or very authoritative tone to women because \"they're the man\", I saw this in the workplaces, in the streets, everywhere. It's like they have a permanent ego and attitude problem with women.",
          "votes": "8",
          "replies": [
            {
              "text": "Very true👏 but I do face harrassment in the middle east too and guess who the culprits are... Bangladeshi men😃 they come here and stare and do 'accidental' touches as well. It is also a well-known fact among the arabs and im almost always embarrassed to introduce myself as a Bangladeshi when the topic comes up. Thankfully most of these people end up getting deported",
              "votes": "11",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Your property can be taken by a zealous or powerful relative or neighbor by counterfeiting legal \"dalils\". Property courts are worthless if you don't have a good lawyear with not only strong knowledge of the law, but influence as well. In Bangladesh, lawyers with more \"clout\" have more pull on the verdict and are taken more seriously (veteran of personal property wars). If you have iron clad paperwork, you are \"more or less\" safe, unless you piss of the government (doesn't matter who's in power), then good luck.\nYou son and daughter can be molested by teachers/hujurs and most commonly relatives; and anyone on the street; regardless of age. Sexual harassment is common, even for powerful families. Rape laws are strong on paper but culprits get bail very easily due to loopholes and bribery. If you have iron clad paperwok, you are \"more or less\" safe\nIf your business is growing, you might attract \"extortionists\" and you regulatory issues- everyone wants their piece of the pie.\neven if you stand still, you might die due to a crossfire It has happened twice when a criminal from a rival gang was targeted by another and a guy riding a pathao died. Same thing happened with a girl; the girls father didn't even go to court because \"bichar pabve na\".\nYou won't get your salary in time unless you work for a really good company that has an international footprint. You will need connections to stay afloat and be competitive and be taken seriously.\nThe grass greener on other side:\nNot necessarily, you go abroad, the facilities are certainly better- better quality food, healthcare and lega protection (depending on where you live) and less crime. though some parts of Europe and North America have a high crime rate as well. Sweden is now the murder capital of Europe thanks to a large influx of middle eastern immigrants, with a large portion of them being from Syria and war veterans who fled the nation.\ngoing overseas can be lonely, you won't get to socialize as much, their culture is different, even the language. You might make friends in the long run. You will have to work to death and you might not be able to afford a house in some parts of the western hemisphere due to incredibly high house prices. My cousin is a Canadian citizen and works as a stockbroker, she's pretty successful. even she's saying that if she can't buy a house in the next three years, she won't be able to afford one ever. That should tell you something of a permanent stay abroad.\nOverall: a lot of people have the idea that \"bidesh gele takai ar taka\", which is not true. But people still go, becuase its safer and healthier IF you have a decent job and can maintain a good lifestyle.",
      "votes": "10",
      "replies": []
    },
    {
      "text": "The average salary for entry role in this country is fucking 20k BDT.\nThis place isn't livable at all",
      "votes": "6",
      "replies": []
    },
    {
      "text": "It's mostly tribal knowledge. You would think eating something while minding your business would be a normal thing to do. But if you do that during daytime in Sylhet city proper during Ramadan, people will lynch you for that.\nSo people who know that, and don't make the mistake, would be fine. Now imagine someone not having that knowledge does exactly that.",
      "votes": "11",
      "replies": [
        {
          "text": "What about an American traveler eating during the day in Ramadan? Would that be a problem too?",
          "votes": "2",
          "replies": [
            {
              "text": "Considering how they slap , touch and disrespect the street vendors and people around still put up with their bullshit i would highly doubt anyone would care.",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "It indeed was exaggerated until last year, but now it’s actually getting pretty damn dangerous everywhere",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Will you feel comfortable travelling alone especially at night?\nWill you get justice if something were to happen to you if you are not rich or connected?\nWill you have access to decent medical care?\nNot related to safety but this is one of the things that bugged me a lot. Will you be able to live your life without participating in bribe and corruption?\nIt's not the net percentage of such events that sucks although they are quite high compared to more developed countries. But it's the constant vigilance required for everyday life that drains you.",
      "votes": "3",
      "replies": [
        {
          "text": "I love personalities like Tasnim Zara and Ashiq Chowdhury, who came to bd to reform this country. July is incomplete. It's our duty to support the loyal and brilliant minds to take over the country's administration. Honesty and Trust are far more important than Ideology. There is a significant right-wing rise in the west. .Glorifying romans, crusade, even nzi have become a trend in insta and x . We should facilitate talented students going abroad not those fake asylum seekers. Bd Visa is now a joke ranked with somalia, afg , syria War-raged countries. And it is we who are guilty.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Under exaggerated",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Forces are there, just not exerted",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Bangladesh is not as unsafe as some countries in Central America or South America or some other parts of the world where you can expect:\n- bodies on the street every day\n- random killings, you are sitting or standing in a bus stop and someone in a car shoots you and leaves\n- people disappeared for their body parts are taken, sold or used in black magic\n- carjackings in many places so you cannot stop on the road, it is so common they say if you see a body or animal on the road ignore and keep driving because this is tactic used by criminals\n- every house needs big metal bars and multiple locks and alarm systems because theft is so common (and they kill in the theft)\n- you need to actually keep a gun with you or it's recommended because of above - it's either you are killed or you shoot to injure/kill, no other choice\n- you have to leave and enter the house at different times every day from work/school/other because some people are watching and noticing, they will steal from your house when you're not there if they know when you leave\n- like Paris Metro train or other places where if you wear jewellery or your phone is in your hand it will be gone within minutes, there are warnings on it, Dhaka Metro is safer people hold their phones all the time\nBut it's unsafe.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Answer me this: when did u last visit Bangladesh? If its within 2 years and still did not experience anything that troubles your security, there is something wrong with you. If you were a general people with general level of understanding, you would have felt and experienced it. Sorry for being harsh.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "It is highly exggerated.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "People who never visited other countries assume it's safe to walk alone at night in a dark alley anywhere else except Bangladesh.\nUse common sense and you will be fine.\nYou will face problems working with constructions, permits, everything costing insanely high because of syndicates and taxes.\nBut everyday living is not much different security wise.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "As a non-desi muslim that is married in Bangladesh I can say that a lot of people are overdramatic. And no, I am not living in Banani/Gulshan/Baridhara and I do go out at night with my wife until 12 in most of the cases and travel rickshaw / CNG mostly. It’s crazy for me how the same Bangladeshis that talk about safety choose to live in working / lower class establishments in places such as Europe or the US. As someone borned in europe I can assure you that several areas of Marseille , Paris or London are worse then anything Dhaka could offer in terms of crime and safety. Not to mention that US faces gang related shootings in a day as many as Bangladesh faces in years. Also the ocasional junkies that you find sleeping on the street or near the stadium are nowhere as bad as the ones you’ll see in the center of LA walking like zombies around you. Bangladesh It’s not to the level of Saudi Arabia or Qatar in terms of safety but i am preety sure that you are safer in Dhaka then in most of western european capitals suburbs.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Is this real? I know that Bangladesh is going through ideological changes but is it that bad?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "you only need to get killed once. You only need to get raped once.\nIf you dont feel safe mentally, then dont be there, isnt that enough.\nBut hey that can be anywhere.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "nah",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 220
}