{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p37p18/why_not_ban_indian_news_channels_and_youtube/",
  "hash": "874ef596d8803a18539334e4f4aa8360",
  "scraped_at": "2025-12-08T12:19:42.338815",
  "title": "Why not BAN Indian news channels and Youtube channels from Bangladesh?",
  "description": "Given the spread of misinformation and it being Hasina's biggest source of sending messages to the public. Given that she is now a convicted criminal and her party has been suspended, why not Ban indian media and social media channels indefinitely.\nWhat benefit does it bring for regular Bangladeshis?",
  "votes": "6",
  "comments": [
    {
      "text": "Let's not stoop that low like indian govt that bans even X accounts for arguing against them. Bangladesh is in a challenge to bring back democracy and winning a narrative war against Indian media.\nBanning any channel isn't worth it. I also think Bangladeshis don't believe their lies",
      "votes": "19",
      "replies": [
        {
          "text": "I disagree, their influence needs to end completely.",
          "votes": "-1",
          "replies": []
        },
        {
          "text": "Bhai we aint the USA And not everyone in our country believes in democracy, most dont even know what it means. One group support fascism and one supports religious extremism.\nMoreover, politicians intentionally dont invest in rural education so that they can easily manipulate mass population. These people then end up lacking ethics and are easily tempted to do the wrong thing. They dont even sell their votes for instant money but for the future possibility of it.\nIf you want to rebuild a democratic society in such a chaotic mess, it needs to be done in a controlled environment.",
          "votes": "-4",
          "replies": []
        }
      ]
    },
    {
      "text": "Indian channels broadcast propaganda for indians, not for us. They do that to keep public sentiment in tune with the puppet masters.\nBlocking on our end serves no purpose, just allows them to go on a spree without any fact check scope from our side.",
      "votes": "10",
      "replies": [
        {
          "text": "You are so wrong about this.\nJust look at the level of access they have recently given to awami league leaders, they are using awami voices to spin the narrative.\nThis greatly impacts the poverty stricken and uneducated class who if i may remind you are the majority in this country.\nA big example is the recent Dhaka lockdown and how so easily people got scared.\nAnd the timing is crucial here, with the election date nearing, they are trying to manipulate public opinion.",
          "votes": "-3",
          "replies": []
        }
      ]
    },
    {
      "text": "I am not against them. Because I believe in freedom of speech.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Its called freedom of speech fella",
      "votes": "5",
      "replies": [
        {
          "text": "Freedom of speech for terrorists trying to instigate violence? Surely not such a common practice even in the west.",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "Two years ago, there was \"India boycott\" and now there is \"India ban\".\nPinaki and less iq mumin muslims began \"Indian products boycott,\" yet Pinaki is enjoying French meals in Paris,\nWhile in Dhaka, regular people are paying the same price for Indian rice imported from Dubai with the \"double price\" tag.\nDid you see whole worldwide communities ignoring \"Islamic emraties of Banglastan\"?\nToday, earthquakes hit, and no single international community responds.\nIf the \"India ban\" propaganda spreads, India will use it as an opportunity to impose \"just small restrictions on regular rice exports and water share agreement,\" causing famine to break out in the Islamic emirate of Banglastan.\nNeither the United States, China, nor Turkey can give us with food, particularly \"rice\".\nUkraine , Vietnam ,Myanmar and Thailand have their own domestic problem.\nEven with rice imports from Pakistan, the direct maritime route between Karachi and Chittagong might take around 10-15 days.",
      "votes": "4",
      "replies": [
        {
          "text": "Your India can't do anything.\nIf it could, it would've by now.\nFor all the great talk, saudis have militarily allied with pakistan, US and china helped pakistan win operation sindoor while you lot got tariffs of 51%.\nNow modi is begging china for help.\nYour \"garibistan\" cant even guarantee security for the women living in it.\nEk thappar parega na Bangladesh se, ghutno pe aa jaega tu or tera baap.",
          "votes": "-2",
          "replies": [
            {
              "text": "Bro saudi arabia is a Muslim country and pak is the only islamic country with nuclear missiles..so it was not so shocking after all muslim trust muslim the most....op sindoor was success..we have destroyed the buildings..we have done things in real..not boasting only in social media....and I accept we losses so what ..pak has more losses than us....pak whole country mostly focus on their military giving a large funds to pak military...and begging world bank ..asian development bank....\nIn Every country, especially indian subcontinent.....all countries have many crime rates against women..in Bangladesh to ..just check the ratio with population..we have high no.s though...and u know what in Brazil .4 out of 10 women had witnessed sexual harrasment....\nHaa that same trump is talking about reducing tariffs...and we didn't stop importing russian oils after all this. Modi didnot change his policy bcs of trump ...and about China...china is a great country many countries depend on china .ur own country got so many loans from China... .really bhikaris are youu brooo..and we are playing geopolitics......thappar maarle..phir tera baap or tera ser nhi bachega phir....\nEnglish is my second language..",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I'm fully in support of banning most Indian news channels. Most are full of misinformation and editorial bent in support of the BJP, including half of the Bengali news channels.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Why not ban Indians from commenting in our online spaces...and also ban their content....bollywood YouTube everything....\nI dont need technical guruji... Samzone does it well for me...aro lagle content creator future e aro hobe...to fill the vacuum",
      "votes": "7",
      "replies": [
        {
          "text": "I'm in favor of imposing visa restrictions on them until 6 months after the election if it means the safety of our nation.",
          "votes": "-4",
          "replies": []
        }
      ]
    },
    {
      "text": "Educate yourself what to watch what not, banning won't solve anything.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Complete ban, as many pointed out, is fundamentally opposite what the new Bangladesh is actually trying to go for.\nHowever, I think traditional content Indian channels and move releases need to be charged at a premium so that general public can't access without paying good money. This will discourage consuming their content and our local entertainment industry can improve.\nCanada does this to an extent to limit American content through premium and various restrictions.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Yall toppled a fascist leader to remain fascist? For what reason?",
      "votes": "5",
      "replies": [
        {
          "text": "Why would it be fascism?\nIf someone was using mosques or dawah to spread lies, extremism and to encourage violence, would you not ban it?\nThen how is this any different?\nIts a matter of national security.",
          "votes": "-1",
          "replies": [
            {
              "text": "You want to control international media which people have the right to access. And mosques and dawah ARE spreading lies, extremism and encouraging violence. Why aren't you advocating to have them banned as well? Oh that's right, because it would infringe on the people's right to religious freedom.\nYou are rightfully concerned about disinformation campaigns but to protect people, give them the tools to recognize what is real and what isn't. Educate them. Don't try to control them. That is fascism. Your suggested method is wrong and honestly stupid because people have access to VPNs. You don't think Hasina tried to control our digital access? And what will you do if someone does access international news by bypassing whatever firewalls you've set up? What will be their punishment? Death? Imprisonment? Fines?\nSolutions need to be logical not emotional. Critical thinking is a good skill to have. Think critically you know?",
              "votes": "5",
              "replies": []
            },
            {
              "text": "If someone was using mosques or dawah to spread lies, extremism and to encourage violence, would you not ban it?\nYou answered yourself bro 🥹",
              "votes": "4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "because we are not fascists like them",
      "votes": "4",
      "replies": [
        {
          "text": "I'll invite you to think a bit more critically on this one.",
          "votes": "-1",
          "replies": []
        }
      ]
    },
    {
      "text": "Nice try al botor",
      "votes": "-3",
      "replies": [
        {
          "text": "Cant have a discussion without labelling people ay?",
          "votes": "7",
          "replies": []
        }
      ]
    },
    {
      "text": "Indian news channel should not be banned Cause Bangladesh doesn’t not have enough resources like India has getting infos worldwide like India\nBangladesh most of the news broadcast nationally even sometimes not trust worthy ; yes may be Indian tv channels can be banned in Bangladesh",
      "votes": "0",
      "replies": []
    },
    {
      "text": "It would be a bad idea to ban them because countless people gave their lives for freedom of speech in this country during 2024. Let them yap because that's all they can do.",
      "votes": "1",
      "replies": [
        {
          "text": "Bro i'm talking about indian media, specifically Godi media.\nNow i can't speak on behalf of the late abu sayed and mughdho but those who fought and are still here would agree to this in a heartbeat.\nThey were the first ones infact who wanted to completely ban awami league.\nI'm not asking for awami league to be banned, i'm asking for this fake news and the convicted criminal to not get easy access to us anymore.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "You tell me which news channel - bangladeshi, indian or international doesn't show fake news misinfo, disinfo? Media channels in this country are full of it.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Because it would have the exact opposite effect.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Censorship is never good, cause who decides what crosses the line?",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 224
}