{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p36h2g/why_do_indians_say_that_there_are_illegal/",
  "hash": "4afb698e8e96801e928ae07557b31a47",
  "scraped_at": "2025-12-08T12:20:03.610675",
  "title": "Why do Indians say that there are Illegal Bangladeshis in India?",
  "description": "There is no huge gap between GDP of Bangladesh and India. They too have high unemployment. So when I hear them complain about illegal Bangladeshis in India, I get confused and ask myself why would a Bangladeshi go to India of all places where the living standard isn’t any different? And why do we not take any steps to bring them back and punish them? India, despite having large land size, has always been perceived as just another third world country like us. Of course when it comes to education, they are ahead of us at the moment, but if we had their resources, we would have done much better. We are only 50 years old as a country. Dictatorship, natural disasters, aggressive neighbours such as India and Myanmar. Despite all these, I believe we have done much better than what any other country could have done. Of course there still is plenty of room to grow. But the point is, I just don’t understand the Bangladeshis who flee to a place like India for better life.",
  "votes": "90609",
  "comments": [
    {
      "text": "Because propaganda works very well in this age of social media. If a post makes people angry or upset, they are more likely to share or interact with it and effectively amplify it's reach. This just feeds the infinite rage machine.\nWho cares or have the time or capacity to verify if it's true?",
      "votes": null,
      "replies": [
        {
          "text": "Yeah maybe. I just don’t understand how even a single person’s life will improve by moving to that country where their own people are struggling to get jobs and are moving abroad in herds.",
          "votes": null,
          "replies": [
            {
              "text": "You are hung up on whether it is true which it definitely is not. But it creates a narrative for the politicians who can benefit immensely from it. If you can divert your citizens eyes to focus on fake issues such as this as your platform, it's far easier to gain popularity and win elections.\nThere are a lot of people in India from Bangladesh (former East Bengal) who left around partition in 1947. Some politicians in India are trying to marginalise these legal Indian citizens calling them \"Bangladeshi illegal\" immigrants.",
              "votes": null,
              "replies": []
            }
          ]
        },
        {
          "text": "Yeah then take them back , you all won't do fencing and even stop india from doing fencing on border , hundreds of you people cross border everyday and live under free social schemes and free ration , now you all act like people don't migrate and will cry when someone get shot while crossing illegally",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "There are Bangladeshis in India who are not authorized and there are Indians in Bangladesh without the proper paperwork. All countries have a certain number of people who are not authorized to be there, especially from neighboring countries.\nIn India, BJP needs a boogeyman they use illegal Bangladeshis. Trump is using Mexicans and Central Americans. The Thais use Cambodians and Burmese.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Dude, there are hell lot of places or states in India like Gujarat, Maharashtra, HP, Haryana (Gurugram), Noida with much higher living standards and GDP per capita. So yes these Bangladeshis illegally come here for doing all the odd jobs, however to deceive the local population Malda and Krishnanagar have been templated as their hometown. India is lot more than just Assam, Bengal and the NE states.",
      "votes": null,
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": [
        {
          "text": "Surely the Awami numbers aren’t that high that Indians will start complaining about this everywhere in social media.",
          "votes": "1",
          "replies": []
        },
        {
          "text": "your last line,\ntheir most obvious destination is India\nLol",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "12",
      "replies": [
        {
          "text": "Better things such as what? Have you checked the unemployment rate in your country?\nBetter quantities of what? The only quantity where you guys are thriving is with your population.\nSo you are saying with 30K BDT which is almost 22K Rupee, you can have a good life in India? Bruh inflation is another topic. 30K BDT isn’t even middle class in Bangladesh and I doubt it’s in India as well. You are exaggerating.\nBangladesh is shit , we all know it, I acknowledge it. But ain’t no way your life will change significantly if you move to India and that too illegally.",
          "votes": "12",
          "replies": [
            {
              "text": "",
              "votes": "12",
              "replies": []
            }
          ]
        },
        {
          "text": "Can you share any evidence, research, or even a document that proves your points? Or the meme",
          "votes": "2",
          "replies": [
            {
              "text": "busy bro,bye",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "Gullible Indian",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Nowadays Bangladeshis act like 1971 didn't happen. Isn't it",
      "votes": null,
      "replies": []
    },
    {
      "text": "But how do they survive there whereas some many Indians are unemployed and live in poverty. It’s just a bigger country by size. How will their living standard change?",
      "votes": "8",
      "replies": [
        {
          "text": "But how do they survive there whereas some many Indians are unemployed and live in poverty. It’s just a bigger country by size. How will their living standard change?",
          "votes": "8",
          "replies": []
        }
      ]
    }
  ],
  "id": 225
}