{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p2ywpw/did_you_know_earthquakes_happen_because_women/",
  "hash": "75ea16be2e59fd3f03b7e5a9c3a6e79f",
  "scraped_at": "2025-12-08T12:20:55.374534",
  "title": "Did you know earthquakes happen because women don't wear orna??",
  "description": null,
  "votes": "204",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Facebook is exhausting and utterly draining. They are finding ways to blame women for the earthquake too. When it's Afghanistan, it's \"Allah's test\", and when it's Bangladesh it's \"Allah's punishment\". make it make sense!",
      "votes": "33",
      "replies": [
        {
          "text": "Ei desh Amar bhallagena,eto chodna manush kemne ekta desh e thaake. Eto hypocritical Manush kemne Hoy.",
          "votes": "8",
          "replies": []
        },
        {
          "text": "",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "আজকে জুম্মার নামাজে হুজুর ওয়ার্ড টু ওয়ার্ড এই কথাটাই শুনাইসে, নারীরা বেপর্দা হয়ে ঘরের বাইরে বের হওয়ার কারণে নাকি ভূমিকম্প 😭🥀💔",
      "votes": "40",
      "replies": [
        {
          "text": "People are so doomed. Then why are there no earthquakes in those countries filled with every single sin and all, and earthquakes in Afghanistan and the one in Turkey?? 😭🥀 what's the logic",
          "votes": "15",
          "replies": [
            {
              "text": "As someone else replied in a different post, “If it’s on muslims, then it’s a test. If it’s on non-muslims, then it’s a punishment.”",
              "votes": "15",
              "replies": []
            }
          ]
        },
        {
          "text": "প্যাথেটিক।",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Imagine if a woman goes to a bank and says that either give me a crore taka or I remove the \"orna\" from my bazookas.\nCall the police or try anything funny, and I will start making out with my same sex partner in crime.",
      "votes": "40",
      "replies": [
        {
          "text": "Take my money 🤣.",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "Dont know why bengalis try to dehumanize women",
      "votes": "17",
      "replies": [
        {
          "text": "To hide their own failures, they blame it to others.\nIts same every where.\nIn western world they blame immigrants for all evil things.",
          "votes": "11",
          "replies": []
        },
        {
          "text": "This is not just a Bengali issue!! The whole sub-continent is filled with systematic misogyny, hate, and patriarchal superiority.",
          "votes": "8",
          "replies": [
            {
              "text": "Nah bhai amader rajje ei problem ta etotau nei",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Wait a minute, thats the same thing our bricklayer said today. His accusations were worse. He doesn't approve of women getting outta home, roaming around streets and all that. Wtf is going on? Meanwhile dustbin shared something similar on Facebook blaming hasina and india for the earthquake. Some nuke us for real, please.",
      "votes": "42",
      "replies": []
    },
    {
      "text": "it's scary the direction bangladesh is headed. i feel really bad for the women in bangladehs. unless someone makes a concerted effort against islamic extremism in bangladesh, we're soon gonna have a lower gdp than even sub saharan africa",
      "votes": "21",
      "replies": []
    },
    {
      "text": "Scientists who discovered the tectonic plates:",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Poor women of bd. Don't know how they will survive in near furture.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Wait no! The earthquake happened because Bangladesh didn't win miss universe, Duh!",
      "votes": "11",
      "replies": []
    },
    {
      "text": "always the halal jihadis",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Just like how extremists twist everything into extremism just to cover up their corrupt, low-grade intentions— same way these clout-hungry shushil types try to drag every topic onto themselves and their drama addiction.\nAt the end of the day, hypocrisy cholche deshbyaapi, it’s a whole ecosystem, Charta biye kore, Islam er naam-e kore deception.\nDuita group shudhu noise ora khay spotlight, Ekjon dhormer naam-e pressure, arekta “rights, rights!\"",
      "votes": "2",
      "replies": []
    },
    {
      "text": "The harsh truth😀",
      "votes": "-2",
      "replies": []
    },
    {
      "text": "",
      "votes": "-7",
      "replies": [
        {
          "text": "So you mean to say that corruption in our society is because women in Bangladesh who don't wear hijab?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Real",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 228
}