{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p2xfmu/how_much_do_police_officers_make_in_bangladesh/",
  "hash": "5e233125208cb38cb08953cff1cb49cc",
  "scraped_at": "2025-12-08T12:21:15.017578",
  "title": "How much do Police officers make in Bangladesh ?",
  "description": "I have a friend who father is a police officer. They are a very luxurious lifestyle. They have a DSLR camera, have a very nice apartment and whenever they go for vacation in Cox Bazar, the whole family take a flight to go there. Taking flights for 6 people is very epensive (at least from my perspective) I was very surprised, how can a police officer's salary support that.",
  "votes": "21",
  "comments": [
    {
      "text": "Probably like 20k a month im guessing",
      "votes": "24",
      "replies": [
        {
          "text": "And a few lakhs extra under the table 😉",
          "votes": "38",
          "replies": []
        },
        {
          "text": "Good guess, it's actually (officially) 22k.",
          "votes": "12",
          "replies": []
        },
        {
          "text": "UN peacekeeping missions pay out really well when you convert it to BDT, but yeah in general the LEA personnel get more of their flashy and flaunting lifestyle money from corruption",
          "votes": "3",
          "replies": [
            {
              "text": "UN peacekeeping missions pay out really well when you convert it to BDT, but yeah in general the LEA personnel get more of their flashy and flaunting lifestyle money from corruption",
              "votes": "3",
              "replies": []
            },
            {
              "text": "maybe their father is a high ranking inspector and get paid very well",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "Most of the Police officer dishonest in Bangladesh.",
          "votes": "2",
          "replies": []
        },
        {
          "text": "really??????????????",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "“how can a police officer's salary support that”\nYou already know the answer to it. GUSH money.",
      "votes": "18",
      "replies": []
    },
    {
      "text": "Is his father a constable?",
      "votes": "2",
      "replies": [
        {
          "text": "Most likely cos they are living like plebs.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Ghush er tk arki bhai..",
      "votes": "2",
      "replies": []
    },
    {
      "text": "unlimited if they are dishonest, limited if they are true to their work.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "There can be many scenarios behind that\n*ghush *inherited wealth *allowances for vacation *other family members income\nBribe is only one explanation. We go straight to the negative explanations in anything involving money and govt. officials, but that’s not always the case.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "An asp (bcs cadre) around 40k starting, then 5% increment each year.\nSI around 30k.\nPlus ration.",
      "votes": "2",
      "replies": [
        {
          "text": "he is an \"Investigation Inspector\" (whatever that means). I dont think he takes bribe, he seem like a good guy. He even received the 'Police Force Exemplary Good Service Badge'",
          "votes": "1",
          "replies": [
            {
              "text": "If he is an inspector ( Investigation) and on top of that a senior one... His salary is nearly 65k per month depending on the city of his posting. And in addition to that, for each case they solve per month they get fees from govt. It's called investigation fees maybe. Also festival fees and per year vacation fee plus discount on vacation due to their kollyan trust something like that. So if a officer of his rank stays honest they can still afford good life and not to mention if he has generational wealth to begin with obviously they can live luxurious life. But that really depends on the individual as most of our police officers are known as corrupted.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "You're wrong to assume it's all about salary. In many cases, it's inheritance or family wealth. Even earnings up to 40–60k a month isn’t enough for most families to maintain a luxurious lifestyle. It almost always comes down to money that was already there long before the paycheck.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "what is his rank?",
      "votes": "1",
      "replies": [
        {
          "text": "I dont know, I will ask next time",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "I can confidently say their lifestyle is not just supported by his father’s salary and that should be obvious.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Inspector investigation means an inspector who does/leads the investigation of a thana. There's another inspector ops who is the OC. Either way, he either started as constable or ASI or SI which are non cadre career paths. Lifestyle doesn't conform to honest earnings unless he has a rich inheritance",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Under the table or above the table?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Dude it’s all GHUSH!",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 229
}