{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pfxzi9/%E0%A6%9F%E0%A6%AD_%E0%A6%9F%E0%A6%95%E0%A6%B6_%E0%A6%86%E0%A6%AE%E0%A6%A6%E0%A6%B0_%E0%A6%86%E0%A6%B0_%E0%A6%AC%E0%A6%B6_%E0%A6%85%E0%A6%B8%E0%A6%B9%E0%A6%A8%E0%A6%B6%E0%A6%B2_%E0%A6%95%E0%A6%B0_%E0%A6%A4%E0%A6%B2%E0%A6%9B_%E0%A6%95/",
  "hash": "f71487cb45f284708a1b8bf0c5cc6a38",
  "scraped_at": "2025-12-08T11:22:45.549796",
  "title": "টিভি টকশো আমাদের আরো বেশি অসহনশীল করে তুলছে কি ?",
  "description": "অধুনা এক ব্যারিস্টার কে দেখা যাচ্ছে তিনি বেশ কয়েক দিস্তা কাগজ হাতে করে বিভিন্ন টক শো তে হাজির হচ্ছেন খুব বেশি কৌশল না করে বিভিন্ন টেক্সট দেখিয়ে উনি বিতর্কিত করতে চাচ্ছেন মুক্তিযুদ্ধ এবং পরবর্তী শেখ মুজিবের অবদান কে ,কিছুদিন আগে থেকে এবি পার্টির আরেক ব্যারিস্টার সেটা বেশ অবলীলায় করছিলেন , আর দুইজন কে ঠেকিয়ে রাখছেন আরেকজন ডাক্তার ও মিডিয়া ব্যক্তিত্ব । এই তিনজনকেই আমার সন্দেহ হচ্ছে এরা সম্ভবত সবাই এক পক্ষের ই লোক । তাঁরা ইচ্ছাকৃত একটা বিতর্ক তুলে আমাদের মগজের ধোলাই প্রক্রিয়া সম্পন্ন করতেছেন । কয়েকদিন থেকে তারেক কে দেখা যাচ্ছে বেশ সরব পার্টির নিবন্ধন পাবার আশ্বাসে উনি সম্ভবত কাউকে আর তোয়াক্কা করছেন না । এরা সবাই মিলে বিভিন্ন পক্ষের মানুষকে প্রায় একই রকম বিনোদন দিয়ে খানিকটা শক থেরাপি দিচ্ছেন বলে মনে হচ্ছে , তারেক, তুষার এর প্রগলভতা দেখে লীগ পন্থী লোকের হাততালি ওদিকে দুই বারিস্টারের কোর্ট রুম তর্ক দেখে জামাতি হাততালি বেশ ভালোই কুড়োচ্ছেন। টিভির ইউটিউব চ্যানেল গুলোও ভিউ কামাচ্ছে দেদারছে ।\nআমাদের মিডিয়া কখনোই দায়িত্বশীল ছিল না , কিন্তু এখন এদের টক শো এর প্যাটার্ন গুলো দেখে কেন যেন সন্দেহ হচ্ছে বিভিন্ন চ্যানেলে এবং পত্রিকার এই টক শো কোন একটা নির্দিষ্ট জায়গা থেকে সমন্বয় হচ্ছে , এবং সবাই মিলে আমদের দুই দলে ভাগ করে ফেলার একটা ষড়যন্ত্র চলছে এই মিডিয়া কে ব্যবহার করে । এখন আমি কি একাই ওভার্থিঙ্কিং করছি ? নাকি অন্য কেউ ও কিছু একটা সন্দেহ করছেন ?",
  "votes": "12",
  "comments": [
    {
      "text": "Seems too far-fetched of a theory. But the truth is that our media was never very responsible. They care about views. Drama, heated exchanges, and clickbait stuff gives them just that.\nI don't think the people you mentioned are on the same side and are deliberately staging this. It's probably just that the media and talk shows often attempt to create a setting that incites drama and controversy.\nIs that making us more intolerant? Maybe so. But surely not as much as social media and echo chambers.",
      "votes": "3",
      "replies": [
        {
          "text": "ডাক্তার তুষার কে সেই শুভেচ্ছা ম্যাগাজিন থেকে চিনি ,যথেষ্ট ভদ্র এবং দরদী কন্ঠস্বর কিন্তু এই চরম ভদ্র লোকটাকে আমার সব সময় কেন জানি মনে হয়েছে উনার ভেতরে কিছু একটা লুকিয়ে রাখছেন , উনি দারুন তার্কিক কিন্তু সব সময় মুক্তিযুদ্ধের প্রসঙ্গ আসলেই কেমন যেন নিজেকে গুটিয়ে নেন মনে হয় কোন পক্ষ কে প্রচ্ছন্ন ভাবে খুশি করার চেষ্টা উনার আছে । এইসব দেখে এত বিবমিষা লাগে , মিডিয়া ও উনাদের নিয়ে এসে ক্লিক বেইট বাণিজ্যে ব্যস্ত সব মিলিয়ে বেশ সন্দেহ জনক পরিস্থিতিতে বাস করতে অসহ্য লাগে ।",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "He is simply a bastard.",
      "votes": "1",
      "replies": [
        {
          "text": "আসলেই তাঁর মুচকি মুচকি হাঁসি সহযোগে অর্ধ সত্যের উকালতী কায়দায় উপস্থাপন দেখলে খানিকটা গা জ্বলে বৈকি, আমারও তাঁকে নধর *য়োর ছানা বলতে ইচ্ছে হয় ।",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Bangladesh has always had anti-liberation & pro-liberation. Class will be continued. And you can't avoid while you didn't study, just believe on Jamatese and Pakistani narrative. Don't forget. Jamat's head quarter is Lahore.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "ফেইসবুক***",
      "votes": "0",
      "replies": [
        {
          "text": "ঐটা তো নেগেটিভ খবরের আখড়া , যত নেগেটিভ তত ভিউ ।",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-7",
      "replies": [
        {
          "text": "আপনার নেতায় ৫ টা কথা বললে তার ৬ টাই হয় মিথ্যা। এই যেমন বললো শেখ মুজিব ১৯৫৭ সালে ভারতের সাথে মিলে আওয়ামী মুসলিম লীগকে আওয়ামী লীগ করে যেটা ডাহা মিথ্যা, ওটা করেছে মাওলানা ভাসানী। তারপর বললো ১৯৬৩ তে হোসেন শহীদ সোহরাওয়ার্দী মারা যাওয়ার পর অবৈধভাবে আওয়ামী লীগের সভাপতি হয়, যেটা আরেক মিথ্যা, তখন সভাপতি হয় মাওলানা তর্কবাগীশ, যৌথ সাধারণ সম্পাদক হয় শেখ মুজিব আর আবুল মনসুর আহমেদ (ডেইলি স্টারের মাহফুজ আনামের বাপ) -- এরকম ১৫-২০ টা ডাহা মিথ্যা উনি প্রতিটা অনুষ্ঠানেই বলেন।",
          "votes": "5",
          "replies": [
            {
              "text": "Jamatese became mad during December and March. They use false narratives for proving they were right.",
              "votes": "6",
              "replies": []
            }
          ]
        },
        {
          "text": "না উনি প্রকৃত সত্য তুলে ধরছেন না ,উনি অর্ধ সত্য তুলে ধরছেন জামাতি ন্যারেটিভ প্রচারের স্বার্থে । এ সেই পুরনো খেলা আমরা ছেলেবেলায় জামায়াত বি এন পি কে খেলতে দেখেছি এমনকি উনার প্রতিটি আর্গুমেন্ট আমার জানা ছেলেবেলায় তখন ফেসবুক ছিল না কিন্তু চায়ের আড্ডায় বড় রা এইগুলো নিয়ে কথা বলতো। বিনিময়ে আবার লীগ ক্ষমতায় আসলে খালেদার মদ্যপানের ছবি দিয়ে পোস্টার হতো । এই লোকের আচরণ আমাকে স্মৃতি ভারাতুর করে পিছিয়ে নিয়ে যায় মনে হয় যেন আমরা এক লাফে ত্রিশ বছর পিছে চলে গেছি ।",
          "votes": "4",
          "replies": []
        },
        {
          "text": "He lies with a straight face with a Barrister title. For example, Shariar had said Mujib family stayed in dhanmondi for enterity of the war. Which was false. Given mujib was in jail and his two sons escaped and joines the war. kamal was the first batch of war commission and Osmanis AdC. And hasina was pregnant. So who is left that had not joined?\nThe problem is his fans want shahriar's bullshit to be true.",
          "votes": "1",
          "replies": [
            {
              "text": "First of all he didn't say every single family member stayed in Dhanmondi. Sheikh Kamal ran away and eventually went to Indira Gandi and then for \"war\" training. By the the time he was \"ready\" the war was over.",
              "votes": "-1",
              "replies": []
            }
          ]
        },
        {
          "text": "আপনার কি একটুও লজ্জা শরম নাই ষাঁড়? আপনারে ঠাইসা ধরলে একটা কথাও ডিফেন্ড করতে পারেন না। হুদাই আসছেন বিজয়ের মাসে রাজাকার ন্যারেটিভ ছড়াইতে।\nএই যে লন আপনার সো-কল্ড ব্যারিস্টার যার কথা মতে জামাত ১৯৭১ সালে ভারতীয় আধিপত্যর বিপক্ষে লড়াই করতে গিয়ে পাকিস্তানের গণহত্যার পক্ষে ছিল এবং ঠিক ছিল। কয়ডা বই দেখাইয়া ফটর ফটর করলেই মিথ্যা সত্যি হইয়া যায় না।\nদ্বিচারিতা দেখতেছি তো। শেখ মুজিব, যার নামে স্বাধীনতা যুদ্ধ করলো মানুষ। উনাকে বাকশাল এবং ৭১ পরবর্তী অপশাসনের জন্য বঙ্গবল্টু বলবেন, আর তাই উনার বয়ান নিবেন না। আচ্ছা ভালো কথা। কিন্তু এক নর্দমার কীট রাজাকারের নাকি কাছের আত্মীয় মুক্তিযোদ্ধা এবং কিছু শহীদও হয়েছেন, তাই উনার সব কথাই পরম সত্য বইলা ধইরা নিবেন। মজা না?\nএই রকম বেহায়া আর দেখি নাই। একটা মানুষের ন্যূনতম একটু লজ্জা আর ন্যায়পরায়ণতা তো থাকবে নাকি?",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-8",
      "replies": [
        {
          "text": "সত্য ইতিহাস আমরা তো সবাই জানতে চাই ,কিন্তু উনারা তো অর্ধ ইতিহাস বয়ান করছেন । ভারত বিরোধিতার যে পাকিস্তানি রাজনীতি দুই ব্যারিস্টার একেবারে হুবহু নকল করছেন ,নিজের ন্যারেটিভ প্রতিষ্ঠার স্বার্থে ভারত বিরোধিতার প্রয়োজনে উনাদের বয়ান ইতিহাস নয় বরং নগ্ন পাকিস্তানি প্রপাগান্ডার হুবহু নকল হচ্ছে । আর মুক্তিযুদ্ধের পক্ষের পক্ষ যাঁরা সাজছেন তাঁদের ও যথেষ্ট নৈতিক মনে হচ্ছে না ,সব মিলিয়ে এক ব্রেইন ওয়াশ প্রজেক্ট এর কথায় মনে দিচ্ছে বারেবার তাঁদের এইসব আচরণ ।",
          "votes": "5",
          "replies": []
        },
        {
          "text": "When you hear anything about 1971 from Jamatese, that is definitely false. If you combine all of their narratives then you can find they are taking different contradictory positions.",
          "votes": "4",
          "replies": [
            {
              "text": "So, I have to learn Muktijuddho from BALs, who've used the Muktijuddho as their political symbol and sold the sovereignty of Bangladesh in the name of Muktijuddho!!\nNo, I didn't learn about 1971 from any of them. Jamat opposed Muktijuddho in 1971, as well as BAL has been selling Muktijuddho after 1971 till today.",
              "votes": "0",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Its the other way around.\nBecause there is too much drama in politics, talk-shows amplify them to attract viewers.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 24
}