{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p2nn9y/why_can_indians_have_an_opinion_but_we_cant/",
  "hash": "ea0f3d847c3bfe8b7c4d4fa5e51e148d",
  "scraped_at": "2025-12-08T12:24:35.293732",
  "title": "Why Can Indians have an opinion, But We Can’t?",
  "description": "A few days ago, someone posted about how beautiful Tangila looked, noting that many were even comparing her to a Hindu goddess, while also noting that many Bangladeshis were uncomfortable with her attire. For simply sharing that view, the poster was mocked and labelled as “Bengali hujur.”\nNow, Indians are making the same kind of comments and belittling us openly on the internet, yet everyone seems quiet. That double standard really speaks volumes about how we treat our own people versus how we react when outsiders say the same thing.",
  "votes": "153",
  "comments": [
    {
      "text": "Jamdani originated from Dhaka. It's records are in English, Dutch, Turkish, Japanese memoirs, trade records.\nIt's the most Bangladeshi thing ever.",
      "votes": "165",
      "replies": []
    },
    {
      "text": "That's why the whole of South Asian community hates them. I was seeing this Pakistani guy making Pakistani food and the comment section was full of Indians screaming oh it's not Pakistani food, it's Indian food, stop claiming our culture etc. There was also this incident of Indians saying that Nepal was a part of India under British rule when they were never even colonised.",
      "votes": "157",
      "replies": [
        {
          "text": "They're very similar to Zionists.",
          "votes": "62",
          "replies": []
        },
        {
          "text": "if a romanian claimed greek heritage by waving a european nationalism flag, everyone in europe would laugh. yet, the same thing in the subcontinent is done bhery paraoudly.\nIndian nationalists/hindutvadis cant differentiate the commonsense nuance that their 80 y/o nation-state republic-of-india does not own the racial/cultural/continental India that existed before the british raj.\ntrying to claim Nepal by pointing at the british with a LIE might seem like the craziest thing theyve ever done, but trust me its not even tip of the iceberg to all their insane seething semantics that i've read.",
          "votes": "45",
          "replies": []
        }
      ]
    },
    {
      "text": "One similarity between Hindutvavadis and Islamists is that they both think everything about Bengali culture belongs only to HIndus and that Muslims should larp as arab sheikhs.",
      "votes": "84",
      "replies": [
        {
          "text": "Well said",
          "votes": "10",
          "replies": []
        }
      ]
    },
    {
      "text": "Indians call the people racist when they face hatred but when they spread hatred, it's \"justified\". Pure victim mentality.\nOne of the most hated countries in the world for a reason",
      "votes": "82",
      "replies": []
    },
    {
      "text": "Indians trying not to claim every cultural and historical thing in south Asia challenge: impossible",
      "votes": "44",
      "replies": [
        {
          "text": "okkhondo vodai \"\"\"gono\"\"\"rajjo 🇳🇪🇳🇪🇳🇪🇳🇪🇳🇪🇳🇪 🔱🔱🔱🔱🔱🔱",
          "votes": "11",
          "replies": [
            {
              "text": "That's not too far from what Indians believe Look this is their empire Apparently the world biggest empire The VikramAditiya empire that\nThey literally claiming pala and Gupta empire as if they were Indian",
              "votes": "4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "It's ok if it looks Hindu. Hindu people are also Bangladeshi people and therefore Hindu culture is also local culture. We have temples in all our major cities and districts.",
      "votes": "24",
      "replies": []
    },
    {
      "text": "Pakistan stepped on the Bengalis, and we know what happened. Let India try to install dictators and harbour them. No amount of disinformation will save them.\nAt this point, they have destroyed their image internationally as well as in their neighbourhood.\nThe only people they are getting closer to are the Taliban and Israelis. I think that speaks volumes about their standing.",
      "votes": "19",
      "replies": [
        {
          "text": "Fundamentalists seek fundamentalists...",
          "votes": "5",
          "replies": []
        },
        {
          "text": "Wait. What did I miss here? What do you mean the Indian government is getting close to the Taliban? Please expand.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "I've often found that those who have a lot to say tend to be ones who speak the most nonsense. India is a country of literate but uneducated people whose prime belief is that they are superior than the rest. They discount the fact that they have studied under an agenda and just because they speak English somewhat well, they can have an opinion (often biased) about EVERYTHING & EVERYONE.\nMost importantly, they believe they are the \"baap\" of South Asia and hence every cultural aspect of ours is theirs to begin with. They need to conquer & claim as their own- almost as if India wants for colonize us- as a means to remain superior.\nHer dress does have Hindu elements but that doesn't mean that India gets to take credit for it. It was created by artisans from Bangladesh....the shapla is our national flower...and Hinduism is one of our religions. And these claims that Hindus are being targeted in India....i truly want an accounting of it.....where are the Hindus in this sub or any other BDeshi forum.....why aren't our journalists talking about this oppression? Why is it that only India knows there's an oppression of Hindus going on in Bdesh?",
      "votes": "13",
      "replies": []
    },
    {
      "text": "Half of their country has been brainwashed by BJP/RSS IT cell propaganda, even many smart people have become Muslim-hating bigots, thanks to what their Godi media has done.",
      "votes": "10",
      "replies": []
    },
    {
      "text": "I can't rly stand indians. Even in real life, they are this arrogant. Some audacity.",
      "votes": "32",
      "replies": []
    },
    {
      "text": null,
      "votes": "17",
      "replies": []
    },
    {
      "text": "These are desperate illiterate idiots which make up a small percentage of India. This coupled with social media algorathims pushing it as it creates more engagement results in those dumb people getting a sense of strength and further echoing these horrific mindset to more and more gullible people.\nIts honestly a shit show and us humans are just designed to end up like this. No matter how many times you repeat history, we as humans will gravitate towards this outcome naturally.\nIts suffocating to watch mass divide being encouraged by the system while shaping artificial narratives.\nRemember, not many but a loud few.",
      "votes": "16",
      "replies": []
    },
    {
      "text": "We don't spend as much time on the internet trying to shove propaganda down other people's throats. Sad part is, for all their efforts, it really has no impact on the real world. It's desperation on their part.\nWe can have an opinion, we just have actual lives to live, unlike them. No one cares about Indian propaganda, especially in the west where they have literally got on everyone's bad side. Their love for trump has been reduced significantly in the past year.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Duality is in our moderate muslims. When fundamentalist muslims bash the Pahela Baishakh rally for showcasing Hindu culture and openly say it doesn't belong to Islamic culture and manipulate our general people, they don't speak up. When those fundamentalists talk against inclusivity and non-Muslim culture, you don't speak up. Then you feel proud of being muslims. Now when someone representing your country wears obviously Hindu culture-inspired attire, the same fundamentalists talk ill about it, and now when these ragebaiting comments are coming from India instead of reflecting on your own hypocrisy you are just ignoring your incapabilities.\nWith this Islamic superiority mentality and lack of inclusivity, Bengali muslims will always suffer from their existential identity.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Kichudin por bolbe, ora exist ken kore, oder existence amader jonno.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "A few days ago, someone posted about how beautiful Tangila looked, noting that many were even comparing her to a Hindu goddess, while also noting that many Bangladeshis were uncomfortable with her attire. For simply sharing that view, the poster was mocked and labelled as “Bengali hujur.”\nBecause here's the thing you don't understand. You decide to ignore the obvious fact that Jamaati Mollas and Hindutvas are united in propagating the idea that every single aspect of Bengali culture belongs to Hindutva, you ignore that and instead focus on advancing the narrative of calling her \"Hindu\" and \"being uncomfortable with attire\" because \"outsiders are saying the same thing why are you angry when I do it?\"\nYou don't have the intellectual capacity to understand the reason Indian HIndutvavadis are doing this is that the idea of Hindutva is inherently fascistic and imperialistic, they want to claim every single aspect of our culture - look at how they are claiming Jamdani Saree. They want to claim this to advance the idea of Akhand Bharat.\nAnd people like you - along with Jamaati Mollahs are strangely OK with propagating and/or advancing the idea that everything about Bengali culture should only belong to HIndus and Muslims have no stake in it. If you think this is \"revealing\" you should look into what your ancestors wore before Thakurbari popularized petticoats.",
      "votes": "13",
      "replies": [
        {
          "text": "Yep, amader desh e even India conspiracy theorist gula bole nah Mullah gulo CIA funded. I am more inclined to believe they are in the same group as Hindutva, so much of thier talking points that Bengali culture should only be celebrated by Hindus are so fucking similar it's unrealistic to not believe they walk hand to hand.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "I'm going to ignore the blatant self-projection, jealousy, muslim-hatred and these hypocrites' shameless systematic target propaganda which they do in reality to their own minorities and lower classes *systematically* like its a daily ritual, and get to the meat of the neurosis:\nhindutva and hindudtva-adjacent indians can never separate culture and faith the way Bengalis have been doing for a thousand years. the hindu-theology ironically shares this imperialistic trait with the abrahamic, which is doubly ironic because hindustan(persian word) has so much foreign cultural imports in their daily lives starting from language to the under garments they wear but they will only get mad with hostility towards muslims and Bangladesh when we wear what is ours by the way of our history. why bother engaging with a tribalist people who cant grasp the basic cognition that culture is ever evolving, migrating, merging and not eternally a static property of any religion or its head priests? thats the same as arguing with a yeehadist about basic form of humanity.\nnotice how their delusional lie-filled muslimphobia is expressed hypocritically by a colonizer's language? but their enemy is Bangladesh.\nA few days ago, someone posted about how beautiful Tangila looked, noting that many were even comparing her to a Hindu goddess, while also noting that many Bangladeshis were uncomfortable with her attire.\nNow, Indians are making the same kind of comments and belittling us openly on the internet,\ntheir is a reason for this two-facedness. their hostility and hatred is deeply rooted in two parallels: 1) we have a sovereign nation and national identity rooted in our actual native region and ethnolinguistic identity and not based in broad subcontinental india, hindian nationalists do not like this unyielding dent in \"their\" empire one bit, everytime they see/draw their map, they have to see/draw the map of বাংলাদেশ 2) majority of us left orthodox brahmanism in flocks and became buddhists and later muslims, the othering tribalism of hinduism is very well-documented in depth on a subcontinental level.\ni dont know if Ma Saraswati wore jamdani sarees, even if something as simple and vague like white saree and flower shapes represent her; rejecting a faith/theology doesnt not mean we are obligated to rip-off our native skin, maybe a lot of us left because they couldnt understand this common sense nuance. Bengali culture derived from animist/hindu/buddhist/sufi/mughal/muslim/portuguese/santali/tibetan/burman culture are all a part of our legacy, the indian nationality or the hindu theology does not own any of what went down in my native motherland through my foremothers. this is why i say to ignore paraoud indian nationalists and hindutvadis like the bubonic plague. its a pointless doomed-if-you-do, doomed-if-you-dont war fought on shallow grounds by zealous cultural imperialists eternally drowning in meaningless semantics.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "no wonder why everyone hates indians",
      "votes": "4",
      "replies": [
        {
          "text": "Because they have to provide opinions in our matters at all times. Try to fix your own country and then come for us and that is also if we want and with our permission. If their opinion matters so will be ours.\nAnd above all we don't have time for this shit anyway...",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "They think by breaking Pakistan into two,they did us a favour. Now that their puppet and her gangs are caught, they are crazy right now.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Ban all Indians from the internet like holy shit",
      "votes": "8",
      "replies": [
        {
          "text": "How to ban 1/5 of the world population?? 😂😅",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Just give these guys one of these:",
      "votes": "2",
      "replies": []
    },
    {
      "text": "She should have use zamdani with bangla culture. Now Indian going to claim it as theirs",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Indians on internet: 90% time spent insulting neighbours, 10% time spent wondering why neighbours hate them.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "this forum has extreme pro-India mods that delete posts that are genuinely critical of India or criticize extremely vile indian subreddits. We don't need Indians to sabotage Bangladesh. Bangladeshis will do that for Indians themselves.",
      "votes": "4",
      "replies": [
        {
          "text": "The same mods literally run an anti india page r/chekulars but go off with your unverified biases on an anti-india post. This is r/bangladesh, not r/iHateIndiaHearMeSqueak. Our job is to keep things relevant, not kiss our users' booboos and coddle them over personal problems. Interesting that in your 5 year tenure this is your only contribution to r/bangladesh.",
          "votes": "8",
          "replies": []
        }
      ]
    }
  ],
  "id": 241
}