{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p24gol/july_uprisings_iconic_saluting_rickshawpuller/",
  "hash": "62c24a2392694a5713e0fb47c8b206e3",
  "scraped_at": "2025-12-08T12:26:15.203294",
  "title": "July Uprising's iconic 'saluting rickshaw-puller' Sujon collects NCP nomination form from Dhaka-8",
  "description": null,
  "votes": "64",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Yh he may not be corrupt but he will be easy to manipulate by the top dogs",
      "votes": "18",
      "replies": [
        {
          "text": "Most of the rickshaw pullers are corrupt af. ektu brishti porle 20 tk vara 50 tk kore dey and u expecting them to run a country? Idk why everyone celebrating this sh*t.",
          "votes": "7",
          "replies": []
        }
      ]
    },
    {
      "text": "সেলুট দিচ্ছে তাহলে ওকে এমপি বানানো দরকার",
      "votes": "41",
      "replies": [
        {
          "text": "literally how we've been operating forever. easily explains all the incompetence and corruption",
          "votes": "19",
          "replies": []
        }
      ]
    },
    {
      "text": "This is like hiring a plumber to fix your car's flat tire.",
      "votes": "17",
      "replies": [
        {
          "text": "Going by the last 54 years we seems to be \"voting\"/accepting plumbers for our cars",
          "votes": "6",
          "replies": []
        },
        {
          "text": "Becoming an MP doesn’t require formal qualifications or technical training. Anyone should be able to run so voters can choose who best represents them",
          "votes": "6",
          "replies": []
        },
        {
          "text": "Our leaders have set the bar so low that I am sure this will be a step up\nAn uneducated hard working man will be less corrupt than an educated career politician",
          "votes": "5",
          "replies": [
            {
              "text": "True",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "In the end it's symbolic since the competing 2 candidates are heavy weight Mirza Abbas from BNP and Osman Hadi as independent.\nStill this is a great sentiment from NCP, even a rickshaw puller can be a part of government, that is the dream.",
      "votes": "17",
      "replies": [
        {
          "text": "Exactly. He will not win, but the reactions to this story are already exposing how deeply elitist so many people in BD online forums are",
          "votes": "9",
          "replies": []
        }
      ]
    },
    {
      "text": "What the fuck?",
      "votes": "9",
      "replies": []
    },
    {
      "text": "I think you guys have no knowledge about our neighboring country India is run by a former Cha Wala from last decade.\nHere he is just an option for you to vote or reject. But some braindead people are screaming Quota, Medha, unqualified, bla bla as if these things are relevant!",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Better than so called educated ones",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Hope more people from lower economic class backgrounds are able to run in elections. Politics shouldn’t be a game of who has more money, and too many people in BD want to gatekeep politics from anyone who doesn’t come from that money.",
      "votes": "6",
      "replies": [
        {
          "text": "The person running for election should be also competent. I don’t see how he is.",
          "votes": "6",
          "replies": [
            {
              "text": "he knows more about the ground reality than most other politicians",
              "votes": "4",
              "replies": []
            },
            {
              "text": "If you think he’s not competent, then just don’t vote for him. The role doesn’t require special qualifications and anyone can run. And aren’t you in the UK anyway? so I doubt you even vote in this lol",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "It's still traditional way banking on Popularism instead of ability",
      "votes": "5",
      "replies": []
    },
    {
      "text": "bnp er mirja abbash o candidate dhaka-8 er",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "2",
      "replies": []
    },
    {
      "text": "এক স্যালুটে পার্লামেন্ট??? কয়দিন পর বলবে আমার গ্রামের সবচেয়ে বড় ঘরটা আমার। জমির হিসাব দেবে একরে। ইনকি লাভ জিন্দাবাদ।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Major improvement over a common thug like mirza abbas, elites of this country won't like it though. All they want is the status quo of their right to steal and launder.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Hayre khoda BD te je jai koruk finally politician howa lagbe.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "All these years of trolling that bastard of \"অশিক্ষিত চা ওয়ালা\" for being PM, now we'll face this. Top notch comedy!!",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Quota na Medha?",
      "votes": "1",
      "replies": [
        {
          "text": "Vote",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Loved it!",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Read more: https://www.tbsnews.net/bangladesh/politics/july-uprisings-iconic-saluting-rickshaw-puller-sujon-collects-ncp-nomination",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Dang",
      "votes": "0",
      "replies": []
    },
    {
      "text": "This is purely idiotic. He was symbol of resistance for us all but it wouldn’t be from now on. Awami League, despite of their all devilishness, never used 'Nur Hossain' as former Chattra League leader.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "😂😂😂😂😂😂",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "0",
      "replies": []
    }
  ],
  "id": 247
}