{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p23oio/ifarmer_is_it_good_or_scam/",
  "hash": "c160457675ba2efa07c9c7c846db888f",
  "scraped_at": "2025-12-08T12:26:35.600392",
  "title": "iFarmer. Is it good or scam?",
  "description": "I have been investing in iFarmer for quite some time now. Always got repayment on time. Till now no single hickup.\nEven after this, I still don't understand how they maintain this. Like where is the margin after providing 18% to the investor, then profit to the farmers? While calling the entire thing a ponzi scheme would have made sense, but till now the way they are providing interests, things look smooth.\nOne problem that I see is there is no financial audit report shared by them which has always felt like a flag.\nWhat are your thoughts about iFarmer? Please share your experience, or maybe anything that you might know regarding them which can help clear things out. Also share your thoughts. Thanks.",
  "votes": "14",
  "comments": [
    {
      "text": "One problem that I see is there is no financial audit report shared by them which has always felt like a flag.\nThis is the biggest problem what a lot of folks here don't understand. Without an audited financial report, it is really hard to understand how things are going at their end. They might be just another Evaly running ponzi scheme.\nPersonally I would never invest in such companies.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "The 18% is not annual, it is usually for longer terms. Workout on the annual returns and you can see it’s not that exaggerated as banks gives up to 10%, you’ll probably get a little more + there is some risks.",
      "votes": "3",
      "replies": [
        {
          "text": "Umm nope. Nearly all of their firms give 18% annual returns\nExample: 6% for 4 months, 4.5% for 3 months etc. This is how they offer them.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "May be you can get some of your answers here from their last year's impact report?\nhttps://ifarmer-website.s3.ap-southeast-1.amazonaws.com/impact-reports/6-iFarmer%20Impact%20Report%20-%202024.pdf",
      "votes": "2",
      "replies": [
        {
          "text": "Hi. Thank you for the info.\nI went through it all before as well. But failed to find anything related to their business finance (like the revenue, profit, PAT etc).",
          "votes": "1",
          "replies": [
            {
              "text": "That's a big red flag then.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I wanted to invest, but i could not find any credit report/auditing repot in their site or anywhere else. In this economy where even the local banks (except a few) seem hollowed out and scary reports are coming out, i would not invest in anything that's even mildly dubious. I even considered IDLC once, which has a better reputation, but not in this market. Putting all my money into a safe bank (BRAC, City and Dhaka are reliable from my research, EBL is good to but their paperwork requirement is absolutely obnoxious) for now till i see some economic stability. its not a good investment in the long run since interest rates aren't inflation friendly, but in this economy; i'd rather wait.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "They only insure the principal amount. The return is based on profit from the product you are investing on. They dont have any guarantees on the profit, you are taking the risk as an investor. It seems good but not entirely safe. Some bad years can wipe them out.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Even if it is safe, there are better ways to invest.",
      "votes": "-1",
      "replies": []
    },
    {
      "text": "So if I invest 1 lakh taka, I will get an interest of 18,000 taka per year?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "They pay more than conventional banks or nbfi. Just be aware of one thing, equity based and lending based crowdfunding platforms don't have a proper regulatory framework yet and its not regulated by BSEC or BB. In my opinion, its a high risk investment.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I tried to reach them seeking investment but didn’t hear anything back from them. I invested in my own village and after some time opened up my own farm. Some say ifarmer is good but i didn’t received any help from them",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 248
}