{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pfp6qf/my_mother_hates_my_girlfriend/",
  "hash": "187516467ff46329490ffc2bcdcbd4de",
  "scraped_at": "2025-12-08T11:24:34.715282",
  "title": "My mother hates my girlfriend",
  "description": "I need help, How do i make it permanent, and if possible win my mother's approval?\nHi, 18M, my gf 20F have been together for over half a year, its a short time but we grew so close, the understanding is at a level of a 3 year relationship because early on in the relationship we got to know about the worst thing bout one another and manged to grow past a lot of issues and are working on some more, but no obstacle seems big except my mother, She has always managed to get her way by gaslighting and manipulation, she has managed to control every part of my life, literally every part, how i dress, eat, talk, who i talk to, who my friends are everything.\nMIGHT BE NORMAL TO SOME EXTENT BUT, not when she literally screams at me publicly for speaking to a guy who failed a class. Obviously she didnt take it well when she got to know that i got a gf, and literally did the intervention scene with me along with my father and boy that was crazy, She brainwashed the entire family that i was being trapped and mislead, it got so bad that my aunts and uncles started confronting me on vacations and gatherings.\nShe saved my gf's number one her phone as 'm*g1', which btw she forced me to give to her and she also literally used her connections to try and dig up dirt on my girl, which failed miserably and she faked some bs about my girl being an \"unlicenced h0r3\" all fake btw and she cant stand the fact that i am with her and tries to sabotage it everyway possible\nShe literally brought an IT guy to \"hack\" my pc, which has no password btw because i got nothing to hide and went through my messages and cherry picked texts to reference in normal convos to feel powerful.",
  "votes": "90607",
  "comments": [
    {
      "text": "What the fuck",
      "votes": null,
      "replies": [
        {
          "text": "What the fuck (2)",
          "votes": null,
          "replies": [
            {
              "text": "What the fuck (3)",
              "votes": null,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Then take the stand. Tell her to not mind in your business and if you are the only child tell her you’d end your relationship with her. Also concentrate on your studies and once you are financially stable cut her off. Talk to your father perhaps? I wonder how your father is even in a marriage with a woman so disgraceful",
      "votes": null,
      "replies": []
    }
  ],
  "id": 31
}