{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pfl04q/bangladeshis_bjp_wins_in_2026_wb_state_elections/",
  "hash": "bb917e1614d53e61cf7514606abe6711",
  "scraped_at": "2025-12-08T11:25:21.727542",
  "title": "Bangladeshis, BJP wins in 2026 WB state elections , what do you do next ?",
  "description": "( asking as a bengali muslim from barackkpur )",
  "votes": "0",
  "comments": [
    {
      "text": "What is there anything for us to do? It's their country their wish so why would we care",
      "votes": "21",
      "replies": []
    },
    {
      "text": "Actually nothing. India is just used as populist rhetoric by right wing politicians.",
      "votes": "11",
      "replies": []
    },
    {
      "text": "মুড়ি খাব",
      "votes": "10",
      "replies": []
    },
    {
      "text": "Indians think our lives revolve around them. I get so many racist replies when I comment on anything Indian cricket related. I don't see many Bangladeshis make BS posts in r/India like OP.",
      "votes": "21",
      "replies": []
    },
    {
      "text": "What do you suggest we do?",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Could not give a shit.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Why should we even care?",
      "votes": "4",
      "replies": []
    },
    {
      "text": "What are we supposed to do though lmao",
      "votes": "3",
      "replies": []
    },
    {
      "text": "sleep and study so that my academic performance increase",
      "votes": "3",
      "replies": []
    },
    {
      "text": "বাংলাদেশীরা লুঙ্গি খুলে নাচবে।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Nothing, its not our issue. Unlike india, we don't poke into neighbouring countries internal affairs",
      "votes": "3",
      "replies": []
    },
    {
      "text": "We do not really care about your internal matters.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Well we don't have anything to here do we? My condolences but I dont think BJP will win that easily. West Bengal is not backwards like Bihar or UP so I highly doubt they'll be voting for BJP. Then again watching from here even Mamata doesn't look good for them. Quite a bad situation for them I must say",
      "votes": "1",
      "replies": []
    },
    {
      "text": "fkdc Modi. We don't give an F.\nAs long as there is no interference.",
      "votes": "-2",
      "replies": []
    },
    {
      "text": "Why are you Indians are obsessed with Bangladeshi internal politics? Have you seen Bangladeshi people are going there to poke their nose like you guys? BJP is already running your country, did that create any headache for us?",
      "votes": "-1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "চিপায় গিয়া মুড়ি খাইয়া মইরা যাবো",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Tmc, left or bjp all have pretty much the same from Bangladeshi point of view tbh",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 34
}