{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pfhkt1/the_sad_mislabel_of_our_71_liberation_war_being/",
  "hash": "9e175cac7309b9f25163345e31b51fbc",
  "scraped_at": "2025-12-08T11:25:39.938062",
  "title": "The sad mislabel of our 71 liberation war being IndoPak war in international academia",
  "description": "I wrote this intentionally in English, because I expect and welcome Indians to read this post and give their thoughts.\nIf you go through many international information archive majority describes the war as Indo-Pak, and makes the effort and sacrifice of our freedom fighters as a footnote. Also in that narrative the war was limited to Dec 3rd -Dec 16th.\nAnother major problem in international academic side is the genocide against us gets rarely mentioned while discussing genocides in the last century. This is most likely due to the inflated inaccurate number of 3M+. Because post independence there were proper survey, whatever came out Nations Daddy's mouth became gospel locally and international researchers couldn't take it seriously, especially when they knew patterns of genocide.\nI am sure some big brained people will talk all the western media reporting around 71 April-May they estimated already 1M deaths. How can they figure any number during active conflict without local information across the land in beyond me.\nThe Indian narrative on death count is actually insteresting. To be in line with the previous regime politically they parrot the 3M number as welk. But their own research and witness when pressed from international side, they settled into ~300K. Now why would they mention a lower number?Because they want to be more accurate to be credible (Although quality of their media and general info in recent times went down the drain).",
  "votes": "90607",
  "comments": [
    {
      "text": "1971 was fought on two fronts — East and West. Pakistan launched its attack on India on December 3rd, striking targets near Delhi from the western front. That forced India into two simultaneous wars: the Indo-Pakistan War and Bangladesh’s Liberation War. The Liberation War ended with Pakistan’s surrender on December 16th. But the Indo-Pakistan conflict never truly ended — it simply froze under a ceasefire that still holds today.",
      "votes": null,
      "replies": [
        {
          "text": "Bhai. OP knows all of this. He is just doing the mandatory december, 'ye azadi jhuta haey' exercise.",
          "votes": null,
          "replies": []
        },
        {
          "text": "",
          "votes": null,
          "replies": [
            {
              "text": "Pak army surrendered to BDindia joint forces. We were under joint commamd of jagheet singh arora.\nAlso We werent signatory to geneva convention and not a recognised state. Pakis arent that dumb to surrender only to us.\nThe surrender documents have three copies. Each copy in each state. If you believe India has the only copy, you believe in FB conspiracy theory",
              "votes": null,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Indo pak war and bangladesh liberation are not the same thing.\nIndo pak war covers a broader front. Bangladesh liberation is a part of it. So when the discussion is about India it's Indo pak war. Not Bangladesh liberation war. While the events coincide at a later date the origin of both is different.",
      "votes": null,
      "replies": []
    },
    {
      "text": ">Muktibahini was trained by BSF, Indian army generals like Shahbeg Singh were charged from training to missions.\n>War was formally triggered by Pakistan launching pre emptive air raids. Indira Gandhi was giving speech at that time, she came to Delhi and announced war.\n>India fought on two fronts, capturing Chachro in Sindh, Turtuk in Kashmir and Dhaka in East theatre. Former two become part of India.\n>India took the international pressure and everything thrown at it. It saw ridiculous levels of inflation to cover costs of Bangladeshi refugees and Pakistani PoWs. No one talks about 10 million refugees we hosted.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Our East Bengal regiments gets even less focus comparing to Mukti/\nAre you retarded? The higher ups of the EBR became the commanding forces of the Mukti Bahini. This is recoreded history.\nMukti Bahini at large is a term for all the forces of the liberation war, that includes EBR and the all the guerilla forces.\nAre you a jolpai bootlicker that you want to overinflate their contribution by separating them from the Mukti Bahini altogether?\nJolpais got enough recognition, so much so that many guerillas did not get Bir awards(even tho there were supposed to) to favour Jolpais. We polished their ego enough.",
      "votes": null,
      "replies": [
        {
          "text": "Are you retarded?\nNot retarded. Just a Jamaati Propagandist.",
          "votes": null,
          "replies": [
            {
              "text": "বিজয়য়ের মাসে রাজাকারদের রাজাকারই বলি না হয়?",
              "votes": null,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Like it or not, if India didn't get into the war and blockade the Pakistanis could have kept up the occupation for months at the very least. Our freedom fighters weren't equipped to liberate the country, for the most part they could only launch raids and retreat when Pak reinforcement arrived.",
      "votes": null,
      "replies": []
    },
    {
      "text": "The liberation war falls under indo-pak war not other way around",
      "votes": null,
      "replies": []
    },
    {
      "text": "meanwhile OP:",
      "votes": null,
      "replies": [
        {
          "text": "",
          "votes": null,
          "replies": [
            {
              "text": "Aha 'azadi'.\nYe azadijhutahaey.",
              "votes": null,
              "replies": []
            },
            {
              "text": "Maybe OP is Indian. /s",
              "votes": null,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "রাজাকার আল বদর হুশিয়ার সাবধান\n২৪ এর রাজাকার পিন্ডি তোর বাপ দাদার\nআল বদরের ছানা কাবুল হবে ঠিকানা\nপিনাকির বাচ্চা, তোর পোস্ট যখনই দেখব এই স্লোগান দিব",
      "votes": null,
      "replies": []
    },
    {
      "text": "UN report (15 July - 15 August): 1400\nJuly \"Revolutionary\" Alliance: 1900\nGovt Gazette: 830 (-100 from investigative reports)\nHow can we cry and wallow about thousands of dead in July? How is it possible to unalive 1500 people in just 10 days?",
      "votes": null,
      "replies": [
        {
          "text": "830 is identifiable deaths, and there were deaths from injuries after 15th August as well.\nRegardless, those numbers are not far from each other. 300K versus 3M is a ten fold difference.",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "I am curious about the death toll, cia report/british report/india's own intelligence report all of them cite a number below 1m(350/800)k. Which is still astronomically high.\nFeel free to cite any source on a different number. From an Indian perspective this was a pak/india war, not sure why people get upset over this.\nFrom our pov things would be different, as it was.",
      "votes": null,
      "replies": []
    }
  ],
  "id": 35
}