{
  "url": "https://www.reddit.com/r/bangladesh/comments/1permdr/%E0%A6%9C%E0%A6%AC%E0%A6%A8_%E0%A6%A5%E0%A6%95_%E0%A6%A8%E0%A7%9F_%E0%A6%95%E0%A6%A8_%E0%A6%B8%E0%A6%B0%E0%A6%95%E0%A6%B0_%E0%A6%AA%E0%A6%B0%E0%A6%AC%E0%A6%B0%E0%A6%A4%E0%A6%A8_%E0%A6%B9%E0%A6%B2%E0%A6%93_%E0%A6%AC%E0%A6%B2%E0%A6%A6%E0%A6%B6%E0%A6%B0_%E0%A6%95%E0%A6%A8_%E0%A6%AA%E0%A6%B0%E0%A6%AC%E0%A6%B0%E0%A6%A4%E0%A6%A8_%E0%A6%B9%E0%A6%AC_%E0%A6%A8/",
  "hash": "973f286a6126ab0f8970aadc8132716a",
  "scraped_at": "2025-12-08T11:27:15.549662",
  "title": "[জীবন থেকে নেয়া] কেন সরকার পরিবর্তন হলেও বাংলাদেশের কোন পরিবর্তন হবে না",
  "description": "ইতালির ভেনিস ঘোরার পর খাওয়া-দাওয়া করতে গিয়েছিলাম মেস্ট্রে-তে, এক বাংলাদেশি রেস্তোরায়, মালিক ইতালিয়ান পাসপোর্টধারী এক বাংলাদেশি। কথার ফাঁকে জানালেন, উনি ওনার তিন আত্মীয়কে ইতালি নিয়ে আসছেন - জনপ্রতি মাত্র ৩৫ লাখ টাকা করে মোট ১ কোটি ৫ লাখ টাকায়। এর ভিতর ওনার খরচ ১০-১৫ লাখ টাকা। আসলে ইতালিয়ান সরকারকে উনি দেখাচ্ছেন যে, এই তিনজন ওনার রেস্তোরায় কাজ করার জন্যে আসছেন। আসলে তারা এখানে কাজ করবে না। ইতালি আসার পর তাদেরকে নিজেদের কাজ নিজেদের খুঁজে নিতে হবে। ওনার দায়িত্ব জাস্ট \"রেসিডেন্স পার্মিট\" করা পর্যন্ত। কিন্তু কাগজে কলমে যেহেতু ঐ তিনজন ওনার দোকানের কর্মচারী থাকবে প্রথম কয়েকমাস, তাই তাদের তরফ থেকে সরকারকে যে ট্যাক্স পে করতে হবে, তা পে করতেই ঐ ১০-১৫ লাখ টাকার খরচ। একজন অগা মানুষও বোঝেন যে, পুরো বিষয়টাই সরকারের সাথে প্রতারণা ও অপরাধ। কিন্তু উনি বললেন, ইতালিতে এটাই বাংলাদেশি কমিউনিটিতে স্টান্ডার্ড। ও হাঁ, ভদ্রলোক ৫-ওয়াক্ত নামাজ পড়েন।\nইতালির মিলানে এক দোকানে বিরিয়ানি খেতে খেতে কথা হল আরেক ইতালিয়ান-পাসপোর্টধারী বাংলাদেশির সাথে। উনি ২-রুমের একটা ছোট্ট অ্যাপার্টমেন্ট কিনেছেন ব্যাংক লোক নিয়ে, মাসে ৫০০ ইউরোর মত রি-পে করতে হয়। প্রতিরুমে তিনজন করে এবং কিচেনে একজনসহ ৭ বাংলাদেশির কাছে ভাড়া দিয়েছেন। জনপ্রতি ২০০ ইউরো করে ভাড়ায় মাসে ১৪০০ ইউরো ভাড়া পান। অথচ ইতালির আইনে ঐ অ্যাপার্টমেন্টে দুইজনের বেশি থাকার কথা না।\nঅস্ট্রিয়ার ইন্সব্রুকে এক ছোটভাই পড়াশোনা করে আর পার্ট-টাইম এক রেস্তোরায় ওয়েটার হিসাবে কাজ করে। সেই ছোটভাইর কলিগ আরেক বাংলাদেশি ভাইয়ের সাথে পরিচয় হল। উনি নানান হাত ঘুরে অস্ট্রিয়া এসে স্থায়ী হয়েছেন কন্ট্রাক্ট-ম্যারেজের মাধ্যমে। পরে অবশ্য দেশেই বিয়ে করেছেন এবং এখন স্ত্রী-সন্তান নিয়ে এসেছেন অস্ট্রিয়ায়। উনি ঐ রেস্তোরায় ফুলটাইম ওয়েটার, পাশাপাশি আরো একটা ফুডকার্টে ফুলটাইম চাকরি করেন ব্লাকে (মানে কোন লিগাল কন্ট্রাক্ট নাই, ট্যাক্স ফাঁকি দেয়ার জন্যে হাতে-হাতে পয়সা নিয়ে নেন আর এত কর্মঘন্টা বেআইনি)। আর শনিবার দিন আবার ফুড ডেলিভারির কাজ করেন। দেশে বলিউডি ঘরানার রাজকীয় কায়দায় বিয়ে করেছেন, উনার স্ত্রী খুব গর্বসহকারে ওনাদের বিয়ের ছবি ও ভিডিও দেখালেন। যখন জিজ্ঞেস করলাম, স্বামীর আগের কন্ট্রাক্ট ম্যারেজের কথা জানতেন কিনা, তখন চুপসে গেলেন। ঐ লোকের প্রায় ১০-১৫ জন বন্ধুবান্ধবের সাথে কথা হল, সবার সেইম অবস্থা - কন্ট্রাক্ট ম্যারেজ+ব্লাকে জব। ট্যাক্স পে না করাটা বাংলাদেশি কমিউনিটিতে কোন অপরাধ মনে করা হয়না। জিজ্ঞেস করলে, সবার যুক্তি একটাই - আমি তো আর চুরি করতেছি না, কর্ম করেই তো খাচ্ছি। অথচ এটাও যে মহাচুরি তা কে বোঝাবে তাদের।",
  "votes": "73",
  "comments": [
    {
      "text": "Amra jatigoto bhabe ato kharap keno -_-. Khub kharap lage.",
      "votes": "20",
      "replies": []
    },
    {
      "text": "I get what you are trying to say but there are 2 problems with your argument -1) bangladeshis aren't the only immigrants pulling this shit and 2) Bangladeshis living in BD have different political aspirations than Bangladeshis living abroad. What you described is less of a particular ethnic group mentality problem and more of a class based issue. Chinese Indian African immigrants all have people in Europe who do exactly the same things you are describing. There are a ton of white collar BD diaspora workers in Europe and North America who pay regular taxes and abide by the law. Its more of a class issue because if you grow up being abandoned by the state - no social support no safety net no job prospects etc- you adopt a mentality regardless of where you live that you need to make the most on your own. So when you find loopholes you exploit them wherever you are.",
      "votes": "26",
      "replies": [
        {
          "text": "I second this.",
          "votes": "3",
          "replies": []
        },
        {
          "text": "You really couldn't understand my arguements. My point is that it doesn't matter how much social security and strong law you have, corrupted Bangladeshi people will stay corrupted.\nbangladeshis aren't the only immigrants pulling this shit\nYes, but I wan't focusing on immigrants from other countries at all.\nThere are a ton of white collar BD diaspora workers in Europe and North America who pay regular taxes and abide by the law.\nThere are a significant portion of white collar BD diaspora who are committed to tax fraud and other illegal shits.\nIts more of a class issue because if you grow up being abandoned by the state - no social support no safety net no job prospects etc- you adopt a mentality regardless of where you live that you need to make the most on your own. So when you find loopholes you exploit them wherever you are.\nThis isn't true at all. These people spend 2M-3M BDT to come to European countries and most of them have better family background than mine, financially. I have come from a family where financial crisis was always intense and I had to always secure my place in govt school, college and univeristy to continue my studies. Leading an honest life is a hard choice, but it's a choice. There are a lot of people in Europe, even from Africa, who works as a waiter and live a honest life.",
          "votes": "4",
          "replies": [
            {
              "text": "I think you are making broad generalizations based on your experience. Your experience is certainly valuable but I don't think the data backs it up. If you can show me some data which supports your argument I'd be happy to retract mine",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "To understand this one need actual understanding of different cultures, need knowledge about world history, learn how most of the world used to be just even a century ago and what shaped the current modern societies. Only then can one see there's no special evolution that happened here, that we are not homo sapiens lewra, just regular sapiens. But when all one knows is blind hatred and has little knowledge, what else can they do?",
          "votes": "1",
          "replies": [
            {
              "text": "Homo sapiens lewra lulz",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "As someone living in the anglosphere, I avoid Bengali people. I do not speak Bengali in public. And I have moved to an area with very little Bengali population. Sure I do have to explain to my colleagues what Bangladesh is, where it is, and why I am not \"Indian\", but I will take that any day over a Bengali populated area.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "What about tax fraud made by billionaire? In reality we are not the only one who broke the law and abuse it, but when it comes to the percentage We are the worst. Most of this country's people are like this.",
      "votes": "13",
      "replies": [
        {
          "text": "Read about Whataboutism.\nI understand that every country will have some bad people, they might be rich or poor. My point is that almost all of the Bangladeshi people are corrupted to the core.",
          "votes": "7",
          "replies": [
            {
              "text": "That's what I've said. It's sad that our people are like this. Our evaluation may have caused this, we are too greedy as a Race.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I live in Innsbruck too, and while I’m sitting here wondering who these mysterious folks are, But I totally agree with you",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Europe are either dumb or too kind to accept us, all these actions will ultimately someday cause huge issues and already have in few countries, local aint happy, low immigration is always good, even for us, when u invite such idiots it only makes things worse",
      "votes": "9",
      "replies": [
        {
          "text": "Nobody invited these fuckers, they are simply scamming those countries.",
          "votes": "5",
          "replies": [
            {
              "text": "Thats true most just spend 20-30 lakh to come, but again European gov are turning a blind eye, in a way enabling it, lets be real none of them are italian or austrian, they just have a passport, nothing about them, the culture or anything reflects any of those countries, most are busy with bs politics back home, supporting extremists, mocking bdeshi women, etc. moving to a culture which in general liberal enough to accept them hasn’t really changed them, also dont forget the benefits fraud",
              "votes": "5",
              "replies": []
            }
          ]
        },
        {
          "text": "European and NA govt intentionally allow those undocumented workforce. It helps with wage suppression and stable workforce that the locals can't provide.\nA big chunk of India's economical improvements are through same process.\nThis foreign remittence is what keeping our country afloat.",
          "votes": "2",
          "replies": [
            {
              "text": "India’s foreign remittances is only 1% or less of gdp, maybe there was a time 30-40 years ago, anyway people dont send money home for patriotic reasons they do to support their family",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I agree to what you said. Saw similar things around Europe. But bhai US Canada tew amra honest na so shobkhanei ei obostha. Middle East e oshikkhito beshi bole ora abused hoe abuse korte pare na ei ja",
      "votes": "5",
      "replies": [
        {
          "text": "My arguement isn't that things are different in US/Canada. My arguement is that regime/govt/law change can't change our behaviour.",
          "votes": "7",
          "replies": []
        }
      ]
    },
    {
      "text": "ইউনুস যে বলে বাংলাদেশিরা টাকা নিয়া ভোট দেয় কথা কিন্তু সত্য। আরো সত্য ইউনুস একজন ভালোমানের জিগাংসি ক্যানভাসার। কারন সেফু দা'র ভাষায়, বাংলাদেশের \"গরিব\" মানুষ কে বিদেশে কি ভাবে সেইল দিতে হয় তা কিন্তু ইনুসের মতা আর কেউ করতে পারে নাই, বা জানে না।\nবিদেশ দেখি অনেক পোলাপান ছাত্র ভিসায় এসে, ইউরোপীয়ান ছাত্রিদের সাথে বিশেষ করে আঠার মতো লাগে থাকে। আর আংগুর ফল খেতে না পারলেই। ওয়াস্তাকফিরুল্লা!! এরা এদের দেশে আসবে আর এদের নিয়া হাজার হাজার কুরুচিপূর্ণ কথা বলবে।",
      "votes": "5",
      "replies": []
    },
    {
      "text": "বাংলাদেশে সরকার আসবে, সরকার যাবে; কিন্তু প্রকৃত উন্নয়ন কখনোই আসবে না। রাস্তাঘাট, ফ্লাই ওভার, বড় বড় বিল্ডিং, সেতু, গণ্ডায় গণ্ডায় A+, হাজার হাজার শিক্ষা প্রতিষ্ঠান, সবই হবে। কিন্তু, নৈতিকতার উন্নয়ন আগামী ২০০ বছরেও হবে না। কারণ, সমস্যাটা আমাদের সরকারে না, সমস্যা আমাদের মানসিকতায়, সমস্যা আমাদের রক্তে।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "The few incidents you have described here have structural causes, they are not moral defect of being a \"Bangladeshi\".\nVisa scams, overcrowded rentals, contract marriages etc. are not “Bangladeshi-only” phenomena.They exist in every immigrant community.Pakistani, Indian, Nepali, Nigerian, North African...you name it. This isn’t about “national character” it’s about immigrant survival tactics under systemic pressure,language barriers,skill gaps, and legal obstacles. Framing this as \"criminality\" doesn't fully justify their behaviour. Some of the odd jobs holder that you have mentioned here would \"probably\" earn barely enough to survive if they stayed in Bangladesh. When they move to Europe, everything costs 10× more while legal pathways are extremely narrow. Expecting them never to take shortcuts is simply unrealistic.\nWe do not inherit crime in our DNA. Just look at second or third generation immigrants who grow up with education, language fluency, and legal security. Their crime rates drop to match or fall EVEN BELOW THE HOST POPULATION. So, yes, these illegal pathways exist because of labor exploitation, the \"developed\" countries that still rely on cheap labor and undocumented workers. I understand your emotion and I am not defending crimes here but stop blaming a community single handedly while ignoring the systems enabling it!",
      "votes": "3",
      "replies": [
        {
          "text": "This is the only right take. OP is simply overreacting and doesn't look at the big picture there. One odd job barely pays the amount you need to survive. It's not easy for the first generation to survive where everything is very expensive.",
          "votes": "2",
          "replies": [
            {
              "text": "This is the same argument my friend made who is a government officer in Bangladesh. He takes bribes because he can’t afford to live with his salary. When I asked him to switch to a good paying private jobs, he refused to do so.\nAgain: being honest is a very tough choice, but it’s a choice indeed.",
              "votes": "-1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Your arguments falls flat when you consider 55% italians themselves do not pay taxes or pay minimal taxes.On the other hand, the taxes are very high sometimes accounting for half of your income which in itself should be considered theft by any person with common sense.\nP.s: i do not live in italy or europe.",
      "votes": "1",
      "replies": []
    },
    {
      "text": null,
      "votes": null,
      "replies": []
    }
  ],
  "id": 41
}