{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pepzq7/what_to_do/",
  "hash": "ecd43886c6f449c0c4a658cc6d054fcb",
  "scraped_at": "2025-12-08T11:27:52.113346",
  "title": "What to do!!?",
  "description": "Amar social anxiety onek problem ache. Chotobela thekei ei problem ta, rasta ghate onek anxiet feel kori. To amar gf ke niye baire ber hoile onek anxiety feel kori. O dekhte ekta pori'r moton and 100/10. Je dekhbe tar e pochondo hobe. Jar karone shobai takay thake. Like everyone I am not kidding. Ar er karone onek anxiety feel hoy, jar karone public place e ami onek voy e thaki ar autistic er moton achoron kori oke niye berhoile. Majhe majhe ei anxiety prblm er karone rude behave o kori. Jar karone o amake psychatrist dekhaite bole, ami dekhai, and osudh khai (SSRI). Khawar por onek khani komeche but doctor bolse aro time dite hobe.\nTo jai houk, amar gf recently onek gulo p.i.lls khay karone or baba ma oke varsity te porar khoroch dibe na. To tar jonno ami bolsi unader deya lagbe na ami dibo. Oke niye varsity jai vorti korate. Ami bolsi or frnd ke niye jaite but o amakei niye jabe nahole jabe na. Toh anxiety feel hoy prochur campus e gele.\nBashay ferar shomoy o rastay bar bar amar hath joray dhore, ar always amake cuddle korte chay. Ami jani eta cute onek but ei anixety amake mere fele purai. Manush jon prochur look dey. Toh jar karone ami oke boli anxiety feel hoche hath dhoirona prae 2/3 bar. But last e ami dhomki diye feli jar karone o onek rag feel kore bcz or baba oke beshi love kore na ekhon emon ekta bf paise jar hath o dhorte pare na.\nTo bashay jawar shomoy o bollo ekta place e jabe, ami bollam jabo na but o bollo jabe. Okay then amra rouna dei but kahini holo amra wrong location e dhuke jai and 2 hours waste hoy. Pore eita niye oke onek dhomki dei and rude hoi. Tarpor metro station e ashar shomoy o bollo amar sathe jabe na to ami hata dei ragher mathay and bashay eshe pore p.i.lls kheye ghumay pori.",
  "votes": "90608",
  "comments": [
    {
      "text": "You are already on meds and still your anxiety is not fully under control. Its time to enter the next step, psychotherapy (CBT) or stronger meds. So go back to your psychiatrist and discuss your problems.",
      "votes": null,
      "replies": []
    },
    {
      "text": "ভাই এবার সামারাইজ করে লিখছি-\nDont think of others too much, cz either way aamjonita will always have an opnion. fck that.\nig you have a narcissistic personality. change it. no one thinks about you like you do. no one gives an F,not for too long.\nDo things that you are afraid of. Do it more.\nnext few meetings, hold your gf's hand.keep holding all the time.\nNever scold your gf publicly for anything.\n6.Learn to make decission & responsibility.\n7. If possible roam around the city or punlic places with her. ex, Park, museum ,fair etc. Roaming I meant \"Walking\" not with bike.\n8. Follow rule 3 & 5 by heart. good luck.",
      "votes": null,
      "replies": []
    },
    {
      "text": "You were uncomfortable with holding hands in public and that was completely understandable also consider in our culture. Its on her for trying to force it. Also can't really comment on other personal matters without knowing the full story",
      "votes": "1",
      "replies": [
        {
          "text": "Holding hands is not inappropriate and lightest PDA. Please don't criminalize a person for asking for the bare minimum.",
          "votes": "1",
          "replies": [
            {
              "text": "but Bangladeshi kamlas might harm them you know",
              "votes": "1",
              "replies": []
            },
            {
              "text": "We both look young, so whenever I go outside everyone looks at us creepily. Also I told her we can do this stuff in public when we are matured enough both of us. Dhora dhori to private kono space eo korte pari, public place onek bhoy pai.",
              "votes": null,
              "replies": []
            },
            {
              "text": "But it was something he was clearly not comfortable with and even after that she tried to multiple times. Not trying to criminalize anyone but yea there's that",
              "votes": null,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "eto boro comment likhsi j ekjon submit hocche na.lol",
      "votes": null,
      "replies": []
    },
    {
      "text": "🥱🥱good luck lil bro",
      "votes": null,
      "replies": []
    }
  ],
  "id": 43
}