{
  "url": "https://www.reddit.com/r/bangladesh/comments/1peim6q/next_bangladesh/",
  "hash": "6c6463099379131ebca1fce736603ca0",
  "scraped_at": "2025-12-08T11:28:08.746631",
  "title": "Next Bangladesh!",
  "description": "Here is my thoughts about next Bangladesh! Whether you love it or hate it, just don't take it seriously! I could be wrong, but I am putting my idea. It is pretty sure BNP would lead next Bangladesh whether it is election or selection. They already gave up huge seats for its allies. So, Jamat, NCP and other allies will take over those seats! This is called \"anti-AL party\" which always been there. Actually, there are 2 parties in Bangladesh: 1) AL and 2). Anti-AL. Let me go back to main topic. So, BNP allies aka anti-AL will form government and would remain for another 10-15 years unless AL comes back! But point is Tarek might not come back to Bangladesh soon! So, who would be the PM? Eunus ? What do you think? Fokrul already said, I see Zia's image within Eunus! Just express your thoughts. Thank you.",
  "votes": "0",
  "comments": [
    {
      "text": "Bro I don't think you know anything about politics or the system let alone our constitution. Why did u even mention the possibility of Dr Yunus becoming pm? Do u even know how a pm is mandated? And no there's no 2 party like Al or anti-Al. Every party is for themselves. Yes BNP has let go of some seats to protect the alliance but didn't u question yourself why would they do that if their only goal was to establish an anti-Al government and Al is already banned. Everything is not about Al my guy",
      "votes": "11",
      "replies": []
    },
    {
      "text": "what is your age?",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Jamat will come to power 100%. That's what it's looking like. BNP or NCP will be the \"birodhi dol\". Bangladesh is finished, sorry to say.",
      "votes": "5",
      "replies": [
        {
          "text": "Lol",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Man is living his persecution fetish fantasy as a BAL supporter here huh?\nBnp will come to power this is pretty much established but you are crazy to believe they support jamaat more than Awamilig, believe me no one supports your supreme leader as much as BAL they aren't gonna do something as crazy as \"Anti-awami league\"\nSecondly Yunus quite literally cannot run for election the way IG works. And do you think BNP or even anyone would bet their all for a 84 year old man who quite a lot of time needs help to even walk up a few flights of stairs?",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Let the election take place first. What if the Yunus government or this interim thing lead by another person remains for the next 2 years somehow? Or some serious instability breaks out. Who's seriously showing excitement for the election apart from BNP? BNP doesn't have the track record of ruling the country in back to back terms like the League (who just De- politicized the politics through crooked elections from 2014 to 2024). After the February election of 1996, BNP barely lasted a month. Btw, a whole process of De- politicization is still going on. Talking about coming back, Awami League has no organized root politics at present.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Lol - \"Actually, there are 2 parties in Bangladesh: 1) AL and 2). Anti-AL.\" - Remember 91? The fairest election of Bangladesh!",
      "votes": "2",
      "replies": [
        {
          "text": "This is literally true. Those who are mocking it, probably under aged and should refrain from this post!",
          "votes": "2",
          "replies": [
            {
              "text": "I referred 91, and you calling me under age? You better check all the election results (the ones were considered fair) - how much percentage of votes got casted for AL. AL only has 10%-15% solid votes. Rests are swing voters. AL never crossed 40% even with swing votes. WTH are you smoking dude? AL didn't even win in the first democratic election of Bangladesh.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "On point.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Stop thinking about AL thats the past. No one talks or wants them back\nDr. Yunus will not be the PM you gotta learn about the process this is not a fantasy world",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 44
}