{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pgrihb/this_man_needs_to_do_politics_here_in_bangladesh/",
  "hash": "20160f1d311d797c332d5b8e1d74d134",
  "scraped_at": "2025-12-08T11:17:04.039150",
  "title": "This man needs to do politics here in Bangladesh.",
  "description": "He does make great points about economy and health policies, a rarity in today's politics where Jamaat sells Jannah tickets but no future vision about what they will do if they come to power and NCP seems to be doing what they do best, being Jamaat's B-team. We wont become Singapore anytime soon, that train is long gone in my view. But we can and should become self-reliant. But we don't get any ideas about how he is gonna implement all these from long distance Zoom calls. Nobody cares what a party leader thinks about Bangladesh from London. Forget about rickshaw pullers and uneducated people, even I don't understand what he's talking about most of the time. And he \"has\" to make people understand \"if\" he wants to win elections.\nSorry for the bad English",
  "votes": "11",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "The problem with him is:\nYes he says good things, and frankly out of the options I find him to be the only one talking sensibly.\nBUT all of it means nothing if he’s sitting in london. He has to return and lead his party, especially with his mother now out of action. He needs to return, reign in his party, campaign and genuinely create a plan for the country and apply the things he says.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "He makes great points because it’s prepared by his PR team. Put him in a debate or in front of an actual journalist and he’ll piss his pants.",
      "votes": "4",
      "replies": [
        {
          "text": "He actually did surprisingly well on the BBC interview. And good PR team is nothing bad imo.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Many politicians made very good points before the elections.. Nothing impressive, nothing new..",
      "votes": "4",
      "replies": [
        {
          "text": "It is new when the only politician talking about how to stop the free fall of our economy is him.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Jamaat policies: Women will work 5 hours, women will get bursaries from government to cover the extra 3 hours (really spoken like people who have no idea how a corporate job or tax money works), women will voluntarily wear modest clothing...What a women obsessed party for a party nearly devoid of women.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 5
}