{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pdwmub/what_makes_young_people_so_arrogant_and/",
  "hash": "acbc389322cd6c4fffe6934b8a65e321",
  "scraped_at": "2025-12-08T11:31:05.431526",
  "title": "What makes young people so arrogant and disrespectful?",
  "description": "Most cases, I avoid replying to others when they seek help. The main reason is that if they don’t like my advice, suggestion, or reply, they often respond disrespectfully. For instance, recently, a boy who had completed his HSC asked whether he should stay in Bangladesh to contribute to the country or go abroad. I advised him to go abroad, study, and experience new languages, cultures, and history. His response was, “Ur words made me cum.” What a disrespectful and disgusting comment! He sought advice but showed no respect for others.",
  "votes": "25",
  "comments": [
    {
      "text": "It's because their brains are not completely developed to understand consequences and effects of their actions. Also some are entitled and selfish to care others feelings.",
      "votes": "12",
      "replies": [
        {
          "text": "Ah yes, the \"consequences\" of saying unhinged shit on Reddit",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "His response was, \"Ur words made me cum.\"\nLmfao 😭",
      "votes": "8",
      "replies": []
    },
    {
      "text": "''less sex''",
      "votes": "7",
      "replies": [
        {
          "text": "That's a good reason",
          "votes": "1",
          "replies": [
            {
              "text": "it is not good only , this is the result of research . That's why modern world make sex free for the society .",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "That absolutely did not go where it would go. As a guy who lived on discord, I can guarantee you this kid has an entire livelihood in discord",
      "votes": "5",
      "replies": []
    },
    {
      "text": "wow",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Too much Roblox",
      "votes": "4",
      "replies": [
        {
          "text": "people don't realize who are the actual players of Roblox. It's usually 35+ hairy guy living in his mom's basement, I occasionally play the game with some of my friends.",
          "votes": "-1",
          "replies": [
            {
              "text": "Desi kids der je Roblox community ota purai astagfirullah",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Alpha male sigma farming",
      "votes": "2",
      "replies": [
        {
          "text": "It's not alpha or beta. It's a simple thing. You asked for advice and I said from my experience. You may like it or avoid it.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "আবেগ আছে, বিবেক নাই। সনদ আছে, শিক্ষা নাই। চাপার জোর আছে, যুক্তি নাই। সবগুলা হুইন্যা হুইন্যা চুইন্নার মা। কারণ একটাই, বই বিমূখ জীবন যাপন।",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Ami jeta dekhi sheta hoilo difference of perspective and opinion nite na para. Last 2 unpleasant incidents happened with me just over some minor disagreements. One unpredictable bad behaviour or comment actually does sting so bad.",
      "votes": "2",
      "replies": [
        {
          "text": "সেটাই। ভিন্নমত হলেই অনেকে খুব খারাপ এবং ব্যক্তিগত পর্যায়ে এসে আক্রমণ করে যেটা একদমই কাম্যনা।",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "proper education",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Chances are high he comes from a broken family where parents don't teach values. ☕",
      "votes": "2",
      "replies": []
    },
    {
      "text": "What is going on in this subreddit man 😭",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Lack of education from the family ?",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Constant chaos",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Bad upbringing. Nothing else.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "What a wild turn of events xd\nI'm sorry but this is funny. You said \"Great reply! Thanks\"",
      "votes": "3",
      "replies": [
        {
          "text": "Because this is a lesson for me. I don't like to use bad words or disrespect someone.",
          "votes": "5",
          "replies": [
            {
              "text": "Thanks for your post. Had a good laugh ;v",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 55
}