{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pdva3w/misinterpretation_of_the_word_aleem_or_wulaama/",
  "hash": "96e719505c5fad8d8686a77448309026",
  "scraped_at": "2025-12-08T11:31:41.578865",
  "title": "Misinterpretation of the word ALEEM or WULAAMA",
  "description": "বাংলাদেশে সাম্প্রতিক সময় ধর্মীয় উগ্রবাদ চরম আকার ধারণ করেছে। এই ধর্ম ব্যবসায়ীরা দেশের ধর্মপ্রাণ মানুষের সরলতার সুজুগ নিয়ে একটা বিরাট শ্রেণীকে ইতিমধ্যে ব্রেইনওয়াশড করে ফেলতে সক্ষম হয়েছে। ব্রেইনওয়াশ করার ক্ষেত্রে তারা প্রায় একটি কথা দিয়ে চ্যালেঞ্জ ছুড়ে দেয় ''অরে আপনি তো আলেম না '' আপনি কুরআন এর কি বুঝবেন '' আলেম শব্দটি কে তারা একটা টার্মিনোলজি বানিয়ে ফেলেছে প্রায়। অনেক তা ব্রাম্মনবাদের মত। means, ভারতে ব্রাম্মন বাদে অন্য কারো ধর্ম গ্রন্থ পড়ার অধিকার ছিল না , ফলে একটা বিরাট জনগোষ্ঠী প্রায় অন্ধকারেই থেকে যেত শিক্ষা থেকে। আর এর প্রতিবাদের মধ্য দিয়েই কমিউনিজমের জন্ম হয়। কমিউনিজম শুধু ভারত বর্ষ নয় সারা পৃথিবীতে গণমানসের অধিকারের পক্ষ নিতে গিয়েই জন্ম নেয়। অন্য দিকে পৃথিবীর ইতিহাস পড়লে দেখা যায় , এই ধর্মীয় মৌলবাদী শ্রেণী শাসক শ্রেণীর সাথে মিলে মিশে দেশের জনগণ কে শোষণ করতো , এইটা সমস্ত সভ্যতায় ঘটেছে। মিশর , ব্যবিলন ,মায়া , ক্যালিডিয়ান ,সুমেরিয়ান সিন্ধু। সভ্যতার ইতিহাসের কমন প্যাটান এইটা।\nযায় হোক , এবার আসা যাক আলেম শব্দের বাংলা কি ?আলেম শব্দের ইংরেজি কি আলেম শব্দের বহু বচন উলামা এর বাংলা হল , বিজ্ঞানী বা জ্ঞানী। প্রাচীন কালে অক্ষর জ্ঞান সমৃদ্ধ মানুষ কে আরবে আলেম বলা হত। যারা কুরআন বা অন্য কিতাব/ বই কে পরে মানুষ কে বুঝিয়ে দিত তাদের বলতো আলেম বা উলামা। এখন তো দেশের সমস্ত মানুষ ই অক্ষর জ্ঞান সমৃদ্ধ। এমন কি ফোনে ক্লিক করলেই কুরআন হাদিস তর্জমা সহ সমস্ত কিতাব বই এসে পড়ছে। তাহলে আজকের দিনে কেন তারা আলেম শব্দ দিয়ে একটা শ্রেণী বা অধিকার Established করতে চাচ্ছে ! সহজ কথায় তারা ধর্মের দখল নিতে চাইছে। এর কারণ কি ? এর সিম্পলি কারণ হাজার হাজার কোটি টাকার দান দক্ষিণ , জাকাত , কুরবানীর চামড়ার অধিকার। ছোট্ট একটাউদাহরণ দেয়া যাক , আহমদুল্লাহ ফেনীর বন্যার সময় ১০০ কোটি টাকা কালেকশন করেছে। সেই টাকার থেকেই সে আসসুন্নাহ ট্রাভেল নাম একটি ব্যাক্তিগত হজ ট্রাভেল এজেন্সির লাইসেন্স নিয়েছে। যা বাংলাদেশী আইনে ইলিগ্যাল সাথে ইসলাম অনুসারে ইলিগ্যাল। অথচ বেগম জিয়া কে শেখ হাসিনা এক একাউন্টের টাকা অন্য একাউন্টে রাখার জন্য ৬ বছর জেল খাটিয়েছে !",
  "votes": "9",
  "comments": [
    {
      "text": "If I don’t have the ability to understand religion itself, then why would I follow something that doesn't resonate with me? Just leave me out of it, bruh\nThey literally want people to be slaves to \"aleem wulaama\" instead of God itself. That's interesting.",
      "votes": "6",
      "replies": [
        {
          "text": "That's how communism born in Europe & Latin America . this is the the true reason behind Simon Bolivar, Che ,Karl Marx , etc . even the football war of Barcelona vs Real Madrid has same history . that is the enmity behind global British American Imperialism vs Communism.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Source : youtube.com/watch?si=7IQ-_Kf-mAiww-GJ&v=FXLMaQKkvK8&feature=youtu.be",
      "votes": "2",
      "replies": []
    },
    {
      "text": "youtube.com/watch?si=7IQ-_Kf-mAiww-GJ&v=FXLMaQKkvK8&feature=youtu.be",
      "votes": "2",
      "replies": []
    },
    {
      "text": "আমাদের আলেম ওলামা:",
      "votes": "2",
      "replies": []
    }
  ],
  "id": 57
}