{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pdts03/%E0%A6%AC%E0%A6%B2%E0%A6%B0_%E0%A6%AE%E0%A6%B8%E0%A6%B2%E0%A6%AE%E0%A6%A8/",
  "hash": "a5476b3dbcd2179d80ce420fe582243c",
  "scraped_at": "2025-12-08T11:32:00.099051",
  "title": "বাংলার মুসলমান ❤️",
  "description": null,
  "votes": "90608",
  "comments": [
    {
      "text": "",
      "votes": null,
      "replies": []
    },
    {
      "text": "Whoever the fk thinks Pakistani's were right, is real brain dead. Those mf's ordered military to erase Bengali blood, by raping every female and impregnate them and kill all the others. And if anyone thinks that Pakistan was right because of islam then they should take the female members of their families to Pakistani military and get their blood erased. Also if they think this is supported by Islam, then I guess they have a special hell reserved.",
      "votes": null,
      "replies": [
        {
          "text": "even pakistanis arent that loyal to their country as much people of this country show their loyality",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "ইসলাম হল ওদের পাপ ঢাকার ব্যানার , দাড়ি টুপি পাঞ্জাবি ওদের লেবাস ছাড়া কিছুই না। ইসলাম কোন পোশাকের নাম না। দাড়ি টুপিতে কোন ইসলাম ই নেই !আছে ধর্ম ব্যবসা\nSource : https://www.youtube.com/watch?v=FXLMaQKkvK8",
      "votes": null,
      "replies": [
        {
          "text": "দাড়ি টুপিতে কোন ইসলাম ই নেই !আছে ধর্ম ব্যবসা\nSo are these Freedom Fighters in the photo dharma bebshayi?",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "The left behaves retarded sometimes. When JaShi says \"Muktijuddho was against Islam\", you do not have the burden to prove how religious Muktijoddhas were. Even if all Muktijoddhas were people who never prayed, the Liberation war does not become a war against Islam. The Liberation War was to establish a secular country and that is why JaShi has a problem with it. The response here is not to prove Muktijoddhas prayed, but to prove secularism is not against Islam.",
      "votes": "2",
      "replies": [
        {
          "text": "It's not that deep. The post here is simply mocking Jashi who claims to be vanguard of Islam in BD yet actively participated in a holocaust where many Muslims died.\nThe goal of the liberation war wasn't solely to establish a secular country, the primary goal was national liberation and to establish a society that was fair above all(সাম্য, মানবিক মর্যাদা, সামাজিক সুবিচার). Secularism comes by default",
          "votes": null,
          "replies": []
        },
        {
          "text": "to bhai secularism er under e dhormo palon korte mana nai right? tahole eta share korle somossha kothay?",
          "votes": null,
          "replies": []
        },
        {
          "text": "another important caveat: it was an ethnic jenoside not a religious one",
          "votes": "2",
          "replies": [
            {
              "text": "I would say it was both, they genocide bengalis but among them the hindus were specially targeted due to their religion.",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "Have you just quoted Asif Adnan's video on 71? That Guy is good tbh for targeting the cream of the cream brain of Gen Z, niche hunter.\nBut blaming on secularism and by saying \"too many pro secular meetings from 47-70\" really blows the lid off😜.\nBut Asif Adnan, or any radical is just some oil product, rising after years of subjugation (that they deserve for being lazy) thanks to this guy, Saudi https://www.ucanews.com/news/how-saudi-arabia-finances-radical-islam-in-bangladesh/79312\nBut at the end of the day, there's no discharge, even if there remains no elite class, bourgeoisie class, the majority population start and ends in the same spot",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "মাশাল্লাহ। মুক্তিযোদ্ধাদের নামাজ আদায় করা দেখে ভালো লাগলো।",
      "votes": null,
      "replies": []
    },
    {
      "text": "pk mc",
      "votes": null,
      "replies": []
    },
    {
      "text": "",
      "votes": null,
      "replies": []
    },
    {
      "text": "Allah gave us Islam,and Satan gave us Jamaat e Islam.\nJamaatis greatest hiding place is their religion. They think they can gaslight everyone that \"I'm an Islamist party so I cannot be wrong!\"\nHefajot,Islami Andolon don't get the same bashing as Jamaat. Why? Because they weren't hypocrites like them,trying to hide their sins under the name of religion. Jamaat is the religious version of Awami League,trying to hide their sins through the veins of an ideology. They cannot still accept 1971 because they know their ancestors were in the wrong side in history during that time. Their student wing ,Shibir,acts liberal to gain voters but we all know what they actually think.\nJamaat is the two-faced demon in our country,they couldn't accept 1947 ,couldn't accept 1971 (but they suddenly say 1947 was great!!!! We got Liberation in 1947 even tho they opposed 1947). The biggest hypocritical party is Jamaat because they are hiding behind the veil of our holy religion Islam. They are the Bjp of Bangladesh.",
      "votes": null,
      "replies": []
    }
  ],
  "id": 58
}