{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pdteiw/struggling_as_a_new_real_estate_sales_guy_cant/",
  "hash": "a3f9f534a9b1652cfa28873e2ada526b",
  "scraped_at": "2025-12-08T11:32:38.609180",
  "title": "Struggling as a New Real Estate Sales Guy – Can't Close Any Deals Despite a Solid Project, Need Advice on Finding Serious Buyers!",
  "description": "Hey Guys, I've been in this job for about two months now at a well-known real estate company. It's a sales gig with targets, and I'm supposed to sell plots of land. I've been hustling with the classic cold calling approach, but man, it's been a total bust. Zero sales in the last two months. The project is actually pretty awesome for investment – great location, solid returns potential – and my colleagues are crushing it, closing deals left and right. But for some reason, it's just not clicking for me. Most people I talk to show a tiny bit of interest at first, but after I explain everything (price, features, etc.), they ghost or flat-out say no to visiting the site or buying. Management is breathing down my neck to schedule project visits with clients, and the pressure is insane. I'm legit worried about getting my salary docked or even losing the job if I don't turn this around soon. Anyone else been in this boat as a newbie in real estate sales? How do you find and reach actual buyers who are genuinely ready to check out the project and commit? Tips on lead gen beyond cold calls? Maybe social media, networking events, online ads, or something else that's worked for you? I'm all ears – thanks a ton in advance!",
  "votes": "3",
  "comments": [
    {
      "text": "Ugh, the cold calling struggle is real, especially with ghosting after all that effort! Modern tools, like AI-powered sales automation, are actually transforming lead gen by pinpointing high-intent buyers, which could seriously help you cut through the noise. Happy to share some articles if you want to dive deeper!",
      "votes": "1",
      "replies": [
        {
          "text": "Dm plz",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 60
}