{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pdat8r/%E0%A6%B8%E0%A6%A8%E0%A6%A6%E0%A6%AA_%E0%A6%AA%E0%A6%95%E0%A6%B8%E0%A6%A4%E0%A6%A8_%E0%A6%9C%E0%A6%A8%E0%A6%A6%E0%A6%AC%E0%A6%A6_%E0%A6%B8%E0%A6%B2%E0%A6%97%E0%A6%A8_%E0%A6%A8%E0%A7%9F_%E0%A6%A6%E0%A6%B6%E0%A6%B0_%E0%A6%B9%E0%A6%B2%E0%A6%A6_%E0%A6%97%E0%A6%A3%E0%A6%AE%E0%A6%A7%E0%A6%AF%E0%A6%AE_%E0%A6%85%E0%A6%AA%E0%A6%AA%E0%A6%B0%E0%A6%9A%E0%A6%B0/",
  "hash": "7455d639a029e7f191772f0c1dcd8d71",
  "scraped_at": "2025-12-08T11:33:29.770793",
  "title": "সন্দীপে পাকিস্তান জিন্দাবাদ স্লোগান নিয়ে দেশের হলুদ গণমাধ্যমে অপপ্রচার",
  "description": "প্রথমে, প্রথম আলোতে সন্দীপে পাকিস্তান জিন্দাবাদ স্লোগান নিয়ে কাটছাট করা ভিডিও প্রকাশ করা হলে সামাজিক গণমাধ্যমে তোলপাড় শুরু হয়। স্বাধীনতার মাসে কোন সাহসে \"পাকিস্তান জিন্দাবাদ\" এই দেশের মাটিতে স্লোগান দেয়া হবে।\nকিন্তু আসল ঘটনা হল চট্টগ্রামের সন্দ্বীপে মাহফিলের মাঠে, পাকিস্তান সহ ইরান, ফিলিপিন্স রাষ্টের প্রতিনিধি ছিল এবং প্রত্যেক দেশের নাম ধরে জিন্দাবাদ বলা হয়। কিন্তু সবদেশের স্লোগান দেখালে তো নব্য রাজাকার বাংলাদেশ দখল করার মিথ্যা বয়ান তৌরী করা যায়না।\nএই হলুদ গণমাধ্যমগুলো গত ১৬ বছর ধরে মিথ্যা জঙ্গি আর রাজাকার বয়ান দিয়ে আওয়ামীদের সৈরাচারিত্ব, গুম, খুন আর লুটপাটের বৈধতা উৎপাদন করেছে। আর এখন তাদের প্রভুরা পালিয়ে গেছে , তাদের ফিরিয়ে আনার জন্য জুলাইয়ের গণঅভ্যুত্থানকে প্রশ্নবিদ্ধ করার অপপ্রচেষ্টা করে যাচ্ছে।\nThe dissent নামের এক অনলাইন ওয়েবসাইট বিভিন্ন ঘটনার বর্ণনায় প্রথম আলোর শব্দচয়ন নিয়ে একটা প্রতিবেদন করেছে।\n৪টি ঘটনায় প্রথম আলোর কাভারেজ\nhttps://www.facebook.com/share/p/14PJff6ZN9h/",
  "votes": "0",
  "comments": [
    {
      "text": "আমি বাংলাদেশী কুশিক্ষিত রাজাকার আলবটর দেড় হিসেবে তা বুঝি না। আধুনিক যুগে আমার শত্রুর সাথে ও বন্ধু হতে পারে ন্যাশনাল ইন্টারেস্ট এর উপর বেসড করে। কিন্তু আমাকে কেন জিন্দাবাদ স্লোগান দিতে হবে , কেন ওদের পাকিস্তান কে আব্বু ডাকতে হবে ! আব্বু না ডাকলে বন্ধুত্ত হয় না !",
      "votes": "12",
      "replies": []
    },
    {
      "text": "ইসরায়েলের ২০% মুসলিম, ঐখান থেকে প্রতিনিধি পাঠাইলে ইসরায়েল জিন্দাবাদ বইলা চিল্লাইতেন?",
      "votes": "15",
      "replies": [
        {
          "text": "Best response.",
          "votes": "3",
          "replies": []
        },
        {
          "text": "সেদেশ আগে পাঠাক এক মুসলিম আলেমকে। অবশ্য ঐই দেশের নামের বদলে ফিলিস্তিন জিন্দাবাদ হবে কারণ বাংলাদেশ ঐই দেশকে বৈধ মনে করেনা।\nপাকিস্তানতো সেদেশের মত গণহত্যা চালাচ্ছেনা এখন।",
          "votes": "-1",
          "replies": [
            {
              "text": "এখন করতেছে না, ভবিষ্যৎে করবে না এমন কথা নাই।\nকরলে ইসরায়েল জিন্দাবাদ বলবেন কিনা ঐটা বলেন।\nধরে নিতেছি ইসরায়েল ভালো হয়ে গেছে, এত বছরের গণহত্যাকে 'সৈনিকরা মাঝেমধ্যে বেশি করে ফেলছে' বলে ক্ষমা চেয়ে ফেলছে। বলবেন তাইলে?",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "অন্যদেশ আর পাকিস্তান এক না। অন্যদেশ আমাদের উপর জেনোসাইড চালায় নাই, আমাদের মা বোন ধর্ষণ করে নাই। পাকিস্তান কে যারা শুধুই অন্য একটা দেশ বলে, এগুলাও রাজাকারের বাচ্চা।",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Firstly, The Dissent made a fantastic report and analysis here. This is called narrative framing. And sure, the criticism against Prothom Alo is valid and fair in this case. Here is another example from Masood Kamal. While such framing is not justifiable, it is not uncommon in newspapers even outside Bangladesh.\nNow that being said, what the OP is attempting to do here is the same thing, but worse. The incident on Sandwip was reported not only by Prothom Alo, but by many other media. What the OP mentions regarding the incident was also covered in Prothom Alo's report. And this incident is indeed reprehensible and concerning. It is undeniable how there has been a surge of anti-1971 sentiment and love for Pakistan as of late, despite Pakistan being responsible for the most heinous crimes during our liberation war and still they have not owned up for it.\nMeanwhile, check out what the OP thinks about our liberation war here. Also here is OP glorifying a killer and justifying murders of innocents and children. Spreading hate and fake news about Baul Abul Sarker. Jumping hastily to conclusions based personal biases and not hesitating to promote an obvious fake conspiracy news here; ironically debunked by a thorough investigative report from, guess who, The Dissent. And promoting propaganda news from the most rotten media of our country here and here. Amar Desh is not only guilty of narrative framing (just check how many reports do they have regarding Tawhidi mob and shrine vandalism), but it is also guilty of spreading fake news, propaganda, and also incited the blogger killings.\nNotice how individuals like this attempt to spread their propaganda, either knowingly or unknowingly, by mixing half-truths and lies with a few truths. Just because Prothom Alo engages in narrative framing and bias does not mean that the reports on militants and Razakars are false. Nor does it take away how Hasina went after Prothom Alo during her reign. And such people will also be extremely selective with their criticisms, all the while barking how seculars and intellectuals are being selective. It is quite hilarious.\nSadly, con artists like Pinaki were able to successfully brainwash a large mass and the OP is a prime example. Sorry OP, it is nothing personal. If you have good intentions, take a step back to think about what I said and do better.",
      "votes": "4",
      "replies": [
        {
          "text": "Actually, thank you for linking all my posts regarding liberation. I strongly encourage everyone to go through my posts because I show how fake the BAL narrative is and their Nations Daddy.",
          "votes": "2",
          "replies": [
            {
              "text": "If that's the only take away you got from my comment then my condolences for you. There is nothing constructive in any of your posts I linked above. It's good to have a compilation of your overall mindset and bias. In the future it will be easier to link it for anyone who wants to show you for as you are.\nOh, and just because BAL promoted their own narrative and milked the liberation war does not undermine it. Nor does it make your abominable narrative any more true. Which is why you are unable to defend them every time I point out the flaws.",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "এরা এতো লজ্জাছড়া রাজাকার, পাকি শুনলেই অর্গাজম শুরু হয়ে যায়! বাপের জন্য কি এতই দরদ ভাই বাপের দেশে যা, নয়তো এখানে খাবে আর এখানে বসে বাপের পা চাটার সুযোগ খুঁজবে!",
      "votes": "5",
      "replies": []
    },
    {
      "text": "অন্য দেশের সাথে ফাকিস্তানের তুলনা করিস কোন সাহসে? এতো ফাইক্যা প্রেম থাকলে ও দেশে চলে যা",
      "votes": "9",
      "replies": []
    },
    {
      "text": "আচ্ছা পাকিস্তান কি এমন বালের দেশ যে এটা নিয়ে সারাদিন পড়ে থাকতে হবে। মানুষ খেতে পারেনা সব খাবার খেয়ে ফেলে আর্মি টাকা লুট করে আর্মি সেই দেশের জিন্দাবাদ বলতে তো ৫ বার জমজম পানি দিয়ে গোসল করা উচিত। মানে বড় ভাই মানবে তো একটা দেশের মত দেশ নেক। ফাকিস্তানই শেষমেশ! বাংলাদেশ তো তাও আইসিইউ তে আছে আর এদের দেশ তো পুরাই ডেথ। অশিক্ষিত মোল্লার বাচ্চারা",
      "votes": "4",
      "replies": []
    },
    {
      "text": "ভাই, আপনার লজ্জ্বা নাই? সেই দিন এক রাজাকারের পক্ষে সমর্থন করতে গিয়ে আনাল খেলেন। আজকে আবার আসছেন আরেকটা নিয়া। হলুদ তো ভাই গণমাধ্যম না, হলুদ তো আপনে। কেমনে জানেন? আপনি তো রাজাকারের জুতার তলায় লেগে থাকা কৃমি আর রাজাকার দিছে পাড়া গু-তে। ব্যস, আপনার হলুদ সন্ধ্যা সারা।\nএকটু তো লজ্জ্বা পান। কোন কিছু পড়েন না, জানেন না। যুক্তি দিয়ে কথা বলতে পারেন না। আপনে এক সময় নির্ঘাত মন্ত্রি হবেন।",
      "votes": "5",
      "replies": [
        {
          "text": "বিজয়ের মাসে এভাবে ভরে দিলেন পাকিপ্রেমী ভাইটিকে?",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "অন্যদেশ আর পাকিস্তান এক না। ইরানি ফিলিস্তিনিরা আমাদের গণহত্যা করেনি ! আমাদের মা বোন কে গণধর্ষণ করে নাই। আমাদের ঘর ঘর থেকে সোনাদানা লুটে নিয়ে যায় নাই !",
      "votes": "6",
      "replies": [
        {
          "text": "তাহলে তো ভারতীয় বংশোদ্ভূত ঋষি সুনকেরও যুক্তরাজ্যের প্রধানমন্ত্রী হবার কথা ছিল না?",
          "votes": "-4",
          "replies": [
            {
              "text": "ভারত কি যুক্তরাজ্যের লক্ষ লক্ষ মানুষকে হত্যা করেছিলো? যুক্তরাজ্যের লক্ষ লক্ষ নারীদের ধর্ষণ করেছিলো?",
              "votes": "4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "## বাটখারা।",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "-5",
      "replies": [
        {
          "text": "Come out with your real id sheikh Yunus.",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "That's Bangladeshi Media for you. Islamophobic is out of control in this country.",
      "votes": "-3",
      "replies": [
        {
          "text": "This you Brother?",
          "votes": "3",
          "replies": [
            {
              "text": "ইসলাম নিয়ে খুব চিন্তিত ভাইটি একটু বিনোদনের আশায় ওই সাব এ গিয়েছিলো, আপনারা অন্য কিছু মনে কইরেন না",
              "votes": "3",
              "replies": []
            },
            {
              "text": "I swear to god every single time they are like this.",
              "votes": "2",
              "replies": []
            },
            {
              "text": "Are you sane in the head? When did I say I'm a practicing Muslim. No you guys love to go off topic and shame people the same way those mollah do and cry that you're different. Typical hypocrite islamophobic for you.",
              "votes": "0",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": null,
      "votes": null,
      "replies": []
    }
  ],
  "id": 63
}