{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pd99hz/looking_for_job_m22/",
  "hash": "19a07c8cfc92dcdfd9c7bc27d5917356",
  "scraped_at": "2025-12-08T11:33:52.785340",
  "title": "Looking for job (M22)",
  "description": "I’m completely jobless and I have around 1.5 months of backup left. My family also depends on me financially, so the situation is getting very stressful.\nI’m good with computers and my spoken English is strong, but at this point I’m open to any kind of work, online or offline. I just need something stable so I can support myself and my family.",
  "votes": "6",
  "comments": [
    {
      "text": "Bro in situations like this just apply for a stop-gap job or a bridge job something that still guarantees an inflow of income while you look for your next stable job.\nSome jobs you can apply for are:\nTeacher at schools or Coaching center (i have seen people getting into coaching centers and never leaving despite having a BUET degree)\nPrivate tuition\nOnline Gig work\nCall center jobs (always hiring) - though some places require bond signing so stay away from those.",
      "votes": "3",
      "replies": [
        {
          "text": "I'm not OP but how does one get online gigs in the current job market? Everyone I asked irl always says some form of \"I had connections\"",
          "votes": "1",
          "replies": [
            {
              "text": "Not necessarily Online gigs can include small jobs like video editing, customer service (online chat and phone calls) on websites like upwork. You do need to have good english speaking skills.\nGemini and Chat GPT can guide on how to setup your profile and apply for a job to improve your chances.\nOne more thing I'll mention here for OP and those in similar situations who are the only income earners in their family, its good to invest in unconventional side hustles that earn you a quick buck on a consistent basis, this is to ensure regular inflow of cash that atleast provides enough income to cover basics on a rainy day.\nSafest investment is a small convenience store that sells everyday items. I know how it sounds in our social context but if you looked at the cashflow of such a business, honestly its a good reliable side hustle. The challenge here would be to find someone you can trust with the cash register.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I saw that computer operator jobs don't require such high skills. Try to find online jobs on bdjobs. com / LinkedIn / Facebook",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 64
}