{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pd8od6/%E0%A6%AB%E0%A6%B0%E0%A6%B9%E0%A6%A6_%E0%A6%AE%E0%A6%9C%E0%A6%B9%E0%A6%B0_%E0%A6%86%E0%A6%B8%E0%A6%B2%E0%A6%87_%E0%A6%95_%E0%A6%A6%E0%A6%B0%E0%A6%B6%E0%A6%A8%E0%A6%95/",
  "hash": "9675fe18c9c5cb97630bc4b37c95143b",
  "scraped_at": "2025-12-08T11:34:10.623008",
  "title": "ফরহাদ মজহার আসলেই কি দার্শনিক ?",
  "description": "গতকাল খালিদ মহিউদ্দিনের টকশো তে ফরহাদ মাজহার কে আমি বুঝতে পারি নি , উনি বলেছেন উনি আসলে সাধারণ মানুষের পক্ষের লোক কিন্তু উনার ভাষা আমরা সাধারণ জনগণ ই বুঝতে পরি না । একপর্যায়ে উনি এটাও বলেছেন কোন ধর্মতত্ত্বের লোকের সাথে উনি তর্কে অবতীর্ণ হতে ইচ্ছুক নন , তাঁর সমান জ্ঞানী না হলে উনি তর্কে জড়ান না । উনি এনায়েত উল্লাহ আব্বাসী প্রসঙ্গে বলেছেন পাগলা কুকুরের সাথে তর্ক চলে না করুনা করা চলে ! (অথচ এই আব্বাসীরা হাজার হাজার মানুষকে তাঁদের অনুসারী বানাচ্ছে তাহলে উনার অনুসারী গণ ও তো পাগলা কুকুর) ।সব মিলিয়ে উনি সাধারণ মানুষের কথা বলতে চান কিন্তু সাধারণ মানুষকে অবজ্ঞা করে ।\nহতে পারে আমার জ্ঞানের স্বল্পতা দরুণ তাঁর মত মহাজ্ঞানী ভাষা আমি বুঝি না , তবুও আমার কাছে মনে হয় উনি যদিও বাউল ভক্ত তবে উনার আচরণ বাউল গোত্রীয় নয় । উনি পশ্চিমা দর্শন কে তাচ্ছিল্য করেন কিন্তু সেইটা জানা না থাকলে তিনি আলোচনায় আগ্রহী নন , আবার দেশীয় যে দর্শন বিশেষ করে ভারতীয় দর্শন সে বিষয়ে উনি দূরে থেকে সুফি দর্শন কে মার্কসীয় দর্শনের টানেল দিয়ে প্রবেশ করিয়ে উনি আমদের যে তত্ত্ব গেলাতে চাচ্ছেন সম্ভবত জ্ঞানের স্বল্পতা হেতু আমরা সেটা গ্রহণ করতে পারছি না ।\nএখন ঊনার পথ উনার ভাষায় আমি বুঝতে পারছি না ,কেউ কি কি সহজ করে উনাকে একটু অনুবাদ করে দেবেন ?",
  "votes": "9",
  "comments": [
    {
      "text": "Here's my honest opinion.\nHe may sound like an elitist, but sometimes its really difficult to debate with someone if the speaker is only using his \"oratory\" skill other than trying to go deep into it. Look at Zakir Naik. Excellent debater, yet his understanding, if not knowledge, of metaphysics and ethics is very weak. Yet, he can win anyone in debates.\nNot that I am much appreciative of debates since debates do not beget anything, but my two cents.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "I don’t understand him either. He is a bit confused I think. I’m my humble opinion, most of the so called philosophers in our country do not have a clarity about the situation. They address the problem but don’t provide a clear path toward the solution. The path can be unrealistic, I don’t have any issue with that. But they keep involving unrelated things and at the end confuses everyone as well as themselves.",
      "votes": "5",
      "replies": [
        {
          "text": "All the philosopher are like this , i mean confused . only moron are confident .",
          "votes": "3",
          "replies": [
            {
              "text": "কি বলেন ,কিন্তু উনি নিজে তো কনফিউজড নন উনার শ্রোতা এবং পাঠক হিসেবে আমরা বিভ্রান্ত হই।",
              "votes": "3",
              "replies": []
            },
            {
              "text": "I don’t agree with that. You can be confused about the situation but when you present an idea it has to have a clear path toward. That idea can be impractical but has to have clarity that address the problem, issues and a solution.",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "দার্শনিক এর কাজ আমাদের পথ দেখানো , হতেই পারে তিনি কিছুটা বিভ্রান্ত কিন্তু সমস্যা হচ্ছে উনাকে দেখে মনে হয় কিংবা শুনে উনি ড্যাম শিওর উনি যা বলছে শতভাগ ঠিক কিন্তু সাধারণ মানুষ হিসেবে আমি উনাকে বুঝতে পারছি না । উনার বাউল ভক্ত লোক কিন্তু বাউলের সুফি তত্ত্ব যতটা বোধগম্য হয় উনার কথা তাঁর তুলনায় খুবই কম বোধগম্য হয় । প্রায়ই মনে হয় উনি নিজের কথার উল্টো দিকে চলতে শুরু করেছেন , তাঁর এবাদত নামা পড়লে আমি যে দিশায় হাঁটি আবার তাঁর সমসাময়িক বক্তব্য শুনলে মনে হয় উনি নিজেই উলটো দিশায় হাঁটতে শুরু করেছেন । অথচ উনি ভীষণ কনফিডেন্ট নিয়ে কথা বলেন ,সাধারণ মানুষের জন্য উনার দায়ের কথা বলেন কিন্তু একজন সাধারণ মানুষ হিসেবে উনার কথায় বিভ্রান্ত হয়ে পরি।",
          "votes": "3",
          "replies": [
            {
              "text": "I think you are absolutely right. I didn’t read his books. I do respect his thought process. But you just said “ their job is to show a path”. Are they doing it? I don’t think so. That’s why I don’t think he is a Proper Philosopher. We all have different expectation from a philosopher. I want a proper theory and possible interpretation/solution even of that has many holes.",
              "votes": "2",
              "replies": []
            },
            {
              "text": "I think he is kore like an activist.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "এনায়েত উল্লাহ আব্বাসী সমন্ধে ফরহাদ মাজহার যা বলেছে , তা ১০০% সত্য। বাংলাদেশ এমন দেশ , যেখানে পিএইচডি জাল করে টাইটেল লাগিয়ে ঘুরে বেড়ায় প্রকাশ্যে। আব্বাসীর হাজার হাজার না , লক্ষ লক্ষ অনুসারী হতে পারে , কিন্তু কোনো উচ্চ্ শিক্ষিত বা সু শিক্ষিত লোক আব্বাসীর অনুসারী হতে পারে না !আব্বাসীর পিএইচডি ই তো জাল , সে কবে কোথায় কি টপিকে পিএইচডি করছে কেউ জানে না ! দেশের বাইরে যে মাস্টার্স এর থিসিসি করছে সে জানে গবেষণা কি জিনিস আর পিএইচডি কি জিনিস !\nhttps://youtu.be/A446Z68jqws?si=1PWvY9Twj5tk26jM",
      "votes": "4",
      "replies": [
        {
          "text": "আমার কোন আপত্তি নেই আপনার কথা মেনে নিতে আমার আপত্তি ফরহাদ মাজহারের কথায়, উনি যদি এই সমস্ত ধর্মীয় গুরুদের সাথে তর্কে অবতীর্ণ হতে ইচ্ছুক না হোন তবে কি অনুসারী লাখ লাখ সাধারণ মানুষের প্রতি উনার কোন দায় নেই?,অথচ উনি বড় গলায় দাবী করেন সাধারণ মানুষের আত্মিক উন্নতি করতেই উনি জ্ঞান চর্চা করেন",
          "votes": "5",
          "replies": [
            {
              "text": "Still F.Mazhar is right. কারণ ,বিতর্ক হতে হবে সমান সমান জ্ঞানী মানুষের ভিতরে। আব্বাসী তো ক্লাস ৯ ম এর একজন বিজ্ঞানের ছাত্রের সমান জ্ঞান রাখে না, তার সাথে বিতর্ক কি করে সম্ভব ??? অশিক্ষিত মানুষের কোন দায় থাকে না সমাজের প্রতি। আরবি সাহিত্যে একটা উক্তি আছে , ফেরেস্তা যেখানে পা দিতে ভয় পায় , মূর্খ সেখানে ঝাঁপ দেয়।",
              "votes": "0",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "মজহারের নাকি বাউল নিয়ে ভালো কাজ আছে, আমি পড়ি নাই। তবে গত ত্রিশ বছরে সে স্রেফ বাটপারি করেছে। এই সময়ে বুদ্ধিবৃত্তিক অবদান শুন্য।",
      "votes": "2",
      "replies": [
        {
          "text": "30 years ,গাছের তলায় বসে অবসার্ভ করা একটানা ৫ বছর গবেষণার চেয়ে উত্তম।",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "দুইশব্দে সুবিধাবাদী বুদ্ধিজীবী(এই হালায় ভণ্ড)",
      "votes": "2",
      "replies": []
    },
    {
      "text": "এই বিতর্কে যাওয়ার আগে এক্সে প্রশ্নটা জরুরি, একজনের মতের সাথে মিল না থাকায় অন্য একজনকে প্রকাশ্যে হ!ত্যার হুমকি দেয়ার বিষয়টা যে সমাজে আলোচনাই হয় না, কেউ প্রতিবাদ করতে সাহস পায়না, সেই সমাজের মানুষের কোন দার্শনিক অবস্থান থেকে অন্য কোন একটা দর্শনকে মূল্যায়ন করবেন? মজহার সাহেব বরাবর কনফিউজড, তার মানে এই না, উনি একেবারে খারিজ যোগ্য! কিন্তু বিতর্কে যেতে হলে কিছু জায়গায় সমতা লাগে। এরকম উগ্র ভাবনা আমাদের ঘরে ঘরে, সেখানে বিতর্ক বা দর্শনের সমালোচনার আগে নিজেদের দর্শন কি, সেটা পরিষ্কার হওয়া জরুরী!!",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Calling a big chunk of the society pagla kukur is literally the most non baul loke thing a baul enthusiast can do. As a normal person i can say i'll never shake Abbasi's hand or drink a cup of tea with him, Forhad Mazhar can't because that goes against everything he preaches.",
      "votes": "-1",
      "replies": []
    },
    {
      "text": "সাধারণ জালেমগণের চাটুকারিতা তোষামোদি না করে কথা বলতে পারে না যে, সে একটা বুদ্ধিবেশ্যা।",
      "votes": "2",
      "replies": []
    }
  ],
  "id": 65
}