{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pd69tl/can_detox_plum_really_reduce_your_body_fat/",
  "hash": "c9f2c5ef496f599c2ae240c138afbcb0",
  "scraped_at": "2025-12-08T11:34:50.733534",
  "title": "can detox plum really reduce your body fat without any kind of exercise or diet?",
  "description": "so, i am seeing a bangladeshi facebook page where they are claiming that detox plum can reduce your body fat....not only body, but, even if u have fat on your face or some where else.....and they even said that it does not have any kind of side effects....that does not make sense.....my mother showed me this......she want's to reduce her weight.....and i am seeing desperate people are getting lured to it....any way....i thought about reading the comments.....i saw that most of the comments where we can see people giving a good review are actually the people who have pretty much a low number of people as friends(sorry i am not fluent in english)i mean they kind a look like fake.....the page even has 6.7k followers....i am not really good with reddit....and idk how can i attach images other wise i would've attached\nany way the name of the page i am talking about is glimmer collection.....btw...idk....but, is it a scam? it is harmful as well. bcz, they literally are advertising to people that they don't need to have a healthy diet or do exercise. they are even assuring people that all they need to do is eat this and they will lose 4 kgs of weight in 7 to 8 days\nhttps://www.facebook.com/share/v/1EdnwaovM9/\nthis is the page",
  "votes": "0",
  "comments": [
    {
      "text": "Oh god no 😭 It most definitely is a fad. Nothing will reduce body fat except for a caloric deficit.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "it is a simple solution for simple folk who are gullible to believe marketing hype like school children.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "\"Nothing will reduce fat without diet & excersise.\" Read that twice then read it again. Apnr jodi internal kono problem na thake tobe dieting(eating more nutritious food), walking, weight lifting, good sleep r no/less suger is a deadly combo for weight loss.",
      "votes": "1",
      "replies": [
        {
          "text": "Plum detox bolte apni alubokhara vejano jol mean kortisen to!!! Amr maa o eta kheto. It's excellent remedy for fatty liver & will aid in fat loss but won't work as a stand-alone.",
          "votes": "1",
          "replies": []
        },
        {
          "text": "ik that....but, it makes me think......this page is totally fake and scam....and we should report it",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Run",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Losing weight is really hard! You gotta be super disciplined! Assuming your mom in her late 40s or 50s she should take it slow! If she has health condition her diet should be sorted by a dietitian. Beside thats she needs to be active walking swimming yoga etc!",
      "votes": "1",
      "replies": [
        {
          "text": "exactly....but, doesn't this make this page a scam?",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 67
}