{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pd2gr3/cops_tried_to_extrajudicially_arrest_sahara/",
  "hash": "61f862902a3a4f9d90c20a44915d9dbb",
  "scraped_at": "2025-12-08T11:35:09.128575",
  "title": "Cops tried to extrajudicially arrest Sahara, neighbours stayed shut and did not help the cops.",
  "description": null,
  "votes": "38",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Wish I knew her when I was still in BD, would've given me more hope about the world.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "what! average joe aam jonota is not le evil loud ugro ponthi minority who are peddling communalism and religious propaganda 24/7????!!1!!1!!!",
      "votes": "6",
      "replies": [
        {
          "text": "Honestly that was the positive take from this post for me too ( fuck the police tho pigs are same everywhere)",
          "votes": "3",
          "replies": [
            {
              "text": "Wait why was the above comment deleted? I thought they were just mocking all the doomposters by pointing out the ordinary people of our country don't subscribe to extreme ideology. Mods you alright? Ekhon ki ek side er manush mock korte parbe and can doompost but we can't say anything to them?",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "বাংলাদেশে অনেক বামদের মুখোশ পরা লিবেরাল কিংবা তথাকথিত প্রগতিশীল ভদ্রলোকেরা এই ব্যাপারটা বোঝেন না। আমরা সকলেই আগে মানুষ, যতই আইডেন্টিটি চোদাই না কেন আমরা সায়েন্টিফিকালি আগে মানূষ।\nসাহারার প্রতিবেশীদের আমি ব্যক্তিগত ভাবে চিনি না, হয়তো অনেকেই ট্রান্সবিদ্বেষী - আমি জানি না। কিন্তু তারা যা কিছুই হোক, তারা সাহারা কে চেনেন। তাদের এলাকারই মানুষ, তাদের কমিউনিটির সদস্য। তারা যদিওবা বিদ্বেষ ধারণ করেন, তারা তাকে প্রতিদিন দেখেন এবং তাদের মধ্যে হয়ত সবচাইতে প্রতিক্রিয়াশীলরাও বলবে \"যাক মেয়েটা তো আমাদের মতই\"।\nমানুষদের চেনা সবচাইতে গুরুত্বপূর্ণ। বামপন্থী রাজনীতি যারা করেন, অনেকেই অনলাইনে পরে থাকেন, অনলাইনে শাহবাগী এই শাহবাগী সেই গালি শোনেন, এবং মনে করেন বাংলাদেশ লস্ট কেইস। এখানে কিছু করে লাভ নাই, যেইখানে বাস্তবে দেখা যায় অনেক ক্ষেত্রে একজন রিকশাওয়ালা ভদ্রলোকের বুয়েট পাস পোলাপানদের চেয়ে বেশি প্রগতিশীল চিন্তা, অথচ এই বুয়েটের পোলা জীবনে যত সুযোগ সুবিধা পাইছে তা সেই রিকশাওয়ালা পায় নাই।",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "rape threat?!?",
      "votes": "-2",
      "replies": []
    }
  ],
  "id": 68
}