{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pc3b6p/%E0%A7%A9%E0%A7%A6_%E0%A6%B2%E0%A6%96_%E0%A6%B6%E0%A6%B9%E0%A6%A6_%E0%A6%86%E0%A6%B0_%E0%A7%A8%E0%A7%AA_%E0%A6%B2%E0%A6%96_%E0%A6%A7%E0%A6%B0%E0%A6%B7%E0%A6%A3%E0%A6%95_%E0%A6%95%E0%A7%9F%E0%A6%95_%E0%A6%B6%E0%A6%A4_%E0%A6%A8%E0%A6%AE%E0%A6%B2%E0%A6%A8_%E0%A6%B6%E0%A6%AC%E0%A6%B0_%E0%A6%AA%E0%A6%AF%E0%A6%A8%E0%A6%B2_%E0%A6%A5%E0%A6%95/",
  "hash": "e9f866e031a7652b8d46946328a561a6",
  "scraped_at": "2025-12-08T11:39:30.344831",
  "title": "৩০ লাখ শহীদ আর ২-৪ লাখ ধর্ষণকে কয়েক শ'তে নামালেন শিবির প্যানেল থেকে নির্বাচিত হওয়া ডাকসুর মুক্তিযুদ্ধ বিষয়ক সম্পাদক ঝুমা",
  "description": "Slowly showing true colors...",
  "votes": "66",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "1947 er naam nise, british der naam nise. Eidike 1971/ Pakistan kichui mention kore nai apu🤡",
      "votes": "26",
      "replies": [
        {
          "text": "ভাতারের নাম মুখে নিতে শরম লাগে। 🤡",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "পুরোদস্তুর জামায়াতের প্রোডাক্ট। তার এজেন্ডাই হচ্ছে ৭১-এর যুদ্ধাপরাধকে স্বাভাবিক হিসেবে দেখানো—যেন একাত্তরে জামায়াত কিছুই করেনি। খাঁটি পাকিস্তানি বীজ দেখতে কেমন, তার জ্যান্ত প্রমাণ হলো ....",
      "votes": "21",
      "replies": []
    },
    {
      "text": "জুলাই স্পিরিটের কাজই এগুলা। মুক্তিযুদ্ধ কে ছোট করা, ইতিহাস বিকৃতি করা, পাকিস্তানের অপরাধের মাত্রা কমানো। সে তার মিশন অনুযায়ী কাজ করছে।",
      "votes": "28",
      "replies": []
    },
    {
      "text": "তারা কোনদিন সফল হবে না। শিবিরের সাহস অনেক বেড়ে গেছে। শিবির সুযোগ পাইছিল, কিন্তু সেটা এত বাজে ভাবে দুর্ব্যবহার করতাছে এটার পরিণাম ওরা পাবেই। যেসকল সিউডো বামপন্থী, লিবারেল এই শিবিরকে শেল্টার দিয়ে মাথায় তুলছে আমার দুঃখ লাগে ওদের জন্য। এদের কে বাচাবে! সব ত ডকুমেন্টেড। হাওয়া ত বদলাবে একদিন না একদিন। তখন এদের কি হবে! আর কোন যুক্তিতেই ত এদের কেউ রক্ষা করতে পারবে না৷ আল্লাহ এদের হেদায়েত দিক।",
      "votes": "24",
      "replies": [
        {
          "text": "সেইদিন কি আমরা দেখে যেতে পারবো?",
          "votes": "6",
          "replies": [
            {
              "text": "অনেক লোকজনই স্বাধীন দেশ দেখে যাইতে পারে নাই। তাতে কি দেশ স্বাধীন হয় নাই? এইগুলা ব্যাপার না। আমাদের জীবন অনেক ছোট। এই ছোট টাইম স্কেলে হয়ত অনেক কিছু আমরা এক্সপেরিয়েন্স করতে পারব না। কিন্তু ইতিহাসে ঠিকই স্বাধীনতাটাই সবচেয়ে বড় অর্জন। ৭১ টাই শত বছর পরেও মানুষ জানবে। অন্য অনেক কিছুই অস্তিত্বহীন হয়ে যাবে",
              "votes": "6",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "They always showed their true colors. Remember this? Yet, people are either selfish or braindead thereby voting for them, or it is what they want themselves.\nAlso notice how the main focus is not 1971 despite December being our victory month. She starts the post with a whole mumbo jumbo of 1947 and quickly shifts the focus to 2024 and their new \"revolution\".\nThese hypocrites and traitors will ruin whatever good we achieved after 1971. It is such a shame how a great many still do not see them for as they are.",
      "votes": "14",
      "replies": [
        {
          "text": "Bitch even had the audacity to be sassy about it.",
          "votes": "8",
          "replies": []
        }
      ]
    },
    {
      "text": "বেহায়া, ইতর , মুনাফিক- এই তিনটা শব্দ তাদের জন্য আসলে কম হয়",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Shibir effect",
      "votes": "15",
      "replies": []
    },
    {
      "text": "I feel ashamed being of former DU Students. DU students voted this kind of proud daughter of Rajakar as a Secretary of Liberation War Affairs",
      "votes": "15",
      "replies": [
        {
          "text": "They didn’t win by students’ vote. It was completely rigged. In many centres over 100% votes were cast, countless students said their votes were cast even before they arrived at the polling centres, the uni administration employed ex shibirs in all possible roles so they can change the outcomes from inside, shibir’s sadek kaiyum was inside the building when cotes were being counted -a clear violation of the regulations. In JU, RU and everywhere else they shut off the buildings for hours where votes were being counted and didn’t let anyone from the press in. They barely have 8/9% votes, so they had to resort to stealing and cheating in all possible manner to take control of the universities.",
          "votes": "-1",
          "replies": [
            {
              "text": "I am a du student. Was also very engaged in dacsu elections as one of my closed friend run for a position( not from shibir panel and also he lost). Everyone knew shibir panel would win long before the dacsu, only position chatra dal had a chance of winning was GS. If you followed the movement of chatra dal before dacsu you will see the last day all the promotion and posts were about Hamim vai as he had the best chance.\nShibir panel did not win because any rigging, yes there were some mishandling of the election but those were oversights not rigging and do not have any basis of bias.\nMy understanding is people voted for shibir panel is they actually did some very good campaigns after 5 August. Most of the campaigns done by chatra dol fail miserablely. I still remember the day they put posters all over the campus. Our group chat exploded, the guy(our batch mate) who put some of the posters in our building had to apologise and rip the posters with his own hands. Also there is a factor of approachibility, sadik kayem and other panel members most of them are very approchable(before dacsu). In my experience chatro dol panel did the opposite. they took themselve very seriously, sourrounded themself with some goons who acted very defacively towards anyone want to approch them.",
              "votes": "2",
              "replies": []
            },
            {
              "text": "I am also really upset shibir won but never feel the nesxt strongest panel chatra dol panel deserves it more. Umma's panel was good, I would be happy if she won but her campaigns were subpar",
              "votes": "1",
              "replies": []
            },
            {
              "text": "\"Countless students said their vote was casted before they arrived\" -> as far as I remember it was just one lady who said in the first page(we had 5 pages of candidates to vote for) all three postions were voted from the shibir panel. But here is the catch, they hand you the pages uncovered, you would see the first page when they hand you the page easily. And also in the cc tv it showed she went inside the votting room(not a room actually just table+chairs indivisually divided) stayed there for around 20-30 seconds and then came to complain",
              "votes": "0",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "জামাতি শিবির রাজাকার এদের কথা, লিখা, শরীর, মন মানসিকতা দুর্গন্ধযুক্ত এবং মিথ্যার ফুলজুরিতে ব্যতিব্যস্ত।",
      "votes": "10",
      "replies": []
    },
    {
      "text": "Good to see that people are aware of shibir's slow poisoning. They will find every small chance to distort our culture and our history. They've already done that saying they'll celebrate নববর্ষ on অগ্রহায়ণ instead of the usual পহেলা বৈশাখ। Beware of these neo-islamofascists",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Psychological manipulation (brainwashed)",
      "votes": "10",
      "replies": []
    },
    {
      "text": "Mukh kharap hoy ei gula porley",
      "votes": "4",
      "replies": []
    },
    {
      "text": "No matter how much they try , they won't be successful. becoz it is impossible to manipulate everyone mind? for example BAUL are now getting even more popular , common people start studying them again https://www.youtube.com/watch?v=D_Lp7WnpJlk&t=3258s",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "-5",
      "replies": [
        {
          "text": "I have yet to see someone getting banned for asking simple questions like this or for having a difference in opinion as long as you abide by the rules, so no need for the disclaimer.\nYou can read the post by David Bergman I shared earlier here if you want to know further about the number of martyrs. It is not an easy task to calculate an estimate and it gets harder after so many years. While BAL exaggerated these numbers as they exploited 1971 to justify their own oppression, you also need to understand how Shibir and people like Zuma and Pinaki attempts to undermine it similarly.",
          "votes": "7",
          "replies": []
        },
        {
          "text": "আত্মসমর্পন করা পাকি সেনার সংখ্যা ৯৬ ০০০ , তাদের বন্দুকে ১ টি করে গুলি ছুড়লেও ৯৬০০০ রাউন্ড গুলি। PAK ARMY মারা গেছে কয় হাজার ??? পাকিরা কি মেশিনে ১ টি করে গুলি নিয়ে যুদ্ধ করতে এসেছিল। বিদেশী নিউজ মিডিয়ার কাটিং লাগবে ??? কয়টা লাগবে অপেক্ষা করুন।",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-10",
      "replies": [
        {
          "text": "She already contested the number of martyrs and birangonas during her campaign for DUCSU. So, it's intentional on her part.",
          "votes": "7",
          "replies": []
        },
        {
          "text": "She didn’t once mention the word Muktijuddho or Pakistan inspite of being Muktijuddho bishoyok shompadok herself. What is the point of bringing 47 there? That happened in 14 August, she could've posted it on August if she likes that so much. How do you defend this?",
          "votes": "10",
          "replies": []
        },
        {
          "text": "She already contested the number of martyrs and birangonas during her campaign for DUCSU. So, it's intentional on her part.",
          "votes": "5",
          "replies": []
        },
        {
          "text": "আপনার ব্রেইনসেল সংখ্যা সহস্র",
          "votes": "1",
          "replies": []
        },
        {
          "text": "ভাই এটা এরাবিক না যে মুফতি আইনা ব্যাখ্যা করা লাগবে। আমরা শিবিরের ত্যানা প্যাচানোর বুদ্ধি ভালো করেই বুঝি। জন্মটা জেনজির কয়েক বছর আগে হইছে ত! ২০০৫/৬ এই বুঝ হইছে। ওরা কি জিনিস বুঝি। ফ্রেন্ড সার্কেলেও শিবির আছে। এক ভুল মানুষ ২ বার করলেও বারবার কখনোই করবে না।",
          "votes": "1",
          "replies": []
        },
        {
          "text": "ব্যান/শ্যাডো ব্যান খাওয়ার জন্য রেডি হন। আপনি No..No.. জোনে ঢুকে পড়েছেন",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-8",
      "replies": [
        {
          "text": "আজাইরা রেটোরিক বাদ দিন। আপনার আর জুমার মতো মানুষের এটাই সমস্যা। প্রকৃত সংখ্যা নিয়ে আলাপ হতেই পারে, কিন্তু আপনাদের কথার অপপ্রাসঙ্গিকতা এবং টোন দেখলেই বোঝা যায় কোথায় আপনাদের সমস্যা। যেমন ধরুন, জুমার এখানে ১৯৪৭ আর ২০২৪ নিয়ে আসার তো দরকার ছিল না, তবুও আনল। ডিসেম্বর বলতে লোক বিজয়ের মাস মেনে ১৯৭১ই বোঝে।\n৩০ লাখ প্রকৃত সংখ্যা না হলেও যে লাখ লাখ মানুষ মারা গেছে, তা নিয়ে কোনো সন্দেহ থাকার কথা না। এটাকেও সুন্দরভাবে সহস্র বানাল, আর আপনিও এটা না দেখে ৩০ লাখের কথা শুনেই তেলে-বেগুনে জ্বলে উঠলেন।",
          "votes": "10",
          "replies": []
        },
        {
          "text": "'লোকজন'",
          "votes": "3",
          "replies": []
        }
      ]
    }
  ],
  "id": 84
}