{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pc2d4e/for_all_the_abroad_apus/",
  "hash": "b3e3eca45fce6ceb4ceab5200b73826c",
  "scraped_at": "2025-12-08T11:39:52.668755",
  "title": "for all the abroad apus",
  "description": "heyy, im still a teenager, but ive been thinking about further education. Im quite good at studies now and love maths, and i wanna pursue it in the future. but as a brown GIRL in a strict family, i dont think they'll let me go abroad. Two of my other family members (mothers side) have gone abroad and are in their 30's, unmarried. So my parents are like no, okhane gele settle kore felba. They didnt even let my older brother go at first, now hes aiming for masters in USA.\nme personally, i dont wanna settle abroad EVER cz i dont think ill ever get to live like that without my family. but all my friends talk about going abroad and pursuing higher studies, and i wanna do that too. How do I explain it to my parents, not now, but in the future. Cz they also prioritize marriage ALOT. I deserve to fulfill my dreams right?",
  "votes": "18",
  "comments": [
    {
      "text": "As an older ‘apu’ abroad, please please do not prioritize or rush into mariage. Education and the right to be financially independent is worth rebelling for. The single most important thing a girl can do for herself is to be educated, have a job and not be beholden to anyone. It will make you a better partner and mother.\nI would suggest looking at your options, applying places, and if you get in then have discussions with your parents. Which schools are you interested in? What are your grades like? Good luck!",
      "votes": "20",
      "replies": [
        {
          "text": "Beautifully said! And I 💯 agree",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "you can opt to go for countries where its not possible to settle like malaysia, uk. I personally studied abroad and came back but however, most poeople do not! Because ones you get to experience the \"bataash\" of independence there is no coming back",
      "votes": "4",
      "replies": [
        {
          "text": "agreed and crazy how a bengali mentioned the uk lol. Although i totally agree with you. But most of the poeple out there dont.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Checkout r/TwoXBengali",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Go for the USA after Bachelor. Your brother would be there, and I'm sure your family would agree. Honestly it's better to settle abroad and they have a huge Bengali community there.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Bhai amr parents o almost jaite dey nai. But desh er jaa obostha, retrospectively my parents are glad that they let me study abroad. So you can try convincing your parents by pointing out the fuckfest the country is in.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Brownies love marriages. Don't understand why is it so imperative.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Getting married in your late 20's is good in some sense.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 85
}