{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pc1cwi/tarique_rahman_thanks_global_leaders_friends_for/",
  "hash": "76239b40e1b44a3bcd7c530cbf7dd350",
  "scraped_at": "2025-12-08T11:40:09.289055",
  "title": "Tarique Rahman thanks global leaders, friends for support for Khaleda Zia",
  "description": null,
  "votes": "8",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "He's busy thanking important global people and friends about his mother instead of visiting her? Surely someone from his family can visit her at this time, right? Like his daughter or wife or others. The party officials are visiting her. They're not her family.\nWhat else is he going to waste time on next? Another recycled news announcement from his PR team that he'll visit her \"soon\"?",
      "votes": "5",
      "replies": []
    },
    {
      "text": "ছেলে আগুনের গোলা। মা মরে যাচ্ছে, কিন্তু ছেলে এখনও ফেইসবুকে। বাহ",
      "votes": "4",
      "replies": [
        {
          "text": "There is a rumor that Khaleda Zia has passed away, it will be announced on Dec 16 to make it her death anniversary instead of victory day. ( like her birthday). I hope bnp won’t go down that low and she survives and come back to reign on bnp.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "What a clown.\nAs if it's only due diligence with words. No action from him. Is he selling all this drama?",
      "votes": "-1",
      "replies": []
    },
    {
      "text": "",
      "votes": "-3",
      "replies": [
        {
          "text": "Bhai, she's sick,stop this bullshit.",
          "votes": "2",
          "replies": []
        },
        {
          "text": "Have some respect, she created the country we call Bangladesh.",
          "votes": "-2",
          "replies": [
            {
              "text": "I had no idea khaleda zia led the liberation war 🤯",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Read more: https://www.tbsnews.net/bangladesh/politics/tarique-rahman-thanks-global-leaders-friends-support-khaleda-zia-1299881",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Tarek is thinking international attention would benefit in the election rather reforming his party. With such crime rates and criminal oh no street thugs how he would rule ppl. Rather these thugs will rule his party",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 86
}