{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pgoema/about_1971_and_the_twisting_of_numbers/",
  "hash": "3752f40da424ffb4704c99564155a733",
  "scraped_at": "2025-12-08T11:18:15.327970",
  "title": "About 1971 and the twisting of numbers.",
  "description": "We have seen a explosion of intellectuals on YouTube and other social media platforms that claim that only around 2,000 /7,000/19,000 or just thousands of Bengalis had died in the 1971 war. And that all other numbers are \"propaganda\". Before the fall of Awami League,it was around 300,000 by the same group.\nNow,I intend to dispute these claims using sources and logical arguments.\nFirst of all,around 10 MILLION people took refuge from Bangladesh to India during the 1971 war. You think 10 MILLION people from a country 70 million people would take refuge if this was a \"short,neglible war?\". Even the civil war in Syria where multiple factions had fought in had around 4.5 million refugees as of 2025,even though the war was around decade long. And this itself has around 600,000+ casualties.\nSo,for 10 million to flee within 9 months of 1971 means there must be huge ,large scale operations against the public which certainly puts the death toll at 500,000+ easily. This was reported by the US State Department,books as in \"Bangladesh,A Country Study\" which was published later in 1988. And many other estimations by the United Nations(UNHCR),IRC(International Red Cross)and other international organisations. I'm not even touching Indian sources till now.\nNext is the Archer Blood in his letters to the US Consul(Blood Telegram),that Pakistani Army was committing actions that amount to \"genocide.\" British Foreign Office(FO)Reports that talk in detail about hundreds of thousands of people being killed by the Pakistani Army in Bangladesh.",
  "votes": "37",
  "comments": [
    {
      "text": "Soon it will be none. No one died in 1971, they already changed the term \"Liberation war\" in the textbooks. Now it is called প্রতিরোধ যুদ্ধ।",
      "votes": "24",
      "replies": [
        {
          "text": "Wtf seriously!?",
          "votes": "7",
          "replies": [
            {
              "text": "",
              "votes": "6",
              "replies": []
            }
          ]
        },
        {
          "text": "soon it will be only Bihari died (no doubt there had been casualties)",
          "votes": "6",
          "replies": [
            {
              "text": "They only raise up the issue of Biharis not with a good intent,but to delegitimize 1971",
              "votes": "8",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I appreciate your effort and sentiment and I do agree that we should not disrespect the martyrs. Moreover, you are correct when you say that the people who undermines the death count often wishes to undermine or discredit 1971 which is reprehensible.\nHowever, the arguments you made are not very convincing or logical. For instance, you cannot accurately estimate the number of deaths from the number of refugees. There are tons of other factors. Nevertheless, it can be a good measure to get a rough idea or lower bound, but from an academic standpoint this is still flawed.\nI know I shared this before many times, but I would encourage anyone willing to study the death count academically to look at David Bergman's analysis. The truth is that we simply don't have reliable data and statistics to make an accurate estimate. More research needs to be done on this.",
      "votes": "8",
      "replies": [
        {
          "text": "It's an interesting read. My aim however was to counter what some anti-liberation forces have been saying over the past couple of months on social media:\"Not many people died in 1971 war.\" This does nothing but serves their interest and whitewash them of any complicity in the 1971. I don't think the figure could be as high as 3 million but it could not be as low as 2,000/7,000/19,000 etc. 10 million wouldn't flee if such small violence had happened that too within 9 months. Syria refugee crisis had created 4.5 million refugees and around 600,000 people were killed over the span of 13 years",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "I also want to add: ISI has historically (though different factions have different agendas) been involved with LeT, JeM, HuJi and taliban. This is an intelligence agency involved with terror groups whose functions are to destabilize india and afghanistan. If that's not enough, look up how lyari gangs were involved in politics and how MQM (for mujajjirs) operated against other ethnic-gangs who also backed politicans and political parties (bhutto family). Tikka khan the same general that committed a genocide in bangladesh, also betrayed the baloch people shortly after the bangladesh liberation war. I bring this up is because I want to exemplify how they dehumanize and don't care about human life.\nAlso:\n\"In 2015, a Pakistani diplomat (attaché) at the High Commission in Dhaka, Mohammad Mazhar Khan, was recalled after Bangladeshi authorities accused him of financing extremist groups (such as Jamaat‑ul‑Mujahideen Bangladesh — JMB, and other Islamist groups). The Diplomat+2Dawn+2\nAnother Pakistani diplomat, Farina Arshad (a second secretary, political), was also withdrawn in 2015 following allegations that she was involved in terror-financing in Bangladesh. The Daily Star+2Hindustan Times+2\nThese cases involved “diplomatic staff,” not high-level political ministers, and were treated as individual wrongdoing (alleged terror financing / bogus currency / extremist links), not as official acts by the Pakistani government.\" These foreign ministers some of who don't wear the hijab funded terror groups that led to bombings in bangladesh. Goes to show you, islam is only used for evil, but NEVER good.\nKeep in mind Bangladesh is a MUSLIM country. They don't value human life aside from their own. They haven't then, they are not going to change now. I added these facts to exemplify how twisted they are and can be. There's something wrong with the core culture of their nation if government administration is intertwined with terror or gang groups and they don't even spare innocent muslims. You can imagine why indians hate them.\nAlso, they bring this mentality to the west. I don't want to get into the way these people think but usually they try and form groups to secure their identity, police others, and often position themselves as superior. Bengali muslims for example, to them are seen as something to \"preserve,\" occasionally assimilate, but NEVER to respect. I don't know if this mentality spans from how they used to operate in pakistan but I've actually seen it in my own life. They look at us as a blank slate. For reference, I was friends with these girls from karachi since I was young. Well her parents always looked at me like I was this kind harmless individual and well, I was. They even thought, their daughters should have friends like me. But then I soon realized, how they subtly but surely tried to convince me against my own people and culture while also subtly never wanting me to do better or express my individuality or femininity. Like, insulting a known mukti bahini in town, calling his daughter kali and a monkey in front of me, trying to talk to me about politics extensively, and mock how bengalis tore down the mukti bahini statue, say things like \"what's with bengali girls\" the moment I express any form of desire towards a hot man like any heterosexual girl is supposed to, mocking a traumatized bengali girl who became a musician and implying she has little values and a slut, and even saying some bengali girl dated an afghan guy so her kids are lighter while obsessing over that girl, like they had an issue when a lebonese man hit on me or looked down on it. They even try to make bengalis speak urdu, and then get mad when they don't know how to. I ended up ghosting them, but since then, they've been harassing me from fake numbers. They don't even leave their own alone. They tried to get some pk girl drunk to lose her innocence because she's prettier than them. For reference, every year they embarass themselves, trying to give gifts and unite with another bengali girl they call kali, talk shit about how she married an afghan to lighten future generations, and talk shit about her father, while using other light skinned bengalis (me or another girl that's lighter) to guilt about the things \"bengalis do.\"\nP.s sorry for my rant session, but if you want to know what they're really like and the mentality that they have imported from pakistan. The coersion, lies, manipulation, acting like they are a part of a gang or a cult, they look at us as either racially inferior or a blank slate they can project and mold..it's very important to exemplify how that looks like.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Sadly , no matter how much proof you give the people who want to believe the rajakars will not believe the proof. This is a rising problem recently that is not only done by the rajakars but almost everyone even a lot in this group who clearly hate the rajakars. If you give any proof the best case scenario you'd be ignored (or silently downvoted in case of Reddit, notice your own proof only like one person who didn't avree with you gave an counterargument) if you ask for proof from them they would say stuff like \"research it yourself\" ,\"open your eyes\" (I personally have been compared to an soyjack meme of asking proof of gravity which mind you is also very easy to give too) also these people even would go as far as calling you an agent of their opposition.\nSadly we have long since passed the age of debate decorum and showing proof of our claim. A fact that every single political party in our country can thrive on.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Tbh those claiming 300,00 just want to minimize the crime.\nFinding a realistic figure is a challenge but from a population Econ point of view our population would be much higher if the figure was not in the millions (calculating the growth rates of similar countries during that time and using a synthetic control measure). Further, we have to consider people who died from hunger, disease suicide, etc due to war....",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "-9",
      "replies": [
        {
          "text": "whom should we blame? afganistan?",
          "votes": "4",
          "replies": [
            {
              "text": "Blame Indians. But blaming Pakistan ain't worth it. Look forward its 2025.",
              "votes": "-2",
              "replies": []
            }
          ]
        },
        {
          "text": "Gtfo dude",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "24 আহামরি কিছু না। বাংলায় গণ অভ্যুত্থান এর আগেও হয়েছে। কিছু মানুষ 24 এর অভ্যুত্থানের ব্যবসা করছে এই... সাধারণ মূর্খ অজ্ঞ ধর্মান্ধ মানুষ 24 খাচ্ছে এবং 71 এর বিরুদ্ধে খাচ্ছে তাই কিছু **** এইগুলিই খাওয়াচ্ছে আর নিজে লাভবান হচ্ছে",
      "votes": "1",
      "replies": []
    },
    {
      "text": "It is sad we have missing data on this topic and used by anti-liberation war forces to undermine death count of 1971. RIP to the heroes.\nNice to see a post about 1971 without bashing 2024. Thanks dude.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 9
}