{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pbssca/id_love_to_make_some_friends_from_bangladesh/",
  "hash": "21d9f99881c68c823cfdab2bbe8bad87",
  "scraped_at": "2025-12-08T11:41:32.191180",
  "title": "I'd love to make some friends from Bangladesh",
  "description": ".Hey everyone. I’m Bangladeshi by nationality, but I’ve been in the U.S. for 16+ years now. At this point I barely have any real ties left to Bangladesh. I have early childhood memories, but that’s about it.I never went back in 16 years . I still miss the country and the people, but honestly… I feel a little scared to approach Bangladeshis because I don’t feel “Bangladeshi enough” anymore. I’ve spent more than half my life outside the culture, so I’m sure there are a lot of nuances, habits, and mindsets I’m not used to anymore. That said, I’d love to connect with Bangladeshis living in Bangladesh. I’m so curious about what life there looks like now — work, routines, lifestyle, the everyday stuff. It all feels familiar and foreign at the same time. If anyone is open-minded and doesn’t mind chatting or answering random questions about life back home, I’d genuinely love to be friends and learn. Thanks in advance ❤️",
  "votes": "19",
  "comments": [
    {
      "text": "Just be careful who you pick. Good luck!",
      "votes": "4",
      "replies": []
    },
    {
      "text": "you are welcome. You can make me your friend.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Do you know Sylvester Stallone or Arnold Schwarzenegger? If you don't, I have no desire to be your friend 😁",
      "votes": "2",
      "replies": [
        {
          "text": "Ofc I do",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Be careful, us Bd people can even stab you in the back or people might take advantage of you being from USA. Be it financially or other ways. Crabs in the bucket mentality.",
      "votes": "0",
      "replies": [
        {
          "text": "Thats really interesting .What kind of advantage is possible from an anonymous chat site ?",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "With pleasure",
      "votes": "1",
      "replies": []
    },
    {
      "text": "hiii, i can crack some good jokes :3 (plis make me your fren TwT)",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": [
        {
          "text": "Sure I'm all ears",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "16 yrs is a looooooong time. You'll get the hang of it, don't stress.\nBe mindful that negativity or pessimistic views are a part and parcel as a lot is happening.\nHowever, let's talk and find out. DM please.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "If you ever want to know about life in Bangladesh\nFrom village childhood memories to city life today, you’re welcome to knock me anytime. I’d be happy to share and chat",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Hey bro Bangladeshi here living abroad. Feel free to dm",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Hello Bro. Which district of Bangladesh is your family from?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "You cam definitely dm me anytime.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Are you in Us with your full family or alone? If some of your relatives still live here you can come to visit BD and see everything yourself.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Visa on arrival. Take a break from trump",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Yo I am from Rajshahi",
      "votes": "1",
      "replies": []
    },
    {
      "text": "You are welcome, feel free to knock",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Feel free to knock.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Ig better place would be discord.gg/Bangladesh vc's",
      "votes": "1",
      "replies": []
    },
    {
      "text": "What do you wanna know about Bangladesh? How about you dm me the questions, I'll share some photographs of my day to day life here in bd. Just wanna share my photography lol.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 91
}