{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pbpij1/helal_mia_said_we_are_now_afraid_and_not_singing/",
  "hash": "9a7913082f7fe1387c87de9577bfd908",
  "scraped_at": "2025-12-08T11:41:51.210037",
  "title": "Helal Mia said, \"We are now afraid and not singing here. Even though we've been singing for 50 vears, we haven't faced this before.\"",
  "description": "এবার ব্রাহ্মণবাড়িয়ায় দৃষ্টিপ্রতিবন্ধীদের গান গাওয়া বন্ধ!\nব্রাহ্মণবাড়িয়া শহরের পৌর মুক্তমঞ্চে প্রতিদিনই দেখা মিলত দৃষ্টিপ্রতিবন্ধী এই পরিবারের সদস্যদের। সেখানে বসেই তাঁরা গান গাইতেন। তাঁদের গান শুনে খুশি হয়ে শ্রোতারা টাকা দিতেন। গান গেয়ে পরিবারটির দিন চলত।\nদিনে আয় হতো দেড় হাজার থেকে সর্বোচ্চ পাঁচ হাজার টাকা পর্যন্ত। দৃষ্টিপ্রতিবন্ধী এই পরিবারের গান গাওয়া বন্ধ করে দেওয়া হয়েছে চার দিন আগে। অথচ এই স্থানে প্রায় ৫০ বছর ধরে এই পরিবারের লোকজন গান গেয়ে আসছিলেন। ১৩ সদস্যের পরিবারের প্রধান ব্যক্তি হেলাল মিয়া গতকাল শনিবার জানান, গত বুধবার তাঁরা প্রতিদিনের মতো গান করছিলেন।\nওই সময় কয়েকজন এসে গান গাইতে বাধা দেন। বাধাদানকারীরা জানান, যে দলই ক্ষমতায় আসুক, এখানে আর গান গাইতে দেওয়া হবে না। বাউলশিল্পী আবুল সরকারের কথাও ওই সময় বাধাদানকারীরা উল্লেখ করেন। পাশাপাশি তাঁদের ভিক্ষাবৃত্তি করে সংসার চালানোর পরামর্শ দেওয়া হয়। হেলাল মিয়া জানান, সেদিন বাউল আবুল সরকারের বিরুদ্ধে মিছিল শুনে গান বন্ধ রেখে বাদ্যযন্ত্র গুছিয়ে ফেলেন। দুপুর ১২টার পর বেশ কয়েকজন এসে এখানে আর যেন গান না করা হয় বলে যান। হেলাল পরে আশপাশের লোকজনের কাছ থেকে জানতে পারেন, তাঁরা মিছিলে অংশগ্রহণকারী হতে পারেন। জানা গেছে, ব্রাহ্মণবাড়িয়া সদর উপজেলার রাজঘর গ্রামের হেলালের পরিবারে মোট ১৩ জন সদস্য। এর মধ্যে ৯ জন দৃষ্টিপ্রতিবন্ধী।\nহেলাল পরিবারের সদস্যদের নিয়ে গান করে আসছেন। তাঁরা কারো কাছে হাত পাতেন না। গান গেয়ে যে আয় হয় তা দিয়ে চলে তাঁদের সংসার। এ নিয়ে চলতি মাসে কালের কণ্ঠে খবর প্রকাশসহ ডিজিটালে সংবাদ প্রচারিত হয়েছিল। ৬৫ বছর পেরোনো হেলাল সদর উপজেলার ভাটপাড়ার গানের শিল্পী শাহনূর শাহের কাছ থেকে সংগীতে প্রশিক্ষণ নিয়েছিলেন। মাত্র ১০ থেকে ১২ বছর বয়স থেকেই গান শুরু করেন। পরে ছেলেমেয়েদেরও গান শেখান। হেলাল বলেন, ‘আমরা ভয়ে এখন এখানে গান করছি না। ৫০ বছর ধরে গান গাইলেও এমন হয়নি। এখন এমন কোনো জায়গাও পাচ্ছি না যে গান গাইব। গান গেয়ে আয় করতে না পারলে আমাদের সংসার চালানো কঠিন হয়ে পড়বে।’",
  "votes": "108",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Look what they've done to our already fragile country",
      "votes": "23",
      "replies": []
    },
    {
      "text": "Every time I hear such news I run out of words to curse this damned government for enabling and harboring the mob and far-right crowd. History will remember and they will face the consequences for their actions one day.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "islamic emirate of Banglastan !!!",
      "votes": "5",
      "replies": []
    }
  ],
  "id": 92
}