{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pb8ve9/what_we_know_about_the_recent_report_on_the_bdr/",
  "hash": "a58a76297043d5e6c75ecbcc6dc18e43",
  "scraped_at": "2025-12-08T11:43:30.538607",
  "title": "What we know about the recent report on the BDR massacre (2009)",
  "description": "The National Independent Investigation Commission, which was formed to reinvestigate the 2009 massacre at the BDR (now BGB) headquarters in Pilkhana, has found that then-ruling Awami League and strong evidence of external forces' involvement.\nInvolvement of the then-Awami League Government: \nThe 2009 killings were not a spontaneous mutiny but a premeditated massacre/conspiracy. The report alleges the then-Awami League government was directly involved in the mutiny and the subsequent cover-up. The entire incident was given the 'green signal' by former Prime Minister Sheikh Hasina. Former MP Sheikh Fazle Noor Taposh was named as the \"principal coordinator\" of the killings, acting \"at the behest\" of Sheikh Hasina. Awami League is alleged to have played a direct role in protecting those involved in the murder, with claims that a procession of 20-25 people entered Pilkhana and emerged with over two hundred, implying the escape of mutineers.\nStrong Evidence of External Force:\nThe investigation found strong evidence of direct involvement of an external force in the BDR killings, with the commission chief explicitly naming India and accusing it of working to \"weaken the Bangladesh Army\". The report highlighted a key piece of evidence: of the 921 Indian citizens who entered Bangladesh before and after the BDR massacre, the immigration police have no record of 65 ever leaving the country.",
  "votes": "71",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "২৬ লাখের সাথে তারা মিলিয়ে গেছে।",
      "votes": "12",
      "replies": []
    },
    {
      "text": "ছাব্বিশ লাখেরও হদিস নাই",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Sheikh Hasina and India are involved in the Peelkhana murder. Since this has been written in the investigation, please cancel all the agreements made by Sheikh Hasina with India. This will be a perfect revenge on Sheikh Hasina and India. Although it will never happen. Because every time after these talks a message is given to India through diplomatic channels. \"Eigula internal political requirements er jonno boli but we don't mean it. Beparta compassionate view te dekhun\".",
      "votes": "20",
      "replies": [
        {
          "text": "",
          "votes": "2",
          "replies": [
            {
              "text": "So either apne upor er commenter re dox korlen or boltesen they cannot even have an original idea, paraphrase o korte partese nah bhai.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "International court এ কেস করা উচিত ইনটেরিম গভর্নমেন্ট এর।",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Indian bot gula ki downvote martase naki...",
      "votes": "17",
      "replies": [
        {
          "text": "Areh bhai chinta koiro nah, oigula shob amader desher e manush jon. Although recently bere gese.",
          "votes": "5",
          "replies": [
            {
              "text": "Basically indian bot, just location ei desh e.",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "The current government is weird these days. Someday they may even say that Sheikh Hasina was behind the assassination of Sheikh Mujib for power.",
      "votes": "8",
      "replies": [
        {
          "text": "Don't give them ideas now 😷",
          "votes": "10",
          "replies": [
            {
              "text": "Some people will believe it without asking any counter question!",
              "votes": "10",
              "replies": []
            }
          ]
        },
        {
          "text": "The current government has marked all the boxes of \"Guilty until proven\" for Hasina but people love to exaggerate everything",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Only? I thought it was 26 Lakh Indian in Bangladesh!",
      "votes": "3",
      "replies": []
    },
    {
      "text": "ভুয়া সরকারের ভুয়া কোর্টের ভুয়া finding। এই টা যদি সত্যি হয় তাহলে ভারতের বিরুদ্ধে international কোর্টে কমপ্লেইন করুন। ভারতের সাথে যতো ট্রিটিস আছে সব cancel করুন। কিছু হবেনা বরং উল্টো ভারতের চাল সিঙ্গাপুরের মাধ্যমে বেশি দাম দিয়ে কিনেন। এই হচ্ছে আমাদের মাদ্রাসা এবং মেধাবী লাল বদর দের intelligence।",
      "votes": "4",
      "replies": [
        {
          "text": "Tomar balbotor er buddhi toh onek unnoto je india er moto nikrishto desh er kase nijer desh beicha dileo tomader kisu aibo jaibo na.",
          "votes": "5",
          "replies": [
            {
              "text": "ভাই কত টাকা দিয়ে আবার বাই ব্যাক করছেন?",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Some people worship this nation so hard that they will deny anything that proves their Provus are wrong.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Things dont add up. Whenever u talk about army, there are adjectives like 'brilliant','heroic', 'patriot' etc etc. If they were so intelligent, so brave, so heroic, how couldn’t they save their officers from jawans!! Things really dont add up. If the intelligence is so good(remember most of the higher post of intel agencies are taken up by military personal), why do we have so many incidents where intel failed. I wont extend. But the hint is there. You cant have all those adjectives and still be a pussy! No achievements whatsoever.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "১২২১ জনের নাম দিন। যে ৬৫ জন বের হয়নি তাদের ও নাম দিন। ইন্টারন্যাশনাল কোর্টে প্রমাণ সহ মামলা করুন। শুধু দাবী করতে চাইলে অনেক কিছুই দাবী করা যায়।",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "-22",
      "replies": [
        {
          "text": "What a ragebait",
          "votes": "7",
          "replies": [
            {
              "text": "Brainless one",
              "votes": "0",
              "replies": []
            }
          ]
        },
        {
          "text": "Dorkar o nai, shomokami niya gayndia jaoga, oikhane eishob baal saal legal.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": ":This chapter doesn’t offer a detailed political history of these two decades. Instead, it focuses on two specific moments that were pivotal in shaping the geopolitics of India’s near east. First was the February 2009 BDR revolt and India’s response. This incident and how India tackled it explains why and how Hasina took an authoritarian turn to counter religious radicalism and her civilian opponents. Concerned about Hasina’s physical safety and politicalsurvival, India almost militarily intervened in Bangladesh in 2009. Based on primary interviews, this section recreates this moment and outlines why India responded with such urgency and anxiety. The second section unpacks India’s response to the ‘2007–08 Saffron Revolution’ in Myanmar when Buddhist monks protested against the junta, attracting crackdown. Unlike Bangladesh, where India threatened intervention, New Delhi did nothing in Myanmar. The 2008 reforms vindicated India’s decision (falsely, in retrospect) to opt for restraint towards Naypyidaw.\" -Avinash Paliwal, INDIA’S NEAR EAST, A NEW HISTORY. JULY 25, 2024",
      "votes": "-1",
      "replies": []
    },
    {
      "text": "তাদের খুঁজে বের করতে না পারলে এই দেশের বিচার ব্যবস্থা, ইন্টেলিজেন্স, পুলিশের কোনো যোগ্যতা নাই মুখে বড় বড় কথা বলার।",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 98
}