{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pb8eya/tareq_zia_still_not_back/",
  "hash": "7f67540d4dc41091028b3a7c15695285",
  "scraped_at": "2025-12-08T11:43:50.546502",
  "title": "Tareq Zia… still not back?",
  "description": "Why the coyness? Why not clearly state the reasons? What could possibly be holding him back EVEN NOW?",
  "votes": "9",
  "comments": [
    {
      "text": "ভাইয়া আর্মির সাথে বেয়াদবি করতেন কিন্তু ভাইয়া ভুলে গেছেন উনার বাবার ঐতিহ্যই ধরে রেখেছে আর্মি। বাংলাদেশের আর্মির আসল চেটের বাল ছিরার ক্ষমতা নাই তাই এদের ইগো অনেক। তাই কথায় কথায় অভ্যুত্থান করে এরা বড় ভাই ফাকিস্তানীদের মত। তো ভাইয়ার এসব আকাম আর্মীরে চর থাপ্পড় মারা, আর হাওয়া ভবন বাংলা ভাই গ্রেনেড হামলা সেগুলা আর নাই বললাম, আর্মির কাছে এর জন্যই উনি মাইর খেয়ে মাজা ভেঙে মার ভিক্ষাতে লন্ডনে কোনরকম জান নিয়ে পালিয়েছিলেন। সেই রাগে ক্ষোভে ভাইয়া এখনো আর্মিকে বিশ্বাস করেনা। হয়তো হাসিনার মতো প্রতিশোধও নিতে চায়। আর্মি সেটা জানে তাই আসতে দেয়না। আকাম কুকামের জন্য আন্তর্জাতিক মহলও তাকে পছন্দ করেনা। আর আমাদের তো আছে আন্তর্জাতিক চাপাবাজ প্রেজেন্টেশন নোবেল ম্যান যিনি আজকাল জামাতকে কোনোভাবে ১৫১ টা সিট দিয়ে গদী ছাড়েন। আর এই কুকাম করার জন্য তো গিয়ার সৈনিক চাঁদা তুলে দৈনিক আছেই। যারা পারলে দৌলতদিয়ার মেয়েদের থেকেও চাঁদা তুলে লন্ডন পাঠানোর জন্য। তারেক ভাইয়ার এটাও ভয় আছে যদি উনি ব্রিটেনের রিফিউজি স্ট্যাটাস ছেড়ে চলে আসেন প্রধানমন্ত্রী হবার আশায় তারপর দেখেন তার বাবার প্রতিচ্ছবি তার হো মা সা করে দিয়েছেন তাইলে তো আম ছালা সব গেলো।",
      "votes": "5",
      "replies": []
    },
    {
      "text": "ভাইয়ার আগে আপা এসে পরবে এখন দেখে যা লাগছে।",
      "votes": "3",
      "replies": []
    },
    {
      "text": "The BNP's strategy is to win the national election using the hype that will be generated upon Tarique's return. One of their central leaders(cant remember name) has said a few months ago that half of their campaign will be completed when Tarique finally arrives here. That means if he returns too early, the hype will fade by the time of the election.",
      "votes": "10",
      "replies": [
        {
          "text": "Sacrificing the last chance to meet your mother just to adhere to your campaign strategy. 🤔",
          "votes": "20",
          "replies": [
            {
              "text": "His mother probably wants it too. I mean, she probably wants to see her son for the last time, but not at the cost of her son losing the job of the Prime Minister.",
              "votes": "6",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "মাইনাস টু",
      "votes": "2",
      "replies": []
    },
    {
      "text": "BNP planned on two things to create a hype. One was a speech by BKZ and the other was the return of TZ after formal announcement of the elections.\nThis plan has been thrown into disarray due to BKZ’s failing health and BNP, being extremely dysfunctional, can’t even figure out how to react to the current situation.\nAdded to this issue is the fact that BNP applied to the government a few weeks ago to import bulletproof vehicles for TZ and the vehicles have not arrived yet. BNP should have imported the cars months ago but in typical BNP fashion, they did not.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Bro I swear to God, if his mother could die any minute and bro is not coming back based on fear or whatever , bro is too pussy and will never ever get a vote from anyone. If he comes back now and government jails him or if opps take him out he will be immortalized and BNP will get a landslide victory. But his mother dies even he comes back he looks incompetent posh boi who hid in England while his mother took all the heat for him and his brother.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "In 2013/14 before the election, BNP was so sure of league collapse, their senior leaders started distributing cabinets among themselves. 🤣 After the loss of congress in India, they started distributing sweets for Modi. 🤣🤣 May be we will see the repetition of history again from BNP.",
      "votes": "-3",
      "replies": []
    },
    {
      "text": "Isn't it strange there is no news of him or his British lawyer daughter Zaima visiting Mrs Khaleda Zia? How long will it be?\nNone of them can visit her but they would readily hop on a plane in a heartbeat to meet Trump or attend another Christian z i o n i s t prayer breakfast or other event?",
      "votes": "-4",
      "replies": [
        {
          "text": "Zubaida Rahman visited Bangladesh about six months ago. Then she returned to London.",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "Why I'm seeing so many tareq zia not back recently? Yes, this has been a lingering topic, but I'm sure I have seen same type of post at least 10 times in various sub reddits these two days. Ami I missing something? Is it about the declining health of Khaleda Zia?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "জেলের ভাতের এতো ভয়...",
      "votes": "2",
      "replies": [
        {
          "text": "Erokom kolija ekhon karo nai je unake Jail e bhorbe.",
          "votes": "1",
          "replies": [
            {
              "text": "তাই নাকি?",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 99
}