{
  "url": "https://www.reddit.com/r/bangladesh/comments/1hxxf79/why_government_unable_stop_attack_on_200_year_old/",
  "hash": "1e6b3b9a8531b2637c7c55403f55a81f",
  "scraped_at": "2025-12-10T02:30:30.069450",
  "title": "Why government unable stop attack on 200 year old মাজার",
  "description": "সমকাল newspaper Friday 10 January 2025",
  "votes": "77",
  "comments": [
    {
      "text": "Unable na, doesnt want to.",
      "votes": "20",
      "replies": []
    },
    {
      "text": "Judging from this thread, Al Botor Bahini has launched new branch on reddit.",
      "votes": "25",
      "replies": [
        {
          "text": "e-bodor",
          "votes": "10",
          "replies": []
        },
        {
          "text": "পাকিস্তানি কুত্তা বাহিনী।",
          "votes": "5",
          "replies": []
        },
        {
          "text": "are they on reddit too? fuck!",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Our madrasa population is huge,they are misguided easily in the name of religion, and their leaders(dhormobebshayis) accomplish their personal agenda and act like it's their divine duty to destroy mazars. Recently, they have been on a mission to brain wash college going students.(some days earlier NDC students unknowingly promoted militancy by carrying a certain flag which contained the first kalma of Islam,not knowing that it's not the kalma but the flag which they are promoting)",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Why do people in bd so obsessed with majar, I have been to the grave of few prophet in oman(site seeing), people treat it as normal grave, let me state a fact- \"going to majar is ok ,if you are praying for the deceased person so that God make it easy for him, but if you think going to majar to pray for yourself than it becomes shirk, you guys are doing the same mistake as the people of nuh \"they exaggerated the status of five righteous from their ranks,later on started mazar+idol worship\" .prophet yousuf was kept in prison for longer by god because instead of asking God for freedom, he has asked a fellow prisoner who was about to get free to ask the king for his freedom. If you can ask God directly 🤷 why go to a middle man ?",
      "votes": "3",
      "replies": [
        {
          "text": "I don't think most people here cares about any of this. Shirk or not, the point is that no one gives someone the right to vandalize and break shrines. If you don't believe in it, that's perfectly fine. Just don't go to those places. Heck, even create social awareness. But under no circumstances should breaking and vandalizing be tolerated. But this has been going on for a while and it's damn concerning.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-6",
      "replies": [
        {
          "text": "majar puja kora haram. Islam e Gorib er jonne ek rokom ar borolok er jonne arekrokom eirokom kono system nai.",
          "votes": "18",
          "replies": [
            {
              "text": "Islam e “sud khawa” -o haram, konodin bank vangte dekhsen? Islam e “ghush khawa” - o haram, konodin secretariat ba ministry vangte dekhsen?\nBaler dhormo sikhate aisen na. Dinseshe gorib ar dhonir Islam aladai! Fao alap korte aisen, mia!",
              "votes": "35",
              "replies": []
            },
            {
              "text": "So you break them? What's Haram to you may not be Haram to someone else. Many people who claims to be Muslims also go to these shrines. You don't have any right or reason to call yourself a \"true Muslim\" and make things Haram for the others.",
              "votes": "7",
              "replies": []
            },
            {
              "text": "হারাম হইলে হইসে, আপনের কৃমি কামড়ায় কেন? যদি এই হারাম কাজ করলে তারা অমুসলিম হয়ে যায়, যাক না। এই দেশ তো শুধু মুসলিমদের না।",
              "votes": "7",
              "replies": []
            },
            {
              "text": "খ্রিষ্টানদের মতে ভন্ড প্রফেট মোহাম্মদ এর অনুসরণ হারাম। তাই বলে সব মসজিদ গুড়িয়ে দিতে হবে?",
              "votes": "9",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Majars are mostly the ground of many unethical doings. Do not want to talk about what is halal or haram, but there is a Grey business grown around every single majar in BD. Police and local government get benefits from these businesses, and it's high time those should've been stopped. Since the government has been a failure to put a stop to these, they just do not want to bother now either.\nThe real question remains: What will the worshippers do after their market has been vandalized? Will they start a new business that doesn't go against ethics? I highly doubt that.",
      "votes": "1",
      "replies": [
        {
          "text": "By the same logic, should we stop Madrasahs as they are the breeding ground for many unethical things and abuse?\nIf there are some unethical things going on, the government should take specific actions against those. If they are unable to, they cannot promote vandalism and mobocracy. It creates an even worse problem.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Mazars shouldn't be broken\nRather they should be preserved as a cultural heritage\nStop people form worshipping them\nThis is coming from a practicing Muslim",
      "votes": "-4",
      "replies": [
        {
          "text": "Who the hell are you to stop people from worshiping who they want?!? Like who the hell are you?!??",
          "votes": "9",
          "replies": []
        },
        {
          "text": "Who are you to stop people worshiping whatever the fu_k they want?",
          "votes": "11",
          "replies": []
        },
        {
          "text": "This is coming from a practicing Muslim.\nA practicing muslim yet unwilling to obey the prophet's commands? Please fix the error of your ways. May Allah guide you☝🏻\nFrom Sahih Muslim 969:\n\"Should I not send you on the same mission as Allah's Messenger (ﷺ) sent me? Do not leave an image without obliterating it, or a high grave without levelling It.\"",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-49",
      "replies": [
        {
          "text": null,
          "votes": "33",
          "replies": []
        }
      ]
    }
  ],
  "id": 102
}