{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ht9vc8/flying_drone_in_bangladesh/",
  "hash": "0579deddd5c38958b11063822ac38f3d",
  "scraped_at": "2025-12-10T02:30:50.367706",
  "title": "Flying drone in Bangladesh",
  "description": "Hello all,\nGoing to be visiting next month from the UK, will mainly be in the villages rather the built up areas/ city - outskirts of Sylhet.\nI have a DJI Mavic Mini (first gen) 249g I just wanted to know if anyone has had any issues flying their drone\nJust hoping someone can help as online nothing is really clear. Some say I need to contact CAAB beforehand and get authorisation. Some say private / visitors there's no issues - just the usual don't fly above people / near infrastructures.\nIn the UK I have my CAA permit for both operator and flyer.",
  "votes": "3",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Hi, were able to bring it. Did you face any problems at Dhaka airport, any need for doccuments etc. Please let me know i also want to bring my mini from Ireland to bd for holidays",
      "votes": "1",
      "replies": [
        {
          "text": "Hi, I took it to Sylhet airport. I ended up putting it in main luggage - just kept anything battery related with me. Didn't have any issues. Whilst at Sylhet I did see few people have it on hand luggage and nothing was asked of them. I had no paperwork either",
          "votes": "1",
          "replies": [
            {
              "text": "Thanks. I'm going through Ireland , UK, Turkey then to Bd . They all said its OK but I'm not sure about Bangladesh. Anyone went through Dhaka international airport before. Would appreciated if someone has experience, thanks.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Yes can please also let me know for Dhaka aiport. My flights this month. Please let me know, thankss",
      "votes": "1",
      "replies": [
        {
          "text": "Same",
          "votes": "1",
          "replies": [
            {
              "text": "Why does no one answer , has no one ever brought a drone to bangladesh??",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "I came to bangladesh couple days ago from the uk and ai had no problem with bringing the drone, i had it in my carryon bag, didnt need any documents and they didnt even ask for what i had inside the bag. Hopefully that helps",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 103
}