{
  "url": "https://www.reddit.com/r/bangladesh/comments/1hea5l2/do_not_buy_gift_cards_steam_google_apple_etc_from/",
  "hash": "8439710632ff078d711420443f86408e",
  "scraped_at": "2025-12-10T02:32:07.452761",
  "title": "DO NOT buy gift cards (steam, google, apple etc.) from FB pages",
  "description": "t. victim of a scam\nI was looking for google play gift cards from Facebook pages. Reminiscing my netflix subscription days, I searched \"gift cards\" on Facebook. The top suggestion showed the page \"Gift Card Center BD\". The page had decent number of likes, but I knew likes can be bought. However the page looked very professional, the posts had a lot of reacts and comments from legit pfp and names asking \"____ card ki available?\" and something similar. And also some accounts of successful purchases. The page even ran ads on their posts. The posts looked very professional like they were creating engaging posts as if they are some business and not some poorly designed A.I. slop.\nSo I sent him a WhatsApp message asking whether $5 cards were available. He initially insisted, but soon as I gave him the payment he started stalling. He called saying that they were out of stock, and to consider $10 gift cards instead. He really pressed on me, and I gave in, as I really needed the gift card asap.\nThen he started stalling again. Now he started increasing his threshold. Now he's requesting for me to buy $20 gift cards as now the $10 were out of stock. I asked him for a refund, but he keeps stalling and delaying with various elaborate excuses.\nI was actually in a rush to buy those gift cards so I really didn't think it through when picking this page. Now I looked up the page again, and I looked at the profiles making those comments. All of them had 2-5 friends, or were pages with 0 likes. Then I looked at the results after googling the page, and after a lot of scrolling I found another post from a group where the guy confirms that this is a scam. These expose posts had like 0 engagement so it was very difficult to find them on first glance.",
  "votes": "90711",
  "comments": [
    {
      "text": "ভোক্তা-অধিকারে অভিযোগ করে দেখতে পারেন।",
      "votes": null,
      "replies": []
    },
    {
      "text": "I got scammed from the same Page today.Looks like they have changed their name.I ordered a 30 Dollar gift card which is worth 3600 BDT and he did the same thing with me.",
      "votes": null,
      "replies": []
    }
  ],
  "id": 107
}