{
  "url": "https://www.reddit.com/r/bangladesh/comments/1h6cwfv/need_suggestions_on_how_to_help_my_best_friend/",
  "hash": "fa2a52ef28b1079c93c0d01898e3df93",
  "scraped_at": "2025-12-10T02:32:56.487197",
  "title": "Need suggestions on how to help my best friend about the legal ownership matter regarding his motorbike.",
  "description": "Hi, I am writing this post on behalf of a best friend of mine. I am an international student studying in Australia. I met my best friend while I was in Dhaka, Bangladesh. He is a shopkeeper so he is poor. But I have a very special bond with him since I was a child and by staying with him, I developed a lot of life skills, but he is not so good in technology so I want to help him, because he is like my brother to me. His problem is as follows- He bought a motorbike from bikroy.com with 80,000 BDT. Now the person from whom he bought the car was the second owner and not the original owner. When my friend bought the car from him, he said that he will change the name of the owner to my friend (declare him as the legal owner), but now he is not doing so. Now the validity of the route permit and tax document has expired and he doesn't know how to solve this problem and get his motorbike legally on the road again. Now can anyone please give me any suggestions about how to help him to solve this problem and help him get the legal rights to be legally able to get his motorbike which he bought with his own hard working money on the road again? Any advice or suggestions would be highly appreciated, thanks in advance.",
  "votes": "2",
  "comments": [
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 110
}