{
  "url": "https://www.reddit.com/r/bangladesh/comments/1gwvwxg/%E0%A6%A7%E0%A6%B0%E0%A6%AE%E0%A6%AF_%E0%A6%85%E0%A6%A8%E0%A6%AD%E0%A6%A4%E0%A6%A4_%E0%A6%86%E0%A6%98%E0%A6%A4%E0%A6%B0_%E0%A6%85%E0%A6%AA%E0%A6%B0%E0%A6%A7_%E0%A6%B6%E0%A6%B8%E0%A6%A4_%E0%A6%AC%E0%A7%9C%E0%A7%9F_%E0%A6%AE%E0%A6%A4%E0%A6%AF%E0%A6%A6%E0%A6%A3%E0%A6%A1_%E0%A6%95%E0%A6%B0%E0%A6%B0_%E0%A6%AA%E0%A6%B0%E0%A6%AE%E0%A6%B0%E0%A6%B6/",
  "hash": "3f3bed89940dda4b4e342018b64bcd0e",
  "scraped_at": "2025-12-10T02:33:44.676648",
  "title": "ধর্মীয় অনুভূতিতে আঘাতের অপরাধে শাস্তি বাড়িয়ে মৃত্যুদণ্ড করার পরামর্শ হাইকোর্টের",
  "description": null,
  "votes": "50",
  "comments": [
    {
      "text": "people who rape kids walk free while commiting blasphemy will get you killed. really shows where their priority lies.\npost from a month ago",
      "votes": "74",
      "replies": [
        {
          "text": "Just shows how far behind the times we actually are.",
          "votes": "9",
          "replies": []
        }
      ]
    },
    {
      "text": "Highcourt bd border er 8km porjonto militaryr area bananor suggestion disilo. Eshob shune mone hoy judge gula oshikkhito protibondhi.",
      "votes": "42",
      "replies": []
    },
    {
      "text": "kemon skibidi marka law",
      "votes": "25",
      "replies": []
    },
    {
      "text": "Those who do violent acts because their feelings got hurt should be given the death sentence first.",
      "votes": "23",
      "replies": []
    },
    {
      "text": "Wtf even rapist and corrupt people walk freely, how about 10-20 year imprisonment for corruption by government officials, that probably isnt priority, all u need is some example cases to stop corruption in this country but in reality they are happy with status quo, u hurt my feelings now guess what death penalty for u too",
      "votes": "17",
      "replies": []
    },
    {
      "text": "Judicial activism chudina. Jei tuk toder kaaj oituk kor jojer polara",
      "votes": "10",
      "replies": []
    },
    {
      "text": "এই বিচারকগুলো আসলে রাম ছাগল। বাংলাদেশের বিচারক নিয়োগের প্রক্রিয়াও এমন। পুরোটাই মুখস্ত নির্ভর। যে যতটা আইন মুখস্ত রাখতে পারবে তার বিচারক হওয়ার সম্ভাবনা অনেক বেশি। সে ব্যক্তি আসলে ভেতরে রামছাগল কি না, সে আইনের বইয়ের বাইরে আর কিছুতে সামান্যতম জ্ঞান রাখে কি না ডাজেন্ট ম্যাটার।",
      "votes": "10",
      "replies": []
    },
    {
      "text": "Rules for thee, but not for me.\nদেখবেন, এই আইন শুধু ইসলামের অবমাননার ক্ষেত্রেই খাটবে। খোদা-রসুল, ধর্মগ্রন্থ এসবের বিরুদ্ধে বললেই আইনপ্রয়োগ হবে। কিন্তু অমুসলিমদের দেব-দেবী, ধর্মগ্রন্থ এসবকে নিয়ে ঘৃণাত্মক সব কথা বলা জায়েজ থাকবে।\nFor clarification, there should be no blasphemy laws anywhere in any legal code in plain 2024. This is absurd that we are even talking about something that should have been settled when the country was liberated.",
      "votes": "10",
      "replies": []
    },
    {
      "text": "",
      "votes": "19",
      "replies": []
    },
    {
      "text": "Who will distinguish between a আঘাত and a গঠনমূলক সমালোচনা? And when they say ধর্মীয়, do they really mean All the religions out there? Are they sure?",
      "votes": "6",
      "replies": []
    },
    {
      "text": "In Pakistan, blasphemy law is mostly used to settle scores with Hindus. I hope people wise up to these attempts to generate votes by appealing to religious sentiments.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Yasss kill me because i said zubair ponthi and shadponthi both of em are trash",
      "votes": "5",
      "replies": []
    },
    {
      "text": "We live in such a clown world I actually can see this getting approved for real.\nGuess we all gotta make alts to talk shit on mollas now",
      "votes": "9",
      "replies": []
    },
    {
      "text": "hasnat service agrees",
      "votes": "9",
      "replies": []
    },
    {
      "text": "কখনও মুক্তিযুদ্ধের চেতনা, কখনও ধর্মীয় অনুভূতি - এটাই বাংলাদেশ",
      "votes": "8",
      "replies": [
        {
          "text": "মুক্তিযুদ্ধের চেতনা does not intrude in my private lives, what I eat or drink or who I make love to or tells me that we will punish you for blasphemy. ধর্মীয় অনুভূতি does and does it with ideological backing. In a dichotomy the answer is easy.",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "Afaik, pakistan also has a blasphemy law. Our country can follow their law while implementing ours . what a great step forward !!! /s",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Shocking i wonder who made them happen, inbreeding of hujurs amd their lower class supppoter. Incapable of rational thinking.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Are all of them like Justice Maniyak?",
      "votes": "7",
      "replies": []
    },
    {
      "text": "\"পরামর্শ\"",
      "votes": "6",
      "replies": [
        {
          "text": "who provided this advice? the fucking high court of a country......",
          "votes": "10",
          "replies": []
        }
      ]
    },
    {
      "text": "One could argue the existence of high court itself is blasphemous to some people.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "how big of a fucking shithole even is bangladesh",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Is this applicable for all the religions?",
      "votes": "1",
      "replies": [
        {
          "text": "neh. only muslim's onuvuti matters",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "Is it for all religions though?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Keep crying Babies. This feels so good. 😂",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "welcome to bangla-stan 😁 zongi-land 🤘",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 113
}