{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ggl4bv/posting_here_so_people_have_clues_if_i_am_murdered/",
  "hash": "3828eb16b5b903c309dc673c2da622d9",
  "scraped_at": "2025-12-10T02:35:51.896235",
  "title": "Posting here so people have clues if I am Murdered",
  "description": "আমি যদি কোন ভাবে মারা যাই, হোক সেটা সাজানো এক্সিডেন্ট, আমাকে হত্যার জন্য আমার সৎ মা ও আমার পালক পিতা মাতা এবং এদের পরিবার দায়ী থাকবে।\nMy full story was published in r/Bangladesh -> https://www.reddit.com/r/bangladesh/s/Ft45RgTBFX\nI am Syed Rafat Hoq and I have graduated from Shahjalal University of Science and Technology, Sylhet in 2024. I am from Khulna, but currently living in Dhaka.\nMy foster parents and my step mother conspired together to scheme me out of my inherited property after both of my parents died at an early stage of my life. They did this by changing my name and putting foster parents' name as my real parents in all of my documents.\nআমার মা আমার জন্মের পরপরই মারা যান এবং আমার বাবা আমার 4-4.5 বছর বয়সে মারা যান। মা মারা যাওয়ার পর আমার বাবা আরেকটি বিয়ে করেন যেই ঘরে আমার একটি সৎ বোন হয়।\nএই গ্রুপ টি আমাকে মেন্টালি ও ফিজিকালি টর্চার করেছে অনেক ভাবে। আমার সকল বন্ধু বান্ধব কে (স্কুল ও ভার্সিটি) টাকা দিত আমার সাথে বিভিন্ন কাহিনী ও ঝামেলা করার জন্য যা ওদের অনেকেই এখন স্বীকার করেছে। তখন ওরা আসল কাহিনী জানত না কারণ আমি কখন বলতাম না। এছাড়াও আমাকে সব সময় ফলো করা, আমার খাবারে ওষুধ মিশানো, ছিনতাই কারী ভাড়া করা থেকে অসংখ্য কাজ করেছে।\nবাবা বেচে থাকতে আমি যেই বাসায় বড় হয়েছি, সেই বাসার ঠিকানাও আমি জানি। গ্র্যাজুয়েশন এর পর আমার পালক পিতা মাতা এই বাসায় এসেই উঠেছে, আমাকে বলেছে ভাড়া নিয়েছে। এই বাসা সহ আমার বাবার আরো অনেক সম্পত্তি রয়েছে, যা আমি এখন মোটামুটি নিশ্চিত। বাসাটি শহরের মধ্যেই (23, Musolmanpara Cross Road-1, Baniakhamar, Khulna Sadar, Khulna)",
  "votes": "57",
  "comments": [
    {
      "text": "I think you should do an expose post on Facebook and draw a huge attention. That'll put water on their plans.",
      "votes": "28",
      "replies": [
        {
          "text": "I will do that once I file the case. But confronting them directly before filing the case can be dangerous for me, which is why I still haven't taken it to Facebook.",
          "votes": "11",
          "replies": [
            {
              "text": "Make a video footage , and ask for them to share the link as much as possible, post the link here after done so, I’ll also share link.",
              "votes": "6",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Thats some serious shit man",
      "votes": "10",
      "replies": [
        {
          "text": "Yeah, I have went through quite a lot and still going through it, but I have grown strong enough after all these.",
          "votes": "4",
          "replies": [
            {
              "text": "Nice",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I will file a report, I'm just waiting for a job, any job. Getting away from them is not possible, I have tried but they just follow me everywhere. And, Yes I will also expose them as soon as I file the case. Thank you so much, may Allah bless you too.",
      "votes": "5",
      "replies": [
        {
          "text": "I will file a report, I'm just waiting for a job, any job. Getting away from them is not possible, I have tried but they just follow me everywhere. And, Yes I will also expose them as soon as I file the case. Thank you so much, may Allah bless you too.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "মামলা করেন। আপনার বন্ধুদের কথার প্রমাণ রাখেন ভিডিও/অডিও। আপনাকে পাগল প্রমাণের চেষ্টা করতে পারে।",
      "votes": "4",
      "replies": [
        {
          "text": "এইটা তারা করার চেষ্টা করবেই, তবে DNA Test করলেই ওদের ঐসব কথা বার্তার কোন দাম থাকবে না।",
          "votes": "2",
          "replies": [
            {
              "text": null,
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "If you immediately need a job, just join Augmedix Bangladesh or Apex DMIT. They pay well, but unfortunately, both these jobs are night shift job.",
      "votes": "2",
      "replies": [
        {
          "text": "Night shift isn't an issue. I will apply there, thanks.",
          "votes": "1",
          "replies": []
        },
        {
          "text": "Bro how to get the job. Can you give me an idea",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Did you try indeed.com or dice.com for remote positions?",
      "votes": "2",
      "replies": [
        {
          "text": "No, I have only tried linkedIn. Thank you for these, will give them a shot.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "you kinda sound paranoid as hell, i mean you normally should with all those trauma involved but i would recommend you to visit a therapist as well when you get a job, the way you are describing how people are after you and your identity, it is very possible that you're also suffering from a mental illness like schizophrenia, my dad has this so i know how he behaves, thinks out of rationality and believes some powerful people are after him with ''money and power'' (keywords) to destroy his life, traumatic childhod can induce these type of illnesses.\nnote: i am not discrediting your story at all, it could be very true and maybe there are people that might be after you, but the way you described how every step in your life you faced people that you think were influenced or paid by your enemies to make your life difficut sounds psychotic, not everyone can be after you for some properties which most likely they won't get any share from, also the fact that you were well aware of all of these and managed to still live your life with them so far, alive, even continiuing your studies to uni gives an odd perspective to your story.",
      "votes": "1",
      "replies": [
        {
          "text": "You are not only discrediting my story, you may also be spreading propaganda. Also, you are disrespectful towards victim. You avoided all the facts, all the evidence, all the admission. You also don't know all the other factors to this story. I think you should also do a checkup with you father since those diseases are genetic, as you are reaching to conclusion without using logic. Or, you might just have a propaganda.",
          "votes": "1",
          "replies": [
            {
              "text": "Firstly, I have zero advantage in discrediting your story, and about spreading propaganda, I don't know what you're on, I am simply trying to help you by giving an insight from my view on your story, and here you are attacking me with that reply, even here I would like to underline the fact that you are taking a simple comment as propaganda (an attack), you're already getting defensive to a harmless stranger online.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 120
}