{
  "url": "https://www.reddit.com/r/bangladesh/comments/1g2o73z/can_a_law_enforcement_authority_of_bd_contact/",
  "hash": "4879c2ffa09fb34f9f0afe99b2383e19",
  "scraped_at": "2025-12-10T02:36:42.051185",
  "title": "Can a law enforcement authority of BD contact Binance through 'Kodex Global' Platform?",
  "description": "I have been scammed on 9th october through a platform...it's related to digital product.. It was a scam of 375$ equavalent to almost 50k taka... I contacted the customer care of that platform and they said no need to worry as they already freezed the scammers account.. but they don't have the legal rights to give back the funds from that account... as they need local law enforcement permission to do that... They need a court order or they need law enforcement to directly contact with them and investigate... The Platform was binance... will bd police help me in this issue? Or where should i go now?",
  "votes": "0",
  "comments": [
    {
      "text": "binance\nscammer\nColor me shocked. And the answer to your question is \"no lol\"",
      "votes": "4",
      "replies": []
    },
    {
      "text": "From my experience, No. Going to the police, they will laugh at you. Contact a lawyer, but I doubt anyone in BD specialize in this. Your best bet is to customer care and compliance department in Binance. Post on r/binance or go to their discord server to get any help.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "I have done a transaction on binance. I received the payment in my bank account, but I was sleeping when it happened. Binance automatically launched a dispute after an hour. The buyer sent a screenshot of bank transfer to binance. When I woke up, I saw the messages and immediately informed binance that I have received the payment. Binance released the coin to buyer without delay.\nThis system seemed full proof to me. Can you please describe how you were cheated? Maybe I can learn something new.",
      "votes": "2",
      "replies": [
        {
          "text": "you did an internal transaction through verified buyer... I have made a transaction with an unknown person.. actually that person impersonated a trusted admin's id... I didn't notice it... now the funds are locked in that scammers id.. Binance is asking law enforcement help..but you know bd pretty well...where will i get law help related to crypto",
          "votes": "1",
          "replies": [
            {
              "text": "It's more about the identity of the scammer and less about crypto. You can exchange USD or GBP on binance as well. That doesn't make any difference. It was a financial transaction where payment was due. Law enforcement will act as long as the necessary documentation proves the authenticity of your claim.\nThe real issue is if it was a personal transaction or a transaction through a platform. If the transaction was done outside a platform, you are screwed. Otherwise there is hope.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 123
}