{
  "url": "https://www.reddit.com/r/bangladesh/comments/1g1oppp/am_i_required_to_have_a_dual_citizenship_to/",
  "hash": "dc09fe7802051fea9a5585d64d255ca5",
  "scraped_at": "2025-12-10T02:37:13.886471",
  "title": "Am I required to have a dual citizenship to inherit my parent's property?",
  "description": "I am a naturalized USA citizen and my parents are permanent residents with Bangladeshi passports. I have a question regarding the inheritance transfer law/ policy in Bangladesh. Let's say, if they want to transfer their current Bangladeshi residence property via writing a will, do I need to provide any identifications to show that I am a Bangladeshi citizen such as a Bangladeshi passport or NID? I was googling and according to some websites it states the following:\n\"Foreigners inheriting property in Bangladesh: It is very likely that a foreign citizen can inherit property in Bangladesh with no express restriction under any legislation.\"\nSource: https://factinbd.com/can-foreigners-inherit-property-in-bangladesh/\nhttps://legalcounselbd.com/inheritance-by-children-living-abroad/\nHowever, I am not sure how authentic these sources are.\nI just wanted to know if you guys are aware of any law restrictions in Bangladesh for inheriting properties from Abbu or Ammu. Appreciate for the responses. Thanks!",
  "votes": "2",
  "comments": [
    {
      "text": "The best thing for you would be renewing or applying for yout Bangladeshi passport, if your parents are Bangladeshi, you are too. Just because you are nathuralised US citizen, doesn't mean you lose your deshi citizenshiop. All you need to do is apply for the passport providing the online birth certificate. You can do that trough the Bangladeshi embassy in the US too. Also, you can get the NID, and then everything else will be easier. Even if the law allows you to inherit with you US passport, you'll have lots of headaches, while spending a little time into getting the BD passport and NID will save you such headaches.",
      "votes": "3",
      "replies": [
        {
          "text": "Thanks for telling the reply. Appreciate it!",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "No, I actually discussed this with my lawyer in Dhaka when I was there this summer. All you need is your NID. You do not need to be a Bangladeshi citizen to inherit property or funds. I’m dealing with it right now and have has no issues (I’m a US citizen who never applied for dual)",
      "votes": "-2",
      "replies": [
        {
          "text": "Having an NID means you are citizen. If you are not, they don’t give an NID. But OP is a citizen anyway. You don’t lose the citizenship once obtaining another one unless it’s not one of the privileged countries (US is).",
          "votes": "4",
          "replies": [
            {
              "text": "I’m no longer a citizen but I have my NID from earlier. Several of my relatives in the US and Canada have the same",
              "votes": "-2",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 125
}