{
  "url": "https://www.reddit.com/r/bangladesh/comments/1g0on5w/my_identity_has_been_changed_to_seize_the/",
  "hash": "ef1297b27832447fa3f0d115e814a6c4",
  "scraped_at": "2025-12-10T02:37:30.269026",
  "title": "My identity has been changed to seize the property I inherited",
  "description": "TLDR: My step mother and current foster parents conspired together to scheme me out of my inheritance after both of my parents died at early stage. Throughout my life they tried to traumatize me, tried to destroy my career but weren't fully successful. I now want to fight back and make this stop because that is the only way to make them stop.\nআমি শাহজালাল বিজ্ঞান ও প্রযুক্তি বিশ্বিদ্যালয়, সিলেট থেকে স্নাতক পাস করেছি এই বছর। আমি অনেক বড় বিপদেই পড়েছি। আমার বাসা খুলনায়। আমি আপাতত ঢাকায় আছি মেস নিয়ে।\nআমার বাবা মা দুইজনেই অনেক ছোট থাকতে মারা যান। আমার মা আমার জন্মের সময় মারা যান। তারপর আমার বাবা আরেকটি বিয়ে করেন। ওই ঘরে আমার একটি সৎ বোন হয়। তারপর আমার বাবাও মারা যান আমার যখন বয়স ৩.৫ - ৪ বছর। আমার সৎ মা আমাকে তখনই অন্য একটি বিবাহিত দম্পতির কাছে পাঠিয়ে দিল যারা আমাকে পরিচয় দিল আমার আসল বাবা মা হিসেবে। আমি অনেকদিন পর্যন্ত মেনে নেই নি, কান্নাকাটি করতাম বাবা মার কাছে যাব বলে। কিন্তু বাবা মার কথা বললে আমাকে খেতে দিত না, আরো অনেক ভাবে টর্চার করতো। তবে বাবা যে মারা গেছেন তা আমি জানতাম না, সম্ভবত যেদিন মারা গেছেন ওইদিন বিকেলে আমাকে এদের কাছে পাঠিয়ে দিয়েছে , সেদিনের কথা আমার আজও মনে আছে। তো আমিও একসময় মেনে নিলাম তারাই আমার বাবা মা, কিছুটা রাগ করেই যে আমার আসল বাবা মা যেহেতু আমাকে উদ্ধার করছে না, শুধু শুধু অত্যাচার সহ্য করে আর ভয় নিয়ে বেচে থাকার মানে হয় না। তবে আমার আসল মা যে মারা গিয়েছেন, এটা যে আমার সৎমা তা আমার বাবা আমাকে ওই ছোট থাকতেই বলেছেন, কারণ বাবাকে মার দুর্ব্যবহার নিয়ে জিজ্ঞাসা করেছিলাম।\nআমি তখন যেটা বুঝিনি তা হল এই সব ই আমার সৎ মা করেছে আমার বাবার সম্পত্তি দখল করার জন্য। আমার পালক পিতা মাতা এই একই এলাকা তেই থাকে। আমার সৎ মা, তার ভাই বোন, আমার পালক পিতা মাতার পরিবার সবাই মিলে আমার সম্পত্তি দখল করার জন্য এই বড় ফন্দি এঁটেছে। আমার সকল পরিচয়পত্র, NID, Birth Certificate এ পালক পিতা মাতার নাম দেওয়া, আমার নাম পরিবর্তন করা হয়েছে। আমার সারাটা জীবন আমার সাথে অসংখ্য কাহিনী ঘটিয়েছে, ছিনতাই কারী ভাড়া করা, পরীক্ষার আগে আমাকে বাসা থেকে বের করে দেওয়া, আরো অসংখ্য জিনিষ। আমি আমার আসল আত্মীয় স্বজন কোথায় কি আছে তা জানি না। সেই ছোটবেলার পর থেকে আমি আর কখনও আমার আসল বাবা মার কথা বলিনি, কিন্তু এইবার স্নাতক পাস করার পর তারা সেই আমার বাবার বাসায় এসেই উঠেছে, আমাকে বলেছে তারা ভাড়া নিয়েছে। এই বাসায় ঢোকা মাত্রই আমি চিনতে পারলাম। আমি এইবার তাদের বললাম, তোমরা তো আমার বাবা মা না, এই বাসা তো আমার। এরপর থেকে এদের অত্যাচার শতগুণে বেড়ে গেছে, আমার খাবার, পানিতে ঔষধ মেশাচ্ছে, এদের লোকজন আমাকে সবসময় ফলো করে।",
  "votes": "68",
  "comments": [
    {
      "text": "This is so next level shit!\nYou should take the help from that judge. Goodluck with job hunting.",
      "votes": "24",
      "replies": [
        {
          "text": "Thank you. Yes, as soon as I am able to secure a position,I will file a case with her help.",
          "votes": "8",
          "replies": []
        }
      ]
    },
    {
      "text": "No matter what you do consider saving some money to fight legally and stay far away from the relatives at least for now. And if someone has some access to a good lawyer or NGO who can fight this for the love of god help him.",
      "votes": "13",
      "replies": [
        {
          "text": "Thank you and God bless you. Yes, saving money to fight legally is my main priority right now. Also, I have distanced myself from all of their relatives too.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Contact me today in the evening. If u are indeed fit, I'll arrange a job for you.",
      "votes": "8",
      "replies": [
        {
          "text": "Thank you so much. I have messaged you, please check.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Thank you so much for your kind words. It has been a life full of hardship and struggle. I just now hope that all of this will be over one day.",
      "votes": "3",
      "replies": [
        {
          "text": "Thank you so much for your kind words. It has been a life full of hardship and struggle. I just now hope that all of this will be over one day.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "That is a lot of help and great advice, thank you man.\nI have recently started capturing videos. As for bugging the room, they are the one that did it already. They are already using the technology card, their scheme is quite elaborated. And, no my step sister won't help me. But all of their scheme will be very easy to prove once I regain my original identity and inheritance, then their scheme will be out in the open. So,thank you so much for these great suggestions, I will definitely contact the lawyer.\nEdit: I will also keep you guys updated.",
      "votes": "3",
      "replies": [
        {
          "text": "That is a lot of help and great advice, thank you man.\nI have recently started capturing videos. As for bugging the room, they are the one that did it already. They are already using the technology card, their scheme is quite elaborated. And, no my step sister won't help me. But all of their scheme will be very easy to prove once I regain my original identity and inheritance, then their scheme will be out in the open. So,thank you so much for these great suggestions, I will definitely contact the lawyer.\nEdit: I will also keep you guys updated.",
          "votes": "2",
          "replies": [
            {
              "text": null,
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Maybe also try posting in your university group. I'm sure you have a great alumni base who has power/influence to help you both in the case of your career and the mess you're in.",
      "votes": "2",
      "replies": [
        {
          "text": "I still haven't taken it to Facebook. I am still thinking about it. Thank you for your suggestions.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "I am not able to help you with directly finding jobs, but your resume looks nice. Stay strong and I hope your issues are resolved soon. Feel free to reach out if you need help with suggestions regarding jobs or help in preparing for the interviews.",
      "votes": "2",
      "replies": [
        {
          "text": "Thank you so much for your kind words. Please check inbox.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Please check inbox.",
      "votes": "1",
      "replies": [
        {
          "text": "Please check inbox.",
          "votes": "1",
          "replies": []
        },
        {
          "text": "Thank you so much for showing concern. Could you please check your inbox?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Bro I'm going to forward your shit to as many people as possible.",
      "votes": "2",
      "replies": [
        {
          "text": "Thank you so much for your support, It means a lot. Love you brother.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "আমার উপদেশ নেন। আপনার জমি-জমা যা আছে, এগুলা ভুলে যান। ভালো ব্যাবহার করে যতটুকু পারেন টাকা পয়সা নেন, জাস্ট সারভাইব যাতে করতে পারেন। পড়াশোনা করসেন এখন নিজের যোগ্যতাতে উপরে উঠার দিকে মন দ্যান। এইসব মানকিগো লগে আপনি কিছুই করতে পারবেন না। আপনার সময়, ক্যারিয়ার, মানসিক শান্তি সব নষ্ট হবে।\nনেক্সট ৪~৫ বছর কুত্তার মতো খাটবেন...স্কলারশীপ নিয়া বিদেশ যাইবেন...নিজের উপর কনফিডেন্স রাখেন মিয়া।",
      "votes": "2",
      "replies": [
        {
          "text": "তাই করতে চেয়েছিলাম ভাই কিন্তু এরা আমার পিছু তো ছাড়ছেই না। এরা নিশ্চিত করতে চাচ্ছে যেন ভবিষ্যতে আমি কখনও এদের বিরুদ্ধে না দাঁড়াতে পারি, কিন্তু তাও আমি আশা ছাড়ছি না। চেষ্টা চালিয়ে যাচ্ছি, এবং সুযোগ পেলেই বাইরে চলে যাব।",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "tldr?",
      "votes": "-1",
      "replies": [
        {
          "text": "My step mother and current foster parents conspired together to scheme me out of my inheritance after both of my parents died at early stage. Throughout my life they tried to traumatize me, tried to destroy my career but weren't fully successful. I now want to fight back and make this stop because that is the only way to make them stop.",
          "votes": "8",
          "replies": []
        }
      ]
    }
  ],
  "id": 126
}