{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ony0am/chief_justice_seeks_explanations_from_3_hc_judges/",
  "hash": "132e75f0475d8250ea9190fea38fe2ae",
  "scraped_at": "2025-12-10T02:06:02.287377",
  "title": "Chief justice seeks explanations from 3 HC judges over granting too many bails",
  "description": "Bangladesh’s Chief Justice Syed Refaat Ahmed has asked three High Court judges to provide written explanations after a vacation bench reportedly granted bail in nearly 800 cases in just 4–5 hours. The judges—Justices Abu Taher Md Saifur Rahman, Mustafa Zaman Islam, and Md Zakir Hossain—have been told to submit case-specific details along with the list of lawyers who represented the accused.\nThe development comes after concerns raised by Law Adviser Asif Nazrul about the unusually high number of bails. The judges were initially given a three-day deadline, which expired on 27 October, and one has requested a 12-day extension via a letter to the Registrar General's Office.\nSupreme Court Special Officer, Muajjem Hussain, stated that the judges were instructed to provide case-specific explanations along with lists of the lawyers who represented the accused in those bail petitions. As of the latest report, Mr. Hussain claimed to have no information on whether the reports had been submitted or if the judges had met with the Chief Justice.\nAll three judges, who had previously served on the two-member benches that issued the bail orders, were subsequently reassigned to single-member bench courts.\n“ Indeed, the Bangladesh Chief Justice has already punished these three judges by breaking up their writ benches and putting them in single bench courts. This decision will have a real impact not just on other High Court judges - who will now be far more cautious in giving bail - but also on the lower judiciary who will now think they were right in ritualistically rejecting bail. Dare I say it, demoting judges who showed independence from the executive  was a similar technique used by previous chief justices under the Awami League to control the judiciary.”",
  "votes": "8",
  "comments": [],
  "id": 13
}