{
  "url": "https://www.reddit.com/r/bangladesh/comments/1fof8i7/%E0%A6%AB%E0%A6%B8%E0%A6%AC%E0%A6%95_%E0%A6%87%E0%A6%89%E0%A6%A8%E0%A6%B8%E0%A6%A8%E0%A6%B9%E0%A6%A6%E0%A6%95_%E0%A6%97%E0%A6%B2_%E0%A6%AF%E0%A6%AC%E0%A6%95%E0%A6%B0_%E0%A6%AC%E0%A6%B0%E0%A6%A6%E0%A6%A7_%E0%A6%A1%E0%A6%9C%E0%A6%9F%E0%A6%B2_%E0%A6%A8%E0%A6%B0%E0%A6%AA%E0%A6%A4%E0%A6%A4_%E0%A6%86%E0%A6%87%E0%A6%A8_%E0%A6%AE%E0%A6%AE%E0%A6%B2/",
  "hash": "5f9614124ea2d404f6735a6bbd574bc1",
  "scraped_at": "2025-12-10T02:38:42.127115",
  "title": "ফেসবুকে ইউনূস-নাহিদকে গালি, যুবকের বিরুদ্ধে ডিজিটাল নিরাপত্তা আইনে মামলা",
  "description": null,
  "votes": "27",
  "comments": [
    {
      "text": "Some DSA knowledge for anyone defending this move:\nDefamation law and Bangladeshi DSA law are not the same type of law.\nDefamation laws have many defense systems and exemptions for the accused. For example-\nThe defamation case is not prosecuted by the state but instead, only the victim can file the case and he has to hire their own lawyer (So less fake and bs cases). If the case is proven, criminal might have to pay the victim's lawyer fee too. In DSA case, anyone can file a complaint (snitch) at a police station and bam the state takes over the role of prosecuting.\nIn defamation case, proving that your statement is true is a valid defense. Defendant can say yes I called Hasina a khuni for what happened in July or Yes i called yunus a \"shudkhor\" cuz he established grameen bank. case dismissed. But under DSA true statement is also prosecutable\nIn defemation case, the victim has to prove how the defaming statement caused reputation loss which resulted in monetary loss or loss of opportunity of some kind. No such rule in DSA cases. It's assumed any negative statement constitutes crime\nDefemation laws have higher level of protection for criticism and rumors against public figures like celebrities, politicians etc. No such thing in DSA\nIn DSA cases, all you can do is claim you didn't say that thing. If the prosecution has a clip of you saying it, off to jail you go.",
      "votes": "17",
      "replies": [
        {
          "text": "Thanks for elaborating. The DSA is truly a mighty tool for the fascist. It needs to be abolished, ASAP.",
          "votes": "8",
          "replies": [
            {
              "text": "There has been only a change in management.",
              "votes": "0",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "মঙ্গলবার (২৪ সেপ্টেম্বর) চট্টগ্রামের সাইবার ট্রাইব্যুনাল বিচারক জহিরুল হকের আদালতে এ মামলা দায়ের করেন হাফেজ মোহাম্মদ সাইফুদ্দীন নামে এক যুবক।\nতেলবাজ, সু্যোগসন্ধানী, অতিউৎসাহী লোকের অভাব নাই।\nNot sure which group this plaintiff falls into.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Ekta chushil re lekhte deskhsilam\nShibur jongi asuk somossa nai kintu age Hasina re kisu lekhte partam nah kintu ekhn Yunus er biruddhe ja khushi lekhte pari. Sei sadhinota 🥰🥰",
      "votes": "5",
      "replies": []
    },
    {
      "text": "This is messed up! This freaking law was the way BAL Hasina kept everyone quiet, now they aren’t removing it! The hell is going on here?",
      "votes": "10",
      "replies": [
        {
          "text": "What it was always going to be",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Maybe the whole movement was a scam",
      "votes": "9",
      "replies": [
        {
          "text": "What did you think? The problem has always been the people of Bangladesh. Political parties are reflection of Bangladeshi people.",
          "votes": "6",
          "replies": []
        },
        {
          "text": "স্ক্যামন্বয়ক",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "Look at that. Army support korse and apparently eshob shuru hoise lol I wouldn't be surprised if there are hidden agenda everywhere right now.\nAlso, je submit korse, uni ke ashole? Why is someone else filing for Dr. Yunus and Nahid",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Bhai it's just an FIR. Listen to Asif Nazrul's interview with Khaled Mohiuddin. Don't be so sh!t on Reddit.",
      "votes": "-3",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 130
}