{
  "url": "https://www.reddit.com/r/bangladesh/comments/1eqdcqk/%E0%A6%86%E0%A6%9C%E0%A6%95%E0%A6%B2_%E0%A6%AC%E0%A6%B2%E0%A6%A6%E0%A6%B6_%E0%A6%AA%E0%A6%B0%E0%A6%95%E0%A6%B6%E0%A6%AF_%E0%A6%9A%E0%A6%AE_%E0%A6%96%E0%A6%93%E0%A7%9F%E0%A6%B0_%E0%A6%98%E0%A6%9F%E0%A6%A8_%E0%A6%98%E0%A6%9F%E0%A6%9B_%E0%A6%85%E0%A6%A8%E0%A6%95_%E0%A6%B8%E0%A6%B6%E0%A6%AF%E0%A6%B2_%E0%A6%AE%E0%A6%A1%E0%A7%9F%E0%A6%A4/",
  "hash": "0644efb190bfee890ec2ed2e4958d6a0",
  "scraped_at": "2025-12-10T02:40:27.205448",
  "title": "আজকাল বাংলাদেশে প্রকাশ্যে চুমু খাওয়ার ঘটনা ঘটছে অনেক, সোশ্যাল মিডিয়াতে প্রায়সময়ই দেখা যায় এইধরনের ছবি। কিন্তু এই বিষয়ে আইন কী বলে? এটা কি অনুমোদিত নাকি দণ্ডনীয় অপরাধ?",
  "description": "খুব সম্প্রতি গণভবন দখলের পরে এরকম একটা ছবি ফেসবুকে ভাইরাল হয়ে পড়ে, অনেকগুলা পেইজ এই ছবিটা শেয়ার করে যা অনেক আলোচনা সমালোচনার জন্ম দেয়।",
  "votes": "0",
  "comments": [
    {
      "text": "You sck",
      "votes": "16",
      "replies": []
    },
    {
      "text": "Anner eto joley kaa?1",
      "votes": "10",
      "replies": [
        {
          "text": "",
          "votes": "-6",
          "replies": []
        }
      ]
    },
    {
      "text": "You worried about normal couples kissing? We had gay sex in BTV before all that!",
      "votes": "5",
      "replies": [
        {
          "text": "এটা কি ছবি দিলেন? ওয়াক থু। মাথা ঠিক আছে আপনার?\nআমি এই পুরা গানের ভিডিওটা দেখছি, এই ছবি এডিট করা",
          "votes": "-1",
          "replies": []
        }
      ]
    },
    {
      "text": "you need to kiss a man",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Apnar eto jhole kn?",
      "votes": "4",
      "replies": [
        {
          "text": "কি বলতেছেন এইসব? আমি শুধু দেশের আইনে কি বলা আছে সেটা নিয়ে কথা বলছি। আপনারা এমন করছেন কেন আমার সাথে?",
          "votes": "-4",
          "replies": []
        }
      ]
    },
    {
      "text": "এটা আইন থাকার মত কিছু না। কি হয় অন্যে চুমু খেলে? আপনি মানসিক বিকারগ্রস্থ।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 136
}