{
  "url": "https://www.reddit.com/r/bangladesh/comments/1eo4w0q/can_my_school_punish_me_for_this/",
  "hash": "3759ac7da263b1581192c3a773e1dd47",
  "scraped_at": "2025-12-10T02:40:44.669579",
  "title": "Can my school punish me for this?",
  "description": "The school warned me to stop from posting my current type of content on my youtube channel, it did not mention anything about the school.\nNo, It didn't contain hate speech, harassment or anything the school should really be concerned about, yes my videos are a bit inappropiate but nothing in it shows me nor anything illegal, just a few anime/cartoon characters in their bikini thats all, my thumbnails are a bit questionable but Youtube has no issue with it soo I don't see why they would ask me to do this.\nAnd no I did not tell anyone in the school my YT or advertised it around my school. Not sure how they got access to it.\nI would like to know if they are allowed to take any action against me as per Bangladeshi Law.",
  "votes": "3",
  "comments": [
    {
      "text": "Your school has google classroom?",
      "votes": "2",
      "replies": [
        {
          "text": "Not Google classrooms but Teams and we get our own Email",
          "votes": "1",
          "replies": [
            {
              "text": "Are you using that email or personal email to upload content? If you are using that email to upload content then you stupid but if upload content with your personal email then I would suggest talking to your classmates and ask them if they seen any weird activity in their email accounts if so then I would suggest telling your parents and get in contact with the cyber security helpline",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "They can’t put you in jail for it as it’s not a legal matter. They can suspend or expel you.",
      "votes": "2",
      "replies": [
        {
          "text": "But I am sure there is a ruling on suspending or expelling a student, I am sure I didnt break any school rules nor any laws, also I am sure article 39, gives me freedom of press, if Youtube was to fall under it",
          "votes": "1",
          "replies": [
            {
              "text": "Not a lawyer but as a general principle a private business can choose who to do business with and expel you if it chooses you. I guess your school is private so you may be out of luck.",
              "votes": "2",
              "replies": []
            },
            {
              "text": "I don't they can put you in jail for that. But there is definitely some social stigma when it comes to anime, esp if you include the degenerate type of stuff on your videos.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Are you completely anonymous in your youtube videos? Is the name in anyway related to your real one? And did you ever share your channel in any BD fb groups or with friends (incl. outside of school)?",
      "votes": "2",
      "replies": [
        {
          "text": "Yes, my name is completely anonymous, My name in there is no way related to my real one, And I never shared my channel with anyone inside or outside of school as I started actively making videos recently",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Don't be another brick on the wall.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 137
}