{
  "url": "https://www.reddit.com/r/bangladesh/comments/1e5fc6h/government_has_filed_a_leavetoappeal_petition_in/",
  "hash": "871bbb0728bba3df139811238a231b97",
  "scraped_at": "2025-12-10T02:42:08.210396",
  "title": "Government has filed a leave-to-appeal petition in the Appellate Division essentially challenging High Court's 2024 Judgment",
  "description": "Basically, this means the Government wants High Court to abolish the current verdict (which reinstated pre-2018 quota system i.e. 30% FF quota).\nReasoning given for the petition is \"...keeping or cancelling quotas in public service is a policy decision of a government. So, it's a not a matter to be decided by the court.\"\nI unfortunately could not get a copy of the petition itself, but the news came yesterday with Attorney General AM Amin Uddin's comments.\nQuota in public jobs: Govt files leave-to-appeal petition with SC to scrap HC verdict | The Daily Star\nhttps://today.thefinancialexpress.com.bd/first-page/leave-to-appeal-filed-against-hc-verdict-on-quota-reinstatement-1721153099\nকোটা নিয়ে হাইকোর্টের রায়ের বিরুদ্ধে রাষ্ট্রপক্ষের লিভ টু আপিল | জাতীয় (bssnews.net)\nসরকারি চাকরিতে কোটা: হাইকোর্টের রায়ের বিরুদ্ধে রাষ্ট্রপক্ষের লিভ টু আপিল (bonikbarta.net)\nI would appreciate it very much if someone could provide a copy of the petition itself here. The original 27-page judgement-\nhttps://www.supremecourt.gov.bd/web/indexn.php?page=judgments.php&menu=00&div_id=2&lang=",
  "votes": "16",
  "comments": [
    {
      "text": "This is the correct step, but they should've done this long before things escalated. Can't reverse the lives lost or the resentment that grew in the protestors now, can they?",
      "votes": "7",
      "replies": [
        {
          "text": "I don't think they are doing this to redeem themselves or because it's the right thing to do. It's much more likely they want to have full control over the policy and any appeal decision with a definitive answer (ff quota reinstation or abolishment or even modified ff quota) will be a hindrance to their overall goal to manipulate the workforce to their liking.\nStill take my opinion with a grain of salt, as only after the appellate division gives us the new judgement can either the government and the general students can  truly understand where the quota system will stand.\nThat could be immediately after the 4 week status quo Supreme Court ordered or months after the fact. We can only hope the protesters stay strong that long, because this will be harder the more time rolls on.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "This needs to be pinned",
      "votes": "3",
      "replies": []
    },
    {
      "text": "“Government wants high court to abolish….” Exactly! We don’t have a fair jurisdiction system to begin with.\nOtherwise High Court would never have ruled in favor of the writ applied by the quota benefactors when there is already an existing clause of the constitution saying the court has no control over state policies.\nThere is absolutely no point saying that the government has applied to cancel the quotas (with an actual intention) in public service when the Prime Minister herself has spoken in favor of the quota system several times.",
      "votes": "2",
      "replies": [
        {
          "text": "This has most probably nothing to do with cancellation of quota, moreso cancellation of court's opinion on said quota system. It's already students vs Govt & everyone else.\nThis has \"I-am-the-only-one-who-gets-a-say\" mentality the government has held time and time again. You are definitely right in the sense our judicial system can or will fail us, but until appeal decision is provided, it's a guessing game.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "can somebody explain this to me like i'm 5?",
      "votes": "2",
      "replies": [
        {
          "text": "My apologies. I don't know if this is simple enough so don't hesitate to ask followup questions if you need to.\nThe original decision (2021 case, but the judgement was given this year on June 2024) by our High Court was that we keep the freedom fighter quota system (which was abolished in 2018). But the severity of that decision came to light when the actual judgement document was published this July.\nBut now government wants to reverse this decision and the reason they gave is,\"We (the govt.) are the only ones who get to decide how quota works. Whether it stays or goes is our choice. The court or the people do not get to interfere with that choice.\"\nAs you can imagine, this only happened this quickly because of the movement becoming this huge which the govt. did not anticipate.So they want to take back as much control they can over this issue.",
          "votes": "6",
          "replies": []
        }
      ]
    }
  ],
  "id": 142
}