{
  "url": "https://www.reddit.com/r/bangladesh/comments/1cxb454/what_are_the_laws_for_police_doing_random/",
  "hash": "a4579d1d0cd34219dd2d3802e30e6d01",
  "scraped_at": "2025-12-10T02:43:12.602652",
  "title": "What are the laws for police doing random searches on people on the street? Is it even legal?",
  "description": "Looking to know my rights as a citizen, no negative intentions. Have been subjected to random searches by street police before, all without any kind of warrant. What does Bangladesh's law say about police doing such checkups? Is it legal for me to refuse a police officer looking to search within my pockets and backpack without a warrant? No law enforcement should have this much authority without justification.",
  "votes": "37",
  "comments": [
    {
      "text": "Imagine expecting rights in a country where general people's right to vote is non-existent for the past 15 years.\nIf the police say strip and stand naked , you have no other option. Anything done by you will either put you in a made-up case with drugs or even killed with no justice.",
      "votes": "41",
      "replies": [
        {
          "text": "Yes. But if I remember correctly, police have legal clearance to search anyone anywhere. I don't really remember the legal section, I remember reading about this. Apparently this clause that let's them do it, was invoked during the Pakistani regime as a way to harass the common people of Bangladesh. It's a faint memory so I might have to take a raincheck on that but I'm pretty sure that the clause has remained unchanged for a long time. And it allows police to search anyone, anywhere under suspicion. But they need at least 2 reputable people present there during the search.\nBut of course, you're right as well. In a corrupt nation, laws are accessories for the rich and powerful.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "in theory, BD Police can't search your personal belongings without a warrant. You have the right to refuse to be searched. in practise, they'll cause more problems if you refuse. best approach is to agree to the search, but start recording them on your phone, also don't let them touch your belongings. tell them that you'll show them everything and empty your pockets, but they can't touch it. either they'll let you go or just do a reluctant search and go on their way. this worked multiple occasions when police stopped me and my friend when we were returning home late at night. also, if they ask where you live say 5-minutes from here.",
      "votes": "18",
      "replies": [
        {
          "text": "they snatch ur phone sometimes when u record them, abuse u physically and verbally too if they get the chance.",
          "votes": "4",
          "replies": [
            {
              "text": "Go live. They will be caught if they try to snatch the phone. After all, it’s perfectly legal to record them.",
              "votes": "3",
              "replies": []
            },
            {
              "text": "পুলিশের কাছে কারণ ছাড়া মাইর খাওয়ার কোন কারণ নাই। গায়ে হাত দিলে চিল্লাপাল্লা করে মানুষ জড়ো করবেন, তারপর দেখবেন কই যায়। সুন্দর মত বইলা ভিডিও করলে, আর ব্যাগ পকেট দেখাইলে কোনদিন ফিজিক্যালি হ্যারাস করছে বইলা দেখি নাই। খারাপ উদ্দেশ্য নিয়ে সার্চ করতে চাইলে স্ট্রেইটফরোওয়ার্ড কথা শুনলেই পিছায় যাবে।",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Define \"legal\" in BD context first.",
      "votes": "10",
      "replies": [
        {
          "text": "Haha best answer",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "I heard police keeps drugs in your bags while searching",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Just go live on Fb/any social media platform. Know the specific law and recite it out to them and let them search you. Even though it’s illegal for them to do it, we have no choice because they have the power over us, thanks to the corruption.\nThey can’t verbally abuse you or snatch away your phone because it’s all in live. And you’ll keep yourself safe too from them planting anything on you in the name of “search”. Be polite but firm. Don’t be polite and meek. And don’t be rude. Practice how to talk to power hungry assholes. A firm look, moderately loud and unshaken voice, but polite words. And it sounds so bad to say this but if you can speak English, please try to say a few sentences in English. Idk why but people in our country are sometimes intimidated by English words.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Once I heard that the current marijuana law stands that if you get caught less than a certain amount ( < 25 grams ) , you can ask the police for a magistrate on the spot and get away giving a very small fine xD apparently it’s a British law and the govt haven’t updated it yet\nNow imagine having that conversation with yo desi police officer after getting caught with a “ Potla” xD",
      "votes": "4",
      "replies": [
        {
          "text": "Those fuckers will convert the potla to a kilogram, make you a dealer and try squeezing for money otherwise chalan to court /jail/ prison.",
          "votes": "3",
          "replies": [
            {
              "text": "Shala ra pocket e baba diya dhore..ffs ki ar bolar ase xD",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Asking if something is legal or not in BD is wild",
      "votes": "2",
      "replies": []
    },
    {
      "text": "There is no laws. Idk what are you talking about",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "-7",
      "replies": [
        {
          "text": "Well true, but the real problem is in corrupted countries like bd , India or others....the police themselves will leave something suspicious in Ur pockets while searching and will blackmail or frighten u to give large sum of money",
          "votes": "6",
          "replies": [
            {
              "text": "The police kept Yaba in my pockets three times. Alhamdulillah, I could find and throw them away before the next check!\nThe first time it happened to me, the CNG driver asked me to check my bag thoroughly. He even stopped the CNG to give me enough time to search.\nAnyway, the US police are no better! They have a record of killing people on the spot without any justifications.",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "then those police would be committing treason. no citizen should be supporting the government until one recognizes their rights.",
          "votes": "1",
          "replies": []
        },
        {
          "text": "In truth, there's no rights as a citizen when police wants to conduct a random search, nowhere in the world.\nYes there are. There are none in Bangladesh because we are still a backwater country. But don't make it sound like it's bad everywhere.",
          "votes": "1",
          "replies": [
            {
              "text": "Have you ever seen the news about the US cops? If you ever saw, you'd agree.",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "nowhere in the world\nIdk about other countries, but here in the US there needs to be probable cause. I’ve been pulled over several times with my car reeking of weed, but haven’t been searched or ticketed (besides the traffic violation for which they pulled me over). I’m pretty sure if it was bd I would’ve been arrested lol.",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 146
}