{
  "url": "https://www.reddit.com/r/bangladesh/comments/1bctlrw/kissing_in_public_places_in_bangladesh_what_does/",
  "hash": "97520f7193ddb9b450a6457a66417d77",
  "scraped_at": "2025-12-10T02:44:20.214418",
  "title": "Kissing in public places in Bangladesh - what does the law say?",
  "description": "Most people here wants to justify kissing in public places in Bangladesh as seen in the BracU gala night kissing post. You should read this following article & see for yourself that kissing in public is against the law of our country as it creates public nuisance:\nSection 294 of the said Code provides that “Whoever, to the annoyance of others, (a) does any obscene act in any public place, or (b) sings, recites or utters any obscene songs, ballad or words, in or near any public place, shall be punished with imprisonment of either description for a term which may extend to three months, or with fine, or with both.” As we see that if any act creates any obscene act in any public place then that would amount a crime under section 294 of the Penal Code.\nNow the question is whether kissing in public creates any obscenity in Bangladesh or not. As mentioned above that there is no definition of ‘obscenity’ in the Penal Code; hence we have to rely on the social and cultural context of Bangladesh. No doubt that kissing is an expression of love that creates a strong bond between the partners. However, we must not forget the sentiment of the majority of Muslim people living in Bangladesh. Kissing in public could cause public annoyance which contradicts with section 294 of the Penal Code. Religious factor is one of the core factors behind the explanation of the concept of ‘obscenity’. It is a belief of the mass people that religiosity influences the level of physical contact in public. Similarly, religion may have contact with conservative values that may have an effect on all levels of PDA by younger participants. Furthermore, people with strong religious beliefs may be very unlikely to involve in physical contact in public due to the morals advised by their religion. Bangladesh is a country where more than 80% people are Muslims and the cultural practice that we have grown in Bangladesh is closely connected with Islam. Although do we do not practice Sariah Law in Bangladesh, but we did not adopt western practice such as kissing in public. We have our own Bengali culture and tradition and we have our own to express love in public. Kissing in public was not a cultural practice of our own neither it is now. As a result, this could create annoyance and disturbance in the society. Therefore, kissing in public could be a crime under section 294 of the Penal Code.",
  "votes": "0",
  "comments": [
    {
      "text": "Secularism is one of the fundamental principles of Bangladeshi law. So religious morals cannot be used to argue for definitions of what is obscene or not under the law.",
      "votes": "24",
      "replies": [
        {
          "text": "Secularism in bangladesh is a joke.",
          "votes": "8",
          "replies": [
            {
              "text": "As far as the law goes it isn't. It's still not possible to enforce the law against people because they offended someone's religious moral sensibilities, even though many people would like it to be.",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Bengali be like:\nPissing in public: Not a nasty thing. Not a big issue ✅\nKissing in public: ❌❌❌",
      "votes": "12",
      "replies": [
        {
          "text": "piss korle dhon dekha jay, kiss korle jay na 😊😊😊😊",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Why isn't pissing in public a bigger concern?",
      "votes": "57",
      "replies": []
    },
    {
      "text": "It’s regularly enforced outside Dhaka. Watch vids on fb",
      "votes": "3",
      "replies": [
        {
          "text": "It’s regularly enforced outside Dhaka. Watch vids on fb",
          "votes": "3",
          "replies": [
            {
              "text": null,
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Bhaiya had to reach inside his pasa to pull out shit to justify his stance\nIt can be argued Islam also does not allow women to wear shorts and as conservative and Islam minded population can be annoyed, so we can prosecute our women football champions?",
      "votes": "30",
      "replies": []
    },
    {
      "text": "Ahahaha so y'all are into laws now when chumachumi is involved.",
      "votes": "36",
      "replies": []
    },
    {
      "text": "People dont drive properly, corrupt people walking around, police taking bribes, poor people sleeping on road doesnt look bad apparently",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Honestly the most obscene thing I find on the streets of bd are beggars with torn clothes, begging for survival, sleeping on the streets and people flinging their dcks to piss on the street making sure the streets stench of their genetic deformities. Allahu akbar I guess.",
      "votes": "33",
      "replies": [
        {
          "text": "spot on",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "So when the hujur gets it on with a 10 yo at a Madrasa the law becomes a kafir construct, but when 2 adults consensually choose to do PDA suddenly mollahs are in support of thr laws of this land?",
      "votes": "29",
      "replies": [
        {
          "text": "You expect consistency from these guys? According to them, converting to Islam is fine, but not vice versa. Building mosque in non Muslim land is fine, but not new churches and temples in Muslim land",
          "votes": "16",
          "replies": [
            {
              "text": "I agree... Halara nijerai top level er hypocrite, and amader munafiq daika beray",
              "votes": "6",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "kissing is an obscene act and pissing is not? Grow up.",
      "votes": "13",
      "replies": []
    },
    {
      "text": "Attoh chode kemne manusher bujhlam na Toder atoh pera thakleh madrasay giya boishe thak chumachumi dekhaiteh dakenai keo Toder. Oder guna hoileh Oder bepar",
      "votes": "12",
      "replies": []
    },
    {
      "text": "So fuck a kid; okay.\nCouples showing affection for each other; not okay.\nOh BD. How far you've fallen and how much further you'll fall. As long as kiddie diddling incels are calling the shots; I guess everything is as it should be.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Kissing is very good for Health.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "cool, then go prosecute that couple instead of making noise on the internet i guess",
      "votes": "3",
      "replies": []
    }
  ],
  "id": 150
}