{
  "url": "https://www.reddit.com/r/bangladesh/comments/1at1s1b/a_question_is_crypto_currency_is_banned_completly/",
  "hash": "be7a1790490eef70f05ef649ba5a8422",
  "scraped_at": "2025-12-10T02:44:39.337348",
  "title": "A question! Is crypto currency is banned completly in bangladesh?",
  "description": "as the title, is cryptocurrency in bangladesh is banned to the degree that you could get arrested for trading it? especially p2p trading in binance",
  "votes": "23",
  "comments": [
    {
      "text": "YES",
      "votes": "12",
      "replies": [
        {
          "text": "interesting and sound serious, and how people in binance are still trading it?",
          "votes": "2",
          "replies": [
            {
              "text": "Some people use accounts verified by others living abroad and there are seller and buyers for Binance accounts. They do it illegally and at their own risk too.",
              "votes": "4",
              "replies": []
            },
            {
              "text": "and how people in binance are still trading it?\nat their own risk.",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "What's the reason behind the prohibition?",
          "votes": "1",
          "replies": [
            {
              "text": "Govt. doesn't need any reason. They just do.",
              "votes": "2",
              "replies": []
            },
            {
              "text": "Money laundering",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Any virtual currencies or assets are prohibited and is declared illegal in Bangladesh by the Foreign Exchange Policy Department of Bangladesh Bank in accordance of Foreign Exchange Regulation (FER) Act 1947. Bangladesh Bank also refers to Money Laundering Act 2012 to prohibit any virtual currency trading. Virtual currencies are not recognised as legal tenders accroding to the FER Act. Which means that you can not make any transactions with cryptocurrencies, can not buy a product or pay for a service directly with the likes of bitcoins. No financial institutes will accept them and pay you in other legal tenders.\nHowever, to my understanding, what's not banned is transactions of recognised legal tenders from virtual currency platforms. So, theoretically you can cash in from, let's say, Bainance, to your bank account. Because Binance will pay in USD, banks in Bangladesh will recognise the transaction and recompensate you with BDT. The transaction just can't be Cryptocurreny > Bank > BDT. It can be Cryptocurrency > USD > Bank > BDT. Of course, this hypothetial, and I'm not condoning or condemning this.\nBangladesh' ICT department actually publised a report in March 2020, outlining the importance of blockchain tech, and what the national strategy could be regarding this. Don't see much progress after that, but here is the report.\nNotice of BB of prohibiting financial institutions of trading virtual assets and currencies.\nBD News 24 referring to the original notice from BB.\nNews from Dhaka Tribune mentioning BB's new notice.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Unless you're transferring millions I don't think govt. doesn't give a crap about Binance trading.",
      "votes": "4",
      "replies": [
        {
          "text": "it will be millions lol, becasue the profit is low in trading you have to make large transactions",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Some of my clients pay me in crypto and I withdraw them to my local bank account directly from Binance w/o any issues.\nThe bank did freeze one large deposit and asked me to write an application along with an invoice, I did and it was all back to usual.\nP2P however, is sketchy and probably illegal since it's essentially the same as hundi.",
      "votes": "3",
      "replies": [
        {
          "text": "Porbably because USD transactions are not prohibited. If you were to cash in directly from crypto, banks wouldn't do it. Binance pays you in USD I'm assuming?",
          "votes": "1",
          "replies": [
            {
              "text": "Binance offers multiple fiat currencies (e.g. USD, EUR, etc.) that you can convert your crypto into and then withdraw it to your bank.\nSo my bank still knows the money is coming from Binance.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Crypto currency is banned for official transactions. As well as buying crypto currency.\nYou can verify your account using Bangladeshi ID card but you can't buy crypto with a Bangladeshi card or a Bangladeshi ip. But you can use a virtual card as well as a vpn to bypass those.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "F",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Bro I DM you /\nyou don't need to reply just read it",
      "votes": "-1",
      "replies": []
    }
  ],
  "id": 151
}