{
  "url": "https://www.reddit.com/r/bangladesh/comments/1asoiik/how_does_land_selling_work_in_bangladesh/",
  "hash": "d5d52686e67dcfa4c2d80af021038dce",
  "scraped_at": "2025-12-10T02:44:58.551070",
  "title": "How does land selling work in Bangladesh?",
  "description": "I’m of Bangladeshi descent and my maternal grandfather had left some land to my mum and her sisters. He passed away over 30 years ago but none of his possessions was inherited by my mum and her sisters since her oldest sister (my oldest aunt) wants their youngest sister (my youngest aunt who is in her 40s) to get married first before splitting the land up.\nI think the land is still under my grandfather’s name. There have been accusations against my oldest aunt and a relative (cousin of my maternal grandfather) since it’s widely believed that they are selling pieces of the land behind everyone’s back (my mum has 5 sisters). Now, my mum is disabled and she hasn’t got any desires to go back to BD and my father just doesn’t care about my mum’s land.\nI’ve spoken about this with my own sisters and we think that we should just sell the portion of land, that my mum should receive, with our mum’s consent, without waiting for our youngest aunt to get married. But, this brings up some questions and I hope you’ll be able to help me here:\nHow can I check how much land exactly my grandfather actually left to my mum and her sisters? Is there a registry back in BD that I can check?\nHow can I check if my oldest aunt and my grandfather’s cousin actually sold any of the land?",
  "votes": "21",
  "comments": [
    {
      "text": "Lmao another day another land issues captured by own ppl😭",
      "votes": "27",
      "replies": []
    },
    {
      "text": "u aint getting shit",
      "votes": "15",
      "replies": [
        {
          "text": "+1",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "If you have any concrete info like your grandfather's name on the deed, line number and registration number of deed, you can try checking here - https://land.gov.bd/. However, it is not up to date yet for all areas.\nIf you can come to BD physically, then you can go to the sub-registry office for your area and then collect that info. But without actual info of deed, you will have to pay a lot more.",
      "votes": "10",
      "replies": [
        {
          "text": "Pay a lot more? Do you mean I’ll have to pay bribes? My dad says you need to pay bribes everywhere you go in BD, is this actually true?",
          "votes": "4",
          "replies": [
            {
              "text": "u would prolly need to pay bribe to even talk with a gov. official",
              "votes": "9",
              "replies": []
            },
            {
              "text": "In BD sub-registry offices, NOTHING moves without bribe. If someone is saying otherwise, he/she is either beneficiary of that system or, blatantly lying.",
              "votes": "4",
              "replies": []
            },
            {
              "text": "sadly yes",
              "votes": "3",
              "replies": []
            },
            {
              "text": "It seems your father appreciates the difficulty / practicality of the situation. Listen to him, rather than asking randos on Reddit.\nAnother point - even if you are able to sell the land, how would you take the money out of the country? There is no legal way to transfer it abroad. Are you happy to resort to illegal money transfer?",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Chances are you will go there and your aunt will deny yall having any land. There would be a washroom and some weird garden built up on your space and you will have to fight every single relative to even acknowledge the fact those are your land.",
      "votes": "3",
      "replies": [
        {
          "text": "But them denying it and the law proving it are clearly not the same thing. There must be a way to legal to prove my mum’s inheritance?",
          "votes": "2",
          "replies": [
            {
              "text": "Yeah, there is. You'd have to file an inheritance suit in the District's Civil Court if your aunts don't cooperate. (You'd need your mom's NID, info, and documents on the lands your grandfather owned [ you can get preliminary info from neighbors, local land brokers etc and collect detailed info/documents from the local registry office, AC Land office, and DC office], your grandfather's death certificate etc. to initiate the legal procedure).\nP.S: It can take around a decade to go through the court procedures if your aunts deny your mom's claim. (+5 or so years if your aunts exhaustively appeal it to the highest court)",
              "votes": "7",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": [
        {
          "text": "Fuck this shit man",
          "votes": "12",
          "replies": []
        }
      ]
    },
    {
      "text": "How can I check how much land exactly my grandfather actually left to my mum and her sisters? Is there a registry back in BD that I can check?\nStep 1: Consult your neighbors and local land brokers. Land brokers are locals who act as informal real estate agents besides their primary profession/business. They tend to keep tabs on who owns which land, who's selling, who's buying, current price rate etc. (they'll also readily help you to sell off your mom's portion but would try to rip you off 90% of the time) (If the land is in Dhaka or a major city, the land brokers may not know but this tactic surely works in villages and small towns)\nStep 2: When you identify the exact location of your grandfather's land with the help of locals, use the 'Mouja Name' and 'line number' of the land to obtain its documents from local registry office, AC Land Office and DC office.\nStep 3: Calculate the inherited portions of everyone by deducing which relatives of your grandfather were alive when he died.\nHow can I check if my oldest aunt and my grandfather’s cousin actually sold any of the land?\nOnce you identify the lands, you can search the local registry office for any title deeds of those 'moujas' where your oldest aunt was the transferor. If you find such deeds, you'd know if and how much your oldest aunt sold",
      "votes": "1",
      "replies": [
        {
          "text": "Very sound advice, thank you so much!! Just a quick question please, do you think my aunt would have been able to actually sell the land behind my mum’s and her other 4 sisters’ back?",
          "votes": "1",
          "replies": [
            {
              "text": "Your aunt can easily sell her own portion behind her sisters' back.\nShe could also be 'selling' her other sisters' portions by registering title deeds (if the registry office doesn't notice or takes bribes) and handing over possession. But the 'buyers' would find it impossible (at the AC Land office) to update the government records of the land in their own name.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Where you from? uk? my dad and his brothers went to claim their land etc (long story) and they had lots of problems because the didn’t have a BD passport so i recommend getting that before you go if you don’t have one.",
      "votes": "1",
      "replies": [
        {
          "text": "Yes I am and were your dad and his brothers able to get their inheritance?",
          "votes": "1",
          "replies": [
            {
              "text": "Yeah allhamduillah but they had to get the bangladeshi passports before they was able to get it.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Just a word of advice\nI have heard of people killing siblings, nephews, cousins from abroad just to deny them their share of land\nSo be careful and do not go alone. And avoid eating at any aunts home with whom you have a potential clash.\nSounds paranoid, but most people born and brought up in BD (specially rural areas) are criminal minded when it comes to land and stealing it",
      "votes": "1",
      "replies": []
    },
    {
      "text": "গ্রামের চাচাতো ভাই about to ruin your whole life 🤣",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Possession is Nine-Tenths of the Law The phrase means that when someone physically possesses something, there is a stronger legal claim that it belongs to them than anyone else. In other words, custody presumes ownership.",
      "votes": "-1",
      "replies": [
        {
          "text": "What sort of BS law is this? Anyone can take anyone elses property and money this way",
          "votes": "3",
          "replies": []
        }
      ]
    }
  ],
  "id": 152
}