{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ajs1mf/cross_border_shelling_what_are_the_legal_aspects/",
  "hash": "69398b31288daccd70e7341d456048ae",
  "scraped_at": "2025-12-10T02:45:18.199501",
  "title": "Cross border shelling ,what are the legal aspects ?",
  "description": "I just wanted to know, what are the legal remedies, if someone dies from cross-border shelling, I.E. the two people who died yesterday in Bandarban. Is there a police case, investigations/ post mortems? Is there any way of compensating them from Bangladesh / Myanmar? How are things done in such scenarios?",
  "votes": "9",
  "comments": [
    {
      "text": "Doubt there would be compensation from Myanmar since yk their government is defending themselves against a civil war so they would not take responsibility",
      "votes": "9",
      "replies": [
        {
          "text": "The current Myanmar regime is highly unpredictable, and Bangladesh's authoritarian government has no idea how to deal with them in the event of an all-out fight with Myanmar's rebels. One thing is certain: India cannot solve this crisis, and Bangladesh's only hope is China. China might exploit this scenario to increase its sales to Bangladesh. Consequently, in the future, Bangladesh's regime might lean more towards China, which could also unsettle the US.",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "Bangaldesh should move citizens out of that zone and seal the borders and not get involved until situation comes down.\nAlso BD gov can only deal and communicate with yangoon until gov changes in Yangoon.\nEDIT: NOT yangoon. NAYPAYIDAW.",
      "votes": "8",
      "replies": [
        {
          "text": "i thought mandalay was the capital 💀🙏",
          "votes": "1",
          "replies": [
            {
              "text": "Mandalay Rum",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 153
}