{
  "url": "https://www.reddit.com/r/bangladesh/comments/18vgpqz/need_advice_please/",
  "hash": "8e9c7f3ebfa07d19068251cbe91f1414",
  "scraped_at": "2025-12-10T02:46:06.742341",
  "title": "Need advice please",
  "description": "Hello all, new to this subreddit. I have a family issue that involves some complex situation with the law. My sister and my mother and father are being thrown into a court case by my brother's (almost separated) wife on a false basis. Basically my brother and his wife have had some very serious issues and I would be stuck here all day listing them all. My brother has been abused by his wife (physically and verbally) and his wife has just been extremely horrible to our family. However my brother also must have had issues as well, but I cannot speculate fully. My mother and father never said a bad word to my sister-in-law, neither has my sister. They have all tried to give support but obviously this marriage is failing.\nNow my sister-in-law is threatening to start up a court case on the basis that my sister and my parents abused her. I don't know what evidence she has.\nI don't know how they are going to handle this. My sister is a very kind woman but she cannot take the tension of having to go to court or have the police come over to her house to detain her, especially with her having to take care of two young kids. My parents are old now and already stressed (my brother caused them a lot of issues previously in life) and my father in particular has become very soft and I am afraid for his health now. I do not know what to do, I do not live in Bangladesh and I cannot even give support right now. Even if my family wins the case, the stress will end them. I do not know what to do other than pray. I am not comfortable sharing sensitive details but if anyone can just give any legal advice as to what to do. We have tried negotiating over and over again with the woman but she is a stubborn woman and I think may have mental issues of her own. I really do not know what to do.",
  "votes": "3",
  "comments": [
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 156
}