{
  "url": "https://www.reddit.com/r/bangladesh/comments/16oiorl/%E0%A6%B0%E0%A6%9C%E0%A6%A7%E0%A6%A8%E0%A6%A4_%E0%A6%A6%E0%A6%A8_%E0%A6%A6%E0%A6%AA%E0%A6%B0_%E0%A6%AC%E0%A6%AF%E0%A6%95_%E0%A6%A2%E0%A6%95_%E0%A7%A8%E0%A7%A6_%E0%A6%B2%E0%A6%96_%E0%A6%9F%E0%A6%95_%E0%A6%9B%E0%A6%A8%E0%A6%A4%E0%A6%87_%E0%A6%95%E0%A6%B0%E0%A6%B2_%E0%A6%AA%E0%A6%B2%E0%A6%B6_%E0%A6%B8%E0%A6%A6%E0%A6%B8%E0%A6%AF/",
  "hash": "bb8437942051c4df1d71c3c2a97032ec",
  "scraped_at": "2025-12-10T02:47:58.157954",
  "title": "রাজধানীতে দিনে দুপুরে ব্যাংকে ঢুকে ২০ লাখ টাকা ছিনতাই করলো পুলিশ সদস্য | সিসিটিভি ফুটেজ | Channel 24",
  "description": null,
  "votes": "24",
  "comments": [
    {
      "text": "IFIC managers need more security, due diligence, and emotional intelligence training. The bank didn't even inform the local police station of the incident. Thank god they had their CCTV working at the least.",
      "votes": "10",
      "replies": [
        {
          "text": "The managers of this branch should be questioned whether they were involved or not. Also, how can police officers raise a hand on someone in public without a legitimate cause? The victim didn't show aggression at first. These on-duty officers don't look sober to me, either.",
          "votes": "6",
          "replies": [
            {
              "text": "The bank manager didn't know that the guy had this much money in his bag. What I found weird is the bank manager didn't even protest a bit and didn't even report the incident to the local police station or even the bank's own security team. S/He's supposed to safeguard everyone as long as they are within the bank. The local station was informed by the victim's boss at 2pm and went to the bank at around 2.30pm and the incident took place at around 10.45am. I just think managers have more to do in such a scenario.",
              "votes": "6",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "ঐ তোরা কৌ রে?\nবিদেশ গেলে দেশের ব্রাইন ড্রেইন হইচ্ছে পাবলিকগুলো কৈ? হাসিনাকে চিরস্থায়ি করতে হবে মার্কা পাবলিকগুলো কৈ? বাংলাদেশে কানেকশন ছাড়া start up দিয়ে ফাটায়া ফেলা যায় মার্কা পাবকিলগুলো কৈ?",
      "votes": "3",
      "replies": []
    }
  ],
  "id": 163
}