{
  "url": "https://www.reddit.com/r/bangladesh/comments/16kwyb2/do_you_think_the_law_should_be_equal_for_both_its/",
  "hash": "5dda2ee15b50f48339babcab65cd1f0b",
  "scraped_at": "2025-12-10T02:48:14.540182",
  "title": "Do you think the law should be equal for both? It's not like only men are engaged in adultery in our society.",
  "description": null,
  "votes": "28",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Is surprising & at the same time alarming how no one trying to adress the issue,rather trying to talk deflecting the real issue. There might be other worst case scenario in bd doesn’t mean it can't be discussed. How two people engaged in this sort of activity doesn’t get similar punishment is beyond any of my imagination.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "What should ideally happen is that the party who engaged in the cheating would have financial consequence if it leads to divorce.\nBut that also will give birth to cases, where the offending party might claim that their spouse was aware/consented/took part in said activities, but now had rescinded and accusing that person of cheating, or tricked that party. Tokhon abar provisions rakhar lagbe, ultimately no fault e choley jabey.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Btw one question to the peeps here, to make evrything fair in law, do we also support the women getting equal of what her brother gets in inherited property?",
      "votes": "1",
      "replies": [
        {
          "text": "Shaami mara gele auto bou pay?",
          "votes": "1",
          "replies": [
            {
              "text": "Shaami mara gele auto bou pay?",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "-5",
      "replies": [
        {
          "text": "It's not about the moral conundrum of society. We're talking about creating a fair and just legal system for both genders but surprisingly, still hasn't been fully realized in the 21st century.",
          "votes": "3",
          "replies": [
            {
              "text": "Huh? Are you saying \"moral conundrums\" are not part of the legal system?\nWhen you say fair and just, if you mean that every law should be applied equally to everyone, how is that working out? You begin with the assumption that the playing field is level for everyone when it's not. No surprises there. Fair and just don't begin to apply till you have a level playing field",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "কিন্তু মেয়েদের শারীরিক অত্যাচার কিংবা মানসিক অত্যাচার করলে তো শাস্তির বিধান আছে",
          "votes": "2",
          "replies": [
            {
              "text": "And marital rape is also considered legal.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "of all the crimes and immoral, unethical behavior in this society, yes, let's focus on that gives physical gratification and makes people's lives better. especially the one where arranged marriage makes a large amount of marriages loveless",
      "votes": "-1",
      "replies": []
    },
    {
      "text": "",
      "votes": "-5",
      "replies": [
        {
          "text": "\"There are more pressing issues\" doesn't mean we have to ignore this issue",
          "votes": "4",
          "replies": [
            {
              "text": "not forever but for now yes we do have to, govt doesnt have endless resources.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "-5",
      "replies": []
    },
    {
      "text": "Ensuring justice is important. It needs to create the atmosphere of using the laws sincerely. The modification of a law means nothing in Bangladesh.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "This is just bullshit.\nUnless Bangladesh makes her laws in accordance with International ideologies, we are f**ked.\nOh, it seems we are already f**ked🫡\nHey OP! Could you kindly tell the source of this law?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Litigating citizens' sex lives is mega weird. Cheating sucks and people in strictly monogamous relationships who do it are scum. No questions. But making it illegal is stupid. No developed country does it. And it is not going to magically stop people from cheating.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 164
}