{
  "url": "https://www.reddit.com/r/bangladesh/comments/16a4dic/law_advice_on_land_topic/",
  "hash": "a9e7865b4c7437f76541b0bbe75c3268",
  "scraped_at": "2025-12-10T02:48:48.668237",
  "title": "Law advice on Land topic.",
  "description": "I know this isn't the right place to ask. Wanted to know the whether Bainama and registered Bainama is different or its same?\nCause in normal Bainama I saw mostly its done at any place and any time of the day.\nBut in Registered bainama thing why is it to be done like the process of land registry? Go with your ID card, kazna copy etc.\nIs in Registered Bainama they are taking registry of half the land? Cause by what I know in normal Bainama they are just giving a advance payment and guarantee of buying the land.\nWould be thankful for getting a answer. Cause a buyer is saying me to go for the registered bainama.",
  "votes": "9",
  "comments": [
    {
      "text": "Bainama and baina patra are different types of documents, one is sale certificate and the other is an agreement to sell land. If it is a baina patra it needs to be registered, it's mandatory. Otherwise it will have no legal value.",
      "votes": "3",
      "replies": [
        {
          "text": "Oh ok. To have legal value I should go for the registered bainama.",
          "votes": "1",
          "replies": [
            {
              "text": "Yes and you have to execute the sale deed within six months from the registration of the bainapatra. If you're, for any reason, unable to execute the deed you have to extend the term of the bainapatra before expiration of six months.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I believe it that is correct, you need to go there and consent to the sale, then a Sale Permission will be drafted and approved by the office.",
      "votes": "1",
      "replies": [
        {
          "text": "Oh ok. Thank you.",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 166
}