{
  "url": "https://www.reddit.com/r/bangladesh/comments/155u5hm/how_can_i_file_a_complaint_to_the_police_with/",
  "hash": "a393240f1a9929698d44fefe2756324e",
  "scraped_at": "2025-12-10T02:50:25.013391",
  "title": "how can i file a complaint to the police with evidence without providing my real identity?",
  "description": "now we all know that the police in bangladesh are corrupt. im somewhat scared to talk to them. i want to file a complaint about a harasser online but i cant seem to figure out a way to talk to them anonymously. i know that if i provide them with screenshots of evidence of the relentless harassment that im facing from this person, they might trace the numbers back to me. and unfortunately, this stalker knows my home address which they claimed that they used police equipment for.\nis there anything i can do or am i screwed?",
  "votes": "15",
  "comments": [
    {
      "text": "Anonymous complaints are not possible for obvious reasons (people wouod misuse the hell out of it). You can file a GD online though",
      "votes": "4",
      "replies": [
        {
          "text": "GD?",
          "votes": "1",
          "replies": [
            {
              "text": "General Diary, complaint",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "File a gd online. You have to provide your identity to record as evidence.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Here from Sweden i want to help you. I have 2 version you can take. First, the easy way but not the best. Take a good VPN for they do not know your \"Ip\" internet location and trace you easely. I recomend NordVPN or express Vpn. The problem with this is is they will have more difficulty to trace you but if they want they can. 🔥 So this option can is better but more difficult to do. Take Vpn. Put the prove (If its picture) of harasser on the game Rise of kingdome and put the picture a on a alliance. with that they will never trace you with picture. After you secretly take phone on a guy you do not like. You install rise of kindom and join alliance you put the prove picture. You take screenshot oh prove with his phone and sent with his phone the prove at police. With that only the poeple who you do not like will be in the shit and they will never find you but you have to not use your account on his phone and you have to uninstall rise of kingdom on his phone and the picture on his phone after.\nBut for real i recommend you to do not do someting dangerous for you or other poeple but its can be usefull if you are desespered.",
      "votes": "-4",
      "replies": []
    },
    {
      "text": "কোন জনপ্রিয় content creator কে রাজি করিয়ে এ ঘটনা ভাইরাল করে দেন",
      "votes": "-4",
      "replies": []
    },
    {
      "text": "লুল, ফেসবুকে, কোরা (quora) তেই মানবতার ফেরিওয়ালা সাজে।",
      "votes": "2",
      "replies": [
        {
          "text": "লুল, ফেসবুকে, কোরা (quora) তেই মানবতার ফেরিওয়ালা সাজে।",
          "votes": "2",
          "replies": [
            {
              "text": "Do u know the guy?? Or just reflecting ur own impotence and impertinence?",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 172
}