{
  "url": "https://www.reddit.com/r/bangladesh/comments/1515pj8/i_am_being_blackmailed_and_stalked_but_i_dont/",
  "hash": "a184b1b5ff72019f474fef5ab2106f11",
  "scraped_at": "2025-12-10T02:50:58.600405",
  "title": "i am being blackmailed and stalked but i dont know how to proceed.",
  "description": "EDIT: I am not accepting DMs at the moment. I'm very sorry for this. If you want to suggest me something, we can have a conversation in the comments.\ni wanna preface this by saying that i am mostly straight. i have nothing against people for their sexuality or gender. this is purely my own experience and i know that this is a unique situation. We're both adults.\nTLDR; I am being blackmailed by a person i met on grindr. he is pulling up my private photos, screenshots of my family's profiles and essentially stalking me and blackmailing me into getting into a relationship with him. i managed to get relevant details about him and some of his family and i am exploring my legal options against him. would love suggestions on what to do and knowledge on what my options are.\ni was on grindr to make some friends. i was messaged by this person who wanted to be friends. and he was desperate from the very beginning. i told him that i just wanted to be friends but he insisted that we have a relationship. so i said whatever happens happens because i was not totally opposed to the idea. i gave him my whatsapp number and my first name. we went out one time (he paid for the date even though i offered to take the bill, this will be important later) and i told him that this isn't working out and that his desperation is turning me off. so i tell him all that and ghost him because he kept relentlessly texting me. a few days later, his harassment took a new height.\nmy facebook profile is private. so i dont know how he did it but he found out who i was friends with and commented on their posts saying bs like \"this is a gay person who is a cheater and a liar\" and asked for his money back. so i text him and say that i will return his money if he stops harassing my friends and family. he deleted the comments so i give him his money back today and he stops for a few hours. he texts me again saying that he loves me and all that and i try to explain to him that it will never work out between us. so he accepts it and moves on. while i was doing all this, i was exploring my legal options because if he harasses my friends and family again, i am willing to sue this person. i also deactivated my facebook because of this and asked my friends to report these accounts if they spring up in the future.",
  "votes": "25",
  "comments": [
    {
      "text": "You should raise a complaint at the cyber crime unit",
      "votes": "19",
      "replies": [
        {
          "text": "can i at least learn about what options do i have without revealing any of the info or filing an official complaint? i want to stay anonymous because as i said i think his father might be powerful. and the election might overshadow whatever his son's doing.",
          "votes": "7",
          "replies": [
            {
              "text": "Let him do whatever he wants. In thr end just deny it was you on grindr. Maybe some person was pretending to be you. Thats it.\nAnd dont you have his pic or any info?",
              "votes": "7",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Man, I feel for you. I'm really sorry you're going through this. I have an almost similar experience with Grindr (I'm a 23 year old woman) and I wish I could do anything about the problem I had been facing.\nI thought I would find bi/homosexual girls there being a naive 18 year old but instead stumbled upon a bunch of creepy men. Started a conversation with this older narcissistic asshole who then groomed me despite being in a serious relationship secretly. He destroyed my emotional state by making me do absolutely horrible things like self harm. Mf told millions of lies about me to clean off any kind of accusations he got after getting found out by his people. I wish I could turn back time and change everything.\nA month or so ago he contacted me again after 4 years hurling baseless accusations towards me. I sent him a long text saying I would bust his ass to the police if he kept bothering me like this and then blocked him everywhere.",
      "votes": "9",
      "replies": [
        {
          "text": "that was quite an experience you went through. but im glad that's over for you. did he ever publicly spread misinformation about you, like on your facebook or somewhere else?",
          "votes": "1",
          "replies": [
            {
              "text": "He texted my sister on Facebook and told her utter bullshit about me but my sister did not believe any of that because not even my enemies would think of me like that in a million years. He also said horrible lies to his wife about me and made her curse me and accuse me of being a homewrecker. Sure dude, a 17 year old is capable of wrecking a 30 something dudes home.\nNow I deeply regret not making one of those expose post on Facebook about him.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Go to a nearby police station and file a complain against him.",
      "votes": "5",
      "replies": [
        {
          "text": "can i at least learn about what options do i have without revealing any of the info or filing an official complaint? i want to stay anonymous because as i said i think his father might be powerful. and the election might overshadow whatever his son's doing.",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "May I ask how old u are and the guy?",
      "votes": "4",
      "replies": [
        {
          "text": "we are both adults",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Any update?",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 174
}