{
  "url": "https://www.reddit.com/r/bangladesh/comments/14w2dh9/i_desperately_need_legal_help_about_a_seual_aault/",
  "hash": "29e5c04073f0e74ea2987cbf597cfe35",
  "scraped_at": "2025-12-10T02:51:15.985598",
  "title": "I desperately need legal help about a se*ual a**ault",
  "description": "Please take your time to read and give advice it is very important. Someone's course of life depends on it. One of my friends' minor relative(Under 13) got ra#ed by her teacher in 2021.Schools had just opened and she didn't know any teacher previously. The teacher normally called her like any other teacher does and dragged her into a secluded corner and ra#ed her.He also threatened her by saying he will tell her parents and ruin their reputation, held her mouth tightly so she couldn’t scream and threatened her if she moved.The kid didn't say anything to her parents or family member since she was too scared but recently confided in her sibling that one of the guardian had seen the ordeal and SPREAD A RUMOUR THAT SHE WAS HAVING S#X WITH HER TEACHER WHO WAS APPARENTLY HER LOVER.Mind you the kid and the teacher are in entirely two different class shifts, there is no way of them crossing paths unless it's exam season.She decided to confide now because she could try to hide and bear with what happened to her but the rumour,bullying from students is too much. Now my question is what can the kid's family do in this situation?It's already been over two years,there is no proof except that one guardian who allegedly witnessed the ordeal.Where do you find Advocate for a child rape victim in dhaka?what is the whole legal process?How much money is needed?Can the victim maintain annonimity?Her parents are close minded will probably blame her.Can her sibling take custody of her?",
  "votes": "63",
  "comments": [
    {
      "text": "This is a serious case! You guys should consult with a professional lawyer instead of seeking advice on reddit. Definitely it's possible to sue that teacher if few more students open their mouth. I'm pretty much sure there are more student's out there who were molested by that bustard.\nTake ACTION ASAP!",
      "votes": "58",
      "replies": []
    },
    {
      "text": "\" The kid didn't say anything to her parents or family member since she was too scared \"\nliterally how shitty parents you have to be that your baby is afraid you confide into you about being sexually assaulted??",
      "votes": "38",
      "replies": [
        {
          "text": "Its hard to tell.when i got teased from some random guys on street my mother scolded at me when i came home.so no surprize this is reality",
          "votes": "15",
          "replies": []
        },
        {
          "text": "Welcome to the reality of Bangladeshi parents. 90% of them feel like they had a baby out of spite and now are deadset on torturing them for just existing. And then go pikachu face when they turn out like that Oishi girl",
          "votes": "30",
          "replies": [
            {
              "text": "'that Oishi girl'?",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "You do know that this is not at all uncommon behavior for rape victims across the globe, even ones who are adults? Many are afraid they won’t be believed, some are too traumatized to talk about it, and some are ashamed (even though they shouldn’t be).",
          "votes": "2",
          "replies": [
            {
              "text": "being common doesn't make it a failure of the parents to gain the necessary trust of their own freaking children.",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "",
          "votes": "-15",
          "replies": [
            {
              "text": "This is reddit dumbass bitch",
              "votes": "4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "https://limaandassociates.com/\nthis is very popular law firm, try to contact with them.",
      "votes": "17",
      "replies": []
    },
    {
      "text": "Talk with a lawyer, I saw Lima and associates link given below.\nConsult with them after that. Contact a journalist (Of course with a Lawyer consultation). And Be public with the School name. It will pressure the school into taking action.",
      "votes": "14",
      "replies": []
    },
    {
      "text": "confided in her sibling that one of the guardian had seen the ordeal and SPREAD A RUMOUR THAT SHE WAS HAVING S#X WITH HER TEACHER WHO WAS APPARENTLY HER LOVER\nWHO THE FUCK WAS THAT GUARDIAN???? Put them in jail first. Fucking braindead morons Making the girl suffer more and more. A guardian should have some basic sense. Hayre Bangladesh. Now a minor rape victim is getting bullied. Jesus Christ, this country. I just don't have words to say. OP BE WITH HER. I can't even imagine what she has gone through. Help her as much as you can, please. BE WITH HER.",
      "votes": "14",
      "replies": []
    },
    {
      "text": "\"Her parents are close minded will probably blame her\" what a shame!! :'( First beat her parents till half death cause they're the one to blame, They didn't raised their children good enough to talk about their problems. Infact the kid was scared, man just thinking about the kid that what she's been through making me cry, That kids parents are failed to be human and such a disgrace to the society. I don't know whether she's gonna get justice but from now please take care of the kid and never let her down. Things like bullying, rumor and what not gonna effect her entire life tremendously so please take care of her.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Which school is this?",
      "votes": "6",
      "replies": []
    },
    {
      "text": "you need to take action asap. the longer you delay it, the more the authorities will neglect it. i feel so sorry for the poor girl. please comfort her and keep her safe. i wish i could rip the hearts out of that teacher and that guardian",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Put a case on School authority first, what kind school employes this kind of teacher. Then grab the tracher by neck leagally. It will be an ordeal for you. Our county and people supports this type o people (worst than animals). I don't know what to say. Go to some recognized human rights organisation or lawyer affiliated with them. A lawyer can be bought very easily especially in our country. Our parents thinks more about society rather than their own child and its a shame to be honest.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "take some of your friends and confront that mf. he has probably done this to other students too. beat him to near death and একটা ইটা দিয়ে সোনা টা ছেচেঁ দিয়েন শুয়োরের বাচ্চার। also parade him to the school where he teaches and the area where he lives, in his underwear wearing a placard. do this with some friends from outside of your locality, so that no one can identify whose child got molested.\nthose are my rants. take legal action ASAP. don't ignore this by any means.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Lawyer and police station is where the solution is.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "This shouldn't be neglected in any manner because the culprit may go on abusing others too. Please take initiatives asap.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Good lawyer can help, but again what evidence do u have. in reality you need evidence and facts.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "sadly nothing will happen to the teacher unless it's recent and viral case. even if he gets arrested it's been more than 2 years and the other witness the guardian or whatever is in the teacher's ( though most probably they will never go to court ) and legal stuff in courts in bd take a long time to get any result and being a Muslim country it's not likely the victim will get any favor as the proof is gone now. best thing you can do atm if you want quick justice is hire some chatro league er Vai and best the shit out of him and nothing will happen to you or the victim just make sure he stays alive",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Here’s a wild idea but thinking aloud - others should suggest whether this is feasible. Please also seek legal advice as suggested.\nIs it possible for an advocate, either the sibling or yourself, to confront the teacher in a private setting away from people about the allegations. The way that he spoke prior to the assault makes me think that he will likely make threats like he already has however he may also confess to the crime in this process. If you were to be recording the conversation then you may have a confession on tape/video. Something to think about in the context of Bangladesh’s legal system and lack of appropriate support for rape victims.\nI hope the victim is able to recover from this atrocity and may the perpetrator face justice in the hereafter if not in this life.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Allah eta ki porlam? 😓",
      "votes": "4",
      "replies": [
        {
          "text": "Bro, we used to study in a coaching center. The head teacher of that center usrd to groom the weak kids so that he can fulfill his desires with them. He's done it multiple times. That teacher had kids too! Shit is crazyy.",
          "votes": "9",
          "replies": [
            {
              "text": "Manush emn kn vai",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "sadly nothing will happen to the teacher unless it's recent and viral case. even if he gets arrested it's been more than 2 years and the other witness the guardian or whatever is in the teacher's ( though most probably they will never go to court ) and legal stuff in courts in bd take a long time to get any result and being a Muslim country it's not likely the victim will get any favor as the proof is gone now. best thing you can do atm if you want quick justice is hire some chatro league er Vai and best the shit out of him and nothing will happen to you or the victim just make sure he stays alive",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 175
}