{
  "url": "https://www.reddit.com/r/bangladesh/comments/14t4x43/bangladeshi_lawyers_of_reddit_help_me_register_as/",
  "hash": "99b99ebff040cb349f122b4800274315",
  "scraped_at": "2025-12-10T02:51:52.251871",
  "title": "Bangladeshi lawyers of Reddit, help me register as an Atheist",
  "description": "I am a banking sector professional who have gradually lost my interest in Islam. Mainly because I know a person who is acutely schizophrenic and it is my theory that Islam is wrong about some things.\nRegardless of my reasonings, I want my NID and passport to reflect my religious belief that means it should say \"none\" or be left blank in the field of \"Religion\". Note that Atheism is the lack or religion, its not a religion prima facie (lawyers let me know if I used this correctly).\nI actually tried to have my religion field left blank in the form of my passport, the counter person thought I forgot to write it and actually started to write Islam on the field themselves and said I should have written it as it has a \"*\" so its mandatory. I said \"ami icha kore khali rakhsi\" (It was intentional). The person looked up and said \"Vai amar shomoy ney\" (bro I don't get paid enough for this shit) and just took the paper to be processed.\nI would like to file an appeal in the supreme court to force the DGDIP, Ministry of Home Affairs to allow religion field to be left blank when applying for passports and take necessary action to train staff.\nI would like to file an appeal in the supreme court to force the Registrar, NID, SSD, Ministry of Home Affairs to allow religion field to be left blank when applying for NID and train staff accordingly.\nAccording to an opinion written by a Bangladeshi law firm:\nThe right to practice any religion is a fundamental right guaranteed under Article 41 of the Constitution of Bangladesh (“the Constitution”), which provides for the freedom of religion to be practiced, propagated and professed.(1) The term “religion” refers to one’s views of their relationship with God, to the obligation these views impose and the obedience to one’s will.(2) The freedom of religion consists the notion of freedom to believe and the freedom to act.(3) In other words, it can be said that an individual has the right to choose and follow any religion of choice;(4) not necessarily the one assigned at birth which essentially means that the freedom also includes the right to hold no religious belief at all.(5)",
  "votes": "45",
  "comments": [
    {
      "text": "Please be careful. There are actually crazies in Bangladesh who will try to hurt you",
      "votes": "26",
      "replies": []
    },
    {
      "text": "If you somehow do this, this will be in the news. Atleast on social media. You will be dead within a week. Be careful brother. This isn't the US.",
      "votes": "16",
      "replies": []
    },
    {
      "text": "Only Sheikh Hasina can fix your registry, try to get a personal consultation from her. All these stupid things written in the so called constitution, nobody follows, nothing matters in Bangladesh, bribe officers in NID, Passport office to update your shit. If a rohingya can get NID, you can update your shit if you spend five figures.",
      "votes": "40",
      "replies": [
        {
          "text": "word.",
          "votes": "7",
          "replies": []
        }
      ]
    },
    {
      "text": "Ayyy it would be really cool if you actually file an appeal and win the case!\nMore power to you. I fully support what you are up to and I believe it would be revolutionary if you manage to successfully pull this off ‘cause bd govt doesn’t recognize atheism in a way. Good luck, brother!",
      "votes": "31",
      "replies": [
        {
          "text": "Would make op a target of a lot of crazy folks though",
          "votes": "13",
          "replies": [
            {
              "text": "Also name him a US agent.",
              "votes": "9",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "mere felbe re bhai apnake",
      "votes": "30",
      "replies": [
        {
          "text": "May be thats his way of committing suicide. Let the man be…stop judging",
          "votes": "11",
          "replies": [
            {
              "text": "Now that's one hell of a way to die!",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Nid card nd passport does not mention religion.",
      "votes": "22",
      "replies": [
        {
          "text": "They are required...",
          "votes": "8",
          "replies": []
        },
        {
          "text": "Yea im confused by that too. Smells like a troll post",
          "votes": "12",
          "replies": []
        },
        {
          "text": "In the form of both NID and passport religion is required. I have double checked. Both Registration forms that are online require the religion field and that has to be filled to move on to the next page. The pdf version of both of these forms also mention religion with a star sign in the passport form but no star sign in NID form. Please check and update your comment.",
          "votes": "9",
          "replies": []
        }
      ]
    },
    {
      "text": "For passport I faced the same thing. The guy who processes my file froze like he has to finish and get on with it. I understood his point. But there should be a place where you can just say none.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "But passport doesn’t have religion on it",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Note: I checked বাংলাদেশ পাসপোর্ট নীতিমালা, ১৯৭৪ and it has no mention of religion in the form. I don't know why the new form includes religion as there has been no major changes made except a presidents order in 2003.",
      "votes": "26",
      "replies": []
    },
    {
      "text": "Wow, you got guts to be openly atheist in a place like Bangladesh. I have a hard time believing posts like this.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "I remember i left the religion field blank when i filled up my HSC registration form. I was called to the principals office multiple times, I explained why i left it blank and they forced me to write down Islam. I hate this sorry ass country.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "নিজের জীবন কেন ফালতু ফালতু মুশকিল করতে চাইছেন ? Just claim to be the religion your parents are and be done with it. আপনার ভেতরের ভাবনা চিন্তা আলাদা কথা।",
      "votes": "3",
      "replies": []
    },
    {
      "text": "If you don't believe in any religion, you can ignore the religious rules. How is it important to express it to others? If you're identified as an atheist, you'll be extremely criticized by the zealots.",
      "votes": "14",
      "replies": [
        {
          "text": "He is not expressing rather want to change his own status.",
          "votes": "10",
          "replies": []
        }
      ]
    },
    {
      "text": "Be safe and courage to you.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "I wanted to keep it blank as well but not in a position to so back then. Keep updating us about the process.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Its better to be an atheist than following islam",
      "votes": "5",
      "replies": []
    },
    {
      "text": "No, only 4 are recognized by bd. Every country has a list of their recognized list of beliefs that can be put on a document. Such as you can put “Wicca” as a religion in USA. Where as you cant in others. Its country specific. In Bangladesh you have to write something whether you believe it or not.",
      "votes": "2",
      "replies": [
        {
          "text": "No, only 4 are recognized by bd. Every country has a list of their recognized list of beliefs that can be put on a document. Such as you can put “Wicca” as a religion in USA. Where as you cant in others. Its country specific. In Bangladesh you have to write something whether you believe it or not.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Religious folka brag about it. Tell us day and night how they are great, go on rants in waz mahfils with loud speakers that i cant drown out, of how we are all going to hell.\nThis man just wants his conatitutional right to leave the field blank and during census write nothing. Gov officials and reps who write nd receive forms need that instruction that a persons name doea not indicate his religion.",
      "votes": "20",
      "replies": [
        {
          "text": "Religious folka brag about it. Tell us day and night how they are great, go on rants in waz mahfils with loud speakers that i cant drown out, of how we are all going to hell.\nThis man just wants his conatitutional right to leave the field blank and during census write nothing. Gov officials and reps who write nd receive forms need that instruction that a persons name doea not indicate his religion.",
          "votes": "20",
          "replies": []
        },
        {
          "text": "It’s not about bragging. It’s about having the right to choose what you believe in. If you identify as non-binary or let’s say transgender and only have an option to choose between male or female in your passport application, how would you feel?",
          "votes": "11",
          "replies": []
        },
        {
          "text": "When you don't believe in a religion, it's not something you have to brag about, right? If you're doing the same thing as religious folks, what makes you any different?\nIt's not about bragging, dude. It's more like the state you live in is finally recognizing your identity officially. I don't know how it relates to 'bragging' at all.",
          "votes": "8",
          "replies": []
        }
      ]
    },
    {
      "text": "Till date its not possible by law. You need to change that by a rite petition. That will cost you 6 fig. And the vpn thingy thats useless. You posted to hire a lawyer. So when you made contact, your identity exposed. And if you’re really need that to be blank, then get a foreign pp and left that blank there. If you dont want to go to abroad, I mean you dont want to seek asylum by proving that you are atheist why bother with that. Just left it as it is. Why bother. Can’t change something in some places. Trust me been there, done that. Btw, vpn is a joke. Reddiitor in bd r crap, in this sub is a dumping ground for all the emotionally ppl about their hate and etc. if you really want to seek real legal advice go to fb and search #kyr. A fb group with real lawyers.",
      "votes": "1",
      "replies": [
        {
          "text": "I don't want to contact lawyers first as it may reveal my identity. Don't want asylum.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Why does that even matter? You can have your own beliefs. Doesn't mean anything if it on NID or passport. And I'm sure it's ganna be borderline impossible to have that done.",
      "votes": "0",
      "replies": []
    }
  ],
  "id": 177
}