{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ohan45/clash_leaves_almost_200_injured/",
  "hash": "30ba25b1addca0b73a7c3e717def6250",
  "scraped_at": "2025-12-10T02:07:23.182966",
  "title": "Clash leaves almost 200 injured.",
  "description": "peak Bangladeshi moments?",
  "votes": "33",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Spitting just instigated the matter, not the main reason for the clash.",
      "votes": "20",
      "replies": [
        {
          "text": "are you from Daffodil uni? also you really said that ''Spitting just instigated the matter, not the main reason for the clash'' as if you have a very beautiful reason to explain why mob Justice and vandalism is justified? thats crazy bruv🙂💔",
          "votes": "2",
          "replies": [
            {
              "text": "When did I say what they did is justified? Both parties did wrong there is no denying that",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "Please enlighten us then, what can justify beating each other up like this",
          "votes": "0",
          "replies": [
            {
              "text": "The incident started around 9:30 PM last night. A student from City University spat on a Daffodil University student while sitting on a motorcycle, which led to an argument. After that, a group of aggressive City University students attacked the area, broke things, and used local weapons to beat up Daffodil students at Bachelor Paradise (Student Mess). Some Daffodil students were taken hostage inside City University and tortured, which made the situation worse.\nWhen other Daffodil students nearby heard about it, they gathered peacefully in Khagan (Nearby area around City and Daffodil) to rescue their friends. The Daffodil administration tried to talk with City University to solve the problem, but City University didn’t respond even after three hours. Later, City University students mocked them and said, “Take your students if you can.” Soon after, another Daffodil student wearing a university jersey was badly beaten. When Daffodil students tried to defend themselves, City University students attacked again with weapons, making the situation even more violent.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Florida Bangladeshi man",
      "votes": "8",
      "replies": []
    },
    {
      "text": "",
      "votes": "6",
      "replies": []
    },
    {
      "text": "These are your future workers.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Are we talking about universities or gang members",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Basically a case of \"The other side are goons so let's teach them a lesson by being bigger goons ourselves\".",
      "votes": "3",
      "replies": [
        {
          "text": "Thats the only you survive and thrive in Bangladesh",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "This is hilarious. Natural selection at its peak. Kinda made my day seeing this in the morning LMAO",
      "votes": "5",
      "replies": []
    },
    {
      "text": "source:https://share.google/QwmdGAfCPo2rAKAcT",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Both campus is for you and both must be responsible ? Are you going in the dark ways or you want bright future! You decide",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 18
}