{
  "url": "https://www.reddit.com/r/bangladesh/comments/12osst2/am_i_supposed_to_not_be_paid_for_7_months_because/",
  "hash": "cf1c550b1d26bfce113d5e853671055c",
  "scraped_at": "2025-12-10T02:53:50.410635",
  "title": "Am I supposed to not be paid for 7 months because I was late to work?",
  "description": "Hello everyone, I (F24) had been working in a small startup since 2021. My contract said that I needed to work 8 hours a day but never mentioned about a specific time. My boss had always made it flexible as long as we got our work done. I would come to work around 12PM to sometimes 2PM and leave at 7-8PM and would also work from home if needed every night. As it was a startup and I was in the team from the beginning, I had to put on multiple hats and assist in others work. I didn’t mind doing any of it because I liked working there. And they never had any complains about my work. Never.\nI left the company last December on good terms. Even before that, I was not paid since October because the company was doing bad. The CEO of the company was no longer invested in the company as he had another venture to work on which slowly led the company to fall.\nFor months, they have been keeping me in circles and have been telling me that they will pay me but they never did. I am in a bad financial state right now and there’s Eid in less than a week so I demanded the money today to which they later said that I don’t deserve any money and I owe them money instead for being late to work. I understand that they can penalize me for being late but why bring this up after 7 months when I ask for the money? I was not compensated for overworking (which they are also denying now) There was also a time where I lost my phone, broke my limb only because I had to deal with a tough client of theirs. I’m not sure if Bangladesh’s employee rights cover for psychological damages as such but I’m sure that it is not legal to not pay your employees for 7 months. Furthermore, they were always late to pay salaries. They would pay after every two months or so. I was also asked to apologize for saying that I will take legal actions.",
  "votes": "34",
  "comments": [
    {
      "text": "Even if u were late to work....u went there and worked right? So......u owe them money....how? Tar upor 1 lac? Spineless crooks.\nUnbelievable. Cant express how angry reading about this is making me feel. Im sorry ur having to go through this but u shoikd forget about getting any money from them. I dont have a solution for u either.\nFellow redditors? Any lawyers by any chance?",
      "votes": "40",
      "replies": []
    },
    {
      "text": "People with knowledge about the bd law, I would appreciate the help.",
      "votes": "21",
      "replies": [
        {
          "text": "You will get the unpaid salary (7 months) + one month's basic salary for each completed year (since 2021) + unused annual leave (Leave encashment), in addition to other benefits, if any.\nThey could have taken action against you for being late. But for that, they have to follow a special procedure which apparently they did not. I would say it is too late for them to initiate the process, specially after you asked for your benefits.\nMy suggestion - talk to a lawyer and send them a legal notice.\nBangladesh has a special court (Labour Court) for this type of dispute; the matters are usually resolved within 1-2 years. Labour Court is very effective.\nIf you pursue it, you will get full benefits as I said above. And don't worry about the rubbish threats by your CEO. Talk is cheap. When the legal process starts, they usually pay.",
          "votes": "21",
          "replies": [
            {
              "text": "I left the company on December, 2022 and I was not paid since October, 2022. So that’s 2 and a half months of unpaid payment.",
              "votes": "10",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Not an expert on law, but I doubt the legal system will be of much help. You can contact the relevant association for the company, like BASIS if its a tech company or e-CAB for e-commerce. They might be able to help.\nIf I was in your shoes, I would have started a defamation campaign on social media against the CEO. These cunts usually get away with exploiting workers and the only way to get them back is through the media.",
      "votes": "12",
      "replies": [
        {
          "text": "For now wait, go abroad, get your papers, then start a defamation movement online. Post videos after videos.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "If you've signed contract with the company. Send a legal notice.",
      "votes": "5",
      "replies": [
        {
          "text": "There also have been many discrepancies from there side with the contracts. I was supposed to have a revised contract with the revised amount (which they never gave me but I have bank statements that can prove that I was provided that amount of money) I started my role as the lead on April but they made me sign the contract on June with the amount 13,000. Whereas I have been getting more than 13000 since April.",
          "votes": "3",
          "replies": [
            {
              "text": "কোম্পানির নাম বলে দিন, আমরা ওদের এই ছ্যাচড়ামির সমাপ্তি ঘটিয়ে দিচ্ছি।",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "How did you communicate with them? Email them so that they reply via email and you have it in writing. Ask them why they haven't paid you or why they don't think you deserve payment and hopefully they will reply directly that you were late to work or some other bs",
      "votes": "3",
      "replies": [
        {
          "text": "I contacted one of them through WhatsApp and the other throughly Messenger. They didn’t pay me because they are apparently in debt. The last time we spoke, he mentioned that most of the losses have been covered and we will be paid before Eid. Then he just start ghosting us once Eid started to come near. When my direct supervisor (lets call him A) wasn’t replying to my texts or calls, I texted the other founder, also my supervisor’s girlfriend (lets call her B) B said that she had no idea about this whereas A had been telling us that B had been dealing with the payments. Clearly there were bunch of lies so that is when I said that I will be taking legal action to B. B told A and A started calling me and texting me about how he had been patient with us and how I was never on time so I deserve no payment and owe them money instead. A also went onto how I ‘misbehaved’ with B so I MUST apologize to her.",
          "votes": "1",
          "replies": [
            {
              "text": "how I was never on time so I deserve no payment and owe them money instead\nIf you have that in writing it would be helpful for your legal case. Sounds like they're lying about being in debt",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Lawyer up dude, send a legal notice, then get those bustards",
      "votes": "3",
      "replies": []
    },
    {
      "text": "It's very unfortunate what happened to you. But there really isn't much you can do. Labor law is practically unheard of here, even if you did take the legal routes, it will just keep dragging on for years. If I were in your position, the best option is to expose them to social media. But don't be afraid to threaten them with legal action. Sent them a very professional letter mentioning you will be pursuing leagl option against them for your lost salaries with interest. In the meantime, spread the word everywhere........ Facebook, LinkedIn. Post it in your alumni group, was your organization member of any industry representative? (like how a garments company will be a member of BGMEA), reach out to them as well. Start up often receive funds from venture capitals or other organizations, reach out to them. If your company had clients, reach out to them as well. Sadly this is all you can do imho.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "These are ordinary 'chesra' IT companies with nothing disruptive or novel products. They added the term startup to sound cooler.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "This is really unfortunate but not surprising, especially in the startup scene in software industry, where I have heard from many people that the employees don't get what's on contract. There surely are laws to ensure that employer has to pay for the service agreed on the contract, but living in Bangladesh, I don't feel too optimistic how fruitful taking legal actions would be. As someone mentioned, exposing them on social media might be an option, but these people are probably shameless enough to care for anything.\nThat being said, I must say your English writing is absolutely fantastic, so if you are interested in something like a Business Analyst role (without knowing anything about your background), there are some reputed software companies, who would love to have you to work with their North American clients.",
      "votes": "2",
      "replies": [
        {
          "text": "It is very unfortunate because based on the relationship that we had, I never imagined in a million years that they would dare say things like this to me just because I asked them for something that is rightfully mine. I have told a relative of mine who is in the police force right now and we are working on filing a GD and send people to the venture capital firm that funded them. Perhaps then with proper guidance, I will post publicly because I don’t want to entangle myself with a defamation case.\nHowever, thank you so much for your kind words. I will actually be pursuing my Masters in Business Analytics from this July, In Shaa Allah.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-12",
      "replies": []
    },
    {
      "text": "You can try posting on this group:\nhttps://www.facebook.com/groups/knowyourrights.bd.org/?ref=share&mibextid=NSMWBT",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 184
}