{
  "url": "https://www.reddit.com/r/bangladesh/comments/11gpayf/us_passports_validity_less_than_6_months_is_it/",
  "hash": "02bff4579b22b22d3fe3a0e3e39be145",
  "scraped_at": "2025-12-10T02:55:14.034845",
  "title": "US Passport's validity less than 6 months. Is it going to be an issue entering BD?",
  "description": "Long story short, we'll be traveling to Bangladesh from the US in mid-March and leave by early April. My son's US passport is valid until September 17, 2023. So his passport will have less than 6 months (little over 5 months) validity left by the time we leave Bangladesh.\nAccording to BD immigration, you have to have at least 6 months left in your passport by the time you leave BD.\nThe question is, is it going to be OK for us or will we be deported back to the USA from the airport?\nThanks in advance for any information you can share.",
  "votes": "3",
  "comments": [
    {
      "text": "You clearly said that according to BD immigration, who do you think will let you in the country? Abide by their rule.",
      "votes": "4",
      "replies": [
        {
          "text": "The situation I'm in is pretty nasty. Applied for my son's new passport back in January. Paid a lot much extra for expedited processing and expedited shipping. For expedited processing, it should take 5-7 weeks. Today is the 7th week ending. Called them a week ago and found out they messed up my son's name with my street address (😂) and they clearly told me it's their own mistake and are trying to get me into a passport processing center for the same day passport. But until today no center has any vacancy. On top of that, I've already purchased the tickets, took the days off of office, son took his days off from school etc etc.\nI should abide by the rules. I agree. Let's see how I navigate this.",
          "votes": "1",
          "replies": [
            {
              "text": null,
              "votes": "1",
              "replies": []
            },
            {
              "text": ":( Sorry for you. Knowing Bangladeshi officials they will milk you for this :(",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Better to check with the embassy?",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Went from Boston to Dhaka w 4 months left in my Us passport last month .They didn’t say anything but idk if I was just lucky or not",
      "votes": "2",
      "replies": [
        {
          "text": "That's awesome. Thank you for sharing. 🙏",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Check with embassy. Talk to your office and your son's school ASAP about possible date changes. Talk with your travel agency/airline about that also, just in case you have to change travel dates. You have to cover all your bases.\nBD people are notorious for being lazy af with timing, even the embassies abroad. I got a million stories about the office here in Canada (Ottawa). Never ever book any days off, purchase plane tickets etc until you get your passport. Give yourself plenty of time. Keep contacting the embassy for updates. You gotta do that with them.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 189
}