{
  "url": "https://www.reddit.com/r/bangladesh/comments/119e0d1/is_it_legal_to_film_anyone_in_public/",
  "hash": "f52b4e52d10aff72407b3b29af4f9ec6",
  "scraped_at": "2025-12-10T02:56:01.944248",
  "title": "Is it legal to film anyone in public ??",
  "description": "Was scrolling through FB and saw a guy doing vlog while riding his bike where the police stated that the rider required a permit to record others.Now considering that was a public road and people were walking on public sidewalks where they risk themselves getting exposed to others,why would it be illegal to film then?Couldn't find any specific law stating ban on filming others in public without their permission.Can anyone verify the police's statement?",
  "votes": "14",
  "comments": [
    {
      "text": "More or less. You don't need a permit to record where there is no reasonable expectation of privacy (like in the streets outside of designated neighborhoods), and from your context it does not seem like the guy recording was focusing on a particular person so no.\nThe police officer was being a dick.",
      "votes": "9",
      "replies": [
        {
          "text": "I was thinking the same.But is there any specific penal code or something like that regarding freedom of press in public?",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "It’s generally prohibited in cantonments, ViP zones, police stations and government offices, also in some industries. So it might be somewhere in the above mentioned areas/nearby places.\nAnd ideally no, you shouldn’t video someone/focus someone’s activity without consent- particularly if you share those clips later in any form (online or CD/DVD etc.)",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Yes. You shouldn't expect privacy in publicly accessible areas; this includes government buildings (the spaces where people can go). As a citizen, it's your right to film those areas; you don't need permission. There should be more YouTubers in Bangladesh who can do first amendment like audit in Bangladesh. Sue the public officials who don't let you practice filming or taking images. They might have policy not to film, but policy doesn't trump law. If someone asks why you are filming them, say I intended to take a general view of the area, not any particular person, but you came up to me and chose to be a part of film.",
      "votes": "2",
      "replies": []
    }
  ],
  "id": 192
}