{
  "url": "https://www.reddit.com/r/bangladesh/comments/111w81c/%E0%A6%96%E0%A6%B0%E0%A6%9A_%E0%A6%AC%E0%A6%9A%E0%A6%A4_%E0%A6%97%E0%A6%A6%E0%A6%97%E0%A6%A6_%E0%A6%95%E0%A6%B0_%E0%A6%A5%E0%A6%95%E0%A6%A4_%E0%A6%97%E0%A7%9F_%E0%A7%A7%E0%A7%AE_%E0%A6%AC%E0%A6%B2%E0%A6%A6%E0%A6%B6_%E0%A6%97%E0%A6%B0%E0%A6%AB%E0%A6%A4%E0%A6%B0_rtv/",
  "hash": "d2011893cad9422502e93bd11aabdc08",
  "scraped_at": "2025-12-10T02:56:33.945533",
  "title": "খরচ বাচাতে গাদাগাদি করে থাকতে গিয়ে ১৮ বাংলাদেশি গ্রেফতার | Rtv International News",
  "description": null,
  "votes": "3",
  "comments": [
    {
      "text": "হাহা একটা জেলা থেকেই এইসব লোক আসে।",
      "votes": "5",
      "replies": [
        {
          "text": "Chandpur",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "Era na koekdin age protest korlo? Shesh porjonto to oikhanei gelo…",
      "votes": "5",
      "replies": [
        {
          "text": "ওয়েস্টে গালি দিয়ে ওয়েস্টেই তো আসে সব",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "Isn't that failure of France more than bangali how little they are paying them to make them live like that its not like people want to live like that",
      "votes": "-1",
      "replies": [
        {
          "text": "No. There are occupancy rules in the West. Also, when you sign a lease and you state X number of will be residing in the residence, you CANNOT bring in more than that and have them permanently stay with you. It is a SAFETY AND LEGAL ISSUE. Everyone HAS to be accounted for in a place of residence. Landlords or property management MUST know how many people are living in each unit and their identities. When we rent an apartment, we have to provide official identifications, employment records, credit history etc. Ichha hoilo ar 2 joner jonno banano ekta space e 10 jon ke dhukailam....its illegal and WILL land you in legal trouble. Also, its a HUGE safety issue for other residents on the property. In addition, if an emergency like fire or earthquake, how would anyone know who to look for?! 40 people could be missing but nobody would know....because theres no records of them being occupants of that property!\nAll of that is clearly stated in the contract BEFORE you are approved to rent/lease a property and you sign it. Its the same in France and most of Europe, Canada, Aus, USA. They kniwingly broke a legal contract.",
          "votes": "3",
          "replies": []
        }
      ]
    }
  ],
  "id": 194
}