{
  "url": "https://www.reddit.com/r/bangladesh/comments/10vcc0r/people_working_in_law_how_do_you_fight_against/",
  "hash": "49c702d9556a32bf0d20f7ce77bc669d",
  "scraped_at": "2025-12-10T02:57:21.328211",
  "title": "People working in Law - How do you fight against Corruption?",
  "description": "seeing people under the law- lawyers, police officers, investigators- committing a bunch of crimes along with the offenders, just makes me confused about how the justice system works here? Who am I supposed to go to when stuff like this is happening in High Courts? Am I supposed to give up or is there a way around it? If anyone has any words of advice or any sources who can help, please let me know.",
  "votes": "32",
  "comments": [
    {
      "text": "They dont",
      "votes": "16",
      "replies": []
    },
    {
      "text": "Fight against Corruption to loose the Job? Nah Rather, we led corruption against corruption or become the corruptionist.",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Why would they fight themselves? 🤣",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Corruption is deep rooted in our country. Majority of them are corrupted. Money decides the outcome in most cases.\nBtw your arts are really really cool man. One of the best I have ever seen. Keep it up❤️",
      "votes": "15",
      "replies": []
    },
    {
      "text": "They don't fight corruption, the ARE the corruption.",
      "votes": "7",
      "replies": [
        {
          "text": "Walter White moment",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "If there's corruption in an Big Gas/Oil company, let's say Chevron, can you fight corruption being an engineer in the company? THEY WILL KICK YOUR ASS OUTTA THERE.\nAll our governments in the past and in the present were and are corrupt. The general population is also, corrupt, it's just the scope is different as the capability to be corrupt and get away with it depends on your position in the society. Most people try to get a scoop of that tasty ice cream, it's just that with puny spoons some won't get much, while those with the big ones will get plenty.\nOver time as the population becomes more politically educated, the level of corruption will probably go down, if economic development continues over time alongside, I mean, there's a reason rich countries have IN GENERAL, less corruption. May even need a revolution of some sort. However, it depends on many factors, both domestic and international. People have different opinions on this issue.\nIndividually, not much you can do. All you can try to do is do your job properly with honesty. Doesn't mean you won't get bitten every once in a while by those who aren't doing their jobs properly, even if you are a pacifist. As I like to say:\"You are a vegetarian, good, but does the Angry Cow knows or cares when you are in front of it?\"\nAlso, you may try to start a revolution, starting from your workplace, but, Personally, in good conscience, I don't wanna really recommend that to a fellow human being who has his/her own life to live. We only have one life after all.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "This city needs Batman.",
      "votes": "5",
      "replies": [
        {
          "text": "There are indeed so many, but they are bound within our society ..",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Go and lick boots of those in power(doesn't matter who it is) that would work always, no matter who is in power.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "not in the law, but I think there is no future for this country. I read some history books, bangladesh was corrupt and looted by the govt and people in the administration right before and after independence war. This country will never progress, I feel like I am cursed bcz I was born in this country",
      "votes": "2",
      "replies": []
    },
    {
      "text": "You cannot, the system itself is corrupt",
      "votes": "2",
      "replies": []
    },
    {
      "text": "ব্যারিস্টার সুমনের মত নীতিকথা মার্কা ভিডিও বানিয়ে মনে মনে সুখ অনুভব করুন।",
      "votes": "1",
      "replies": []
    },
    {
      "text": "এখানেই কবি নীরব।",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 197
}