{
  "url": "https://www.reddit.com/r/bangladesh/comments/10tcj9d/inheritance_lawsoverseas_tax_advice/",
  "hash": "fb7352a4168b29687bde2493f0f7f1e8",
  "scraped_at": "2025-12-10T02:57:39.223070",
  "title": "Inheritance Laws/Overseas Tax Advice",
  "description": "Hi everyone,\nI am writing for a friend, looking for some legal advice about moving inheritance money from Bangladesh to Australia. The amount is sizeable, several times larger than the threshold allowed by law for individuals to take out of Bangladesh. As my friend's father passed, the will was bequeathed to them. They however live in Australia, and are an Australian citizen. Their partner is also travelling with them, and they plan to take US$5000 each twice each calendar year to remain within the threshold.\nCan someone point me in the right direction for information/where to gain counsel regarding this issue? Everything I've searched online on short notice has been very limited on it.",
  "votes": "6",
  "comments": [
    {
      "text": "What you are wanting is illegal according to Bangladeshi law.",
      "votes": "3",
      "replies": [
        {
          "text": "Serious question, it's illegal to take money that you legally inherited outside of Bangladesh? So in a hypothetical scenario if I were to inherit my parents properties and sold them the money would be stuck in Bangladesh with no legal means to convert and transfer out of country?",
          "votes": "2",
          "replies": [
            {
              "text": "Yes, it would be illegal to take the money outside BD",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Foreign Exchange Transaction Guideline (bb.org.bd)\nSee Chapter 11.",
      "votes": "2",
      "replies": [
        {
          "text": "Thanks so much 🤗",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Talk to a business person in Australia. Transfer money from bd account to bd\nAnd get dollars in Aus.\nOr\nInvest",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Where’s the illegality of this? I’m confused.",
      "votes": "2",
      "replies": [
        {
          "text": "Where’s the illegality of this? I’m confused.",
          "votes": "2",
          "replies": [
            {
              "text": "Where’s the illegality of this? I’m confused.\nExactly",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Only $20000 for a year for two persons? It is legal. If that is the case no problem. But managing $ is a problem I think you can overcome it's easy.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "You can try to find someone who needs money in bd so you can swap.",
      "votes": "1",
      "replies": [
        {
          "text": "This isn’t my inheritance, so it’s not my responsibility to tell them how to spend their money. I’m looking for someone who can give me an avenue for legal advice about how to deal with this issue.",
          "votes": "1",
          "replies": [
            {
              "text": "Sorry for not explaining properly, like your friend someone may want to send money BD too. Just exchange with them.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "There are ways that I know of that are not advisable. But I think it would be best if you talk to talk to a lawyer.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Do they have someone trustworthy in BD? Then they can transfer the inheritence money to that person's bank acc. Then he/she can transfer the funds to Australia. I dont think people can directly take money out of BD like that, at least not legally.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 198
}