{
  "url": "https://www.reddit.com/r/bangladesh/comments/zguoiw/does_bangladesh_allows_dual_citizenship/",
  "hash": "102d799ea00639d374242c79d94c87e5",
  "scraped_at": "2025-12-10T02:58:29.431639",
  "title": "Does Bangladesh allows dual citizenship?",
  "description": "If 2nd country allows it ?",
  "votes": "4",
  "comments": [
    {
      "text": "Yes.\nNowadays you need to get a Dual National Certificate if you have a second citizenship",
      "votes": "5",
      "replies": [
        {
          "text": "What is that?",
          "votes": "1",
          "replies": [
            {
              "text": "I wouldn't get it,I bet they are trying to tax Bengalis abroad just like the US",
              "votes": "1",
              "replies": []
            },
            {
              "text": "It's a new type of ID for Bangladeshis that have a second citizenship. From what I can gather, dual citizens aren't allowed to have the NID anymore.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Yes",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Yes they do but there are issues you may have to face, one being bribes that the officials want for processing it for you. It can be quite a hassle.",
      "votes": "1",
      "replies": [
        {
          "text": "What? Bangladesh allows dual citizenship. How and what process you need to give bribes?",
          "votes": "2",
          "replies": [
            {
              "text": "You can get it without bribes. Go to your nearest embassy or consulate and apply.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 201
}