{
  "url": "https://www.reddit.com/r/bangladesh/comments/zedmx0/does_anyone_know_the_legality_of_keeping_a/",
  "hash": "ef657940a7811db23a68d54efbf761ce",
  "scraped_at": "2025-12-10T02:58:46.082653",
  "title": "Does anyone know the legality of keeping a private animal bones collection in Bangladesh, Or maybe a private insect collection. Also legality of Taxidermy. (Private for mostly hobby and studies)",
  "description": "I'm wondering if i can legally keep Animal Bones in Bangladesh. It is completely for my hobby and not for business. I also wanna keep an insect collection. I obviously would not kill the animals and would try to collect dead animals. It would great if someone here knows the legality of keeping such collections.\nalso is it legal to make animal taxidermy in Bangladesh.(note i haven't started collecting them im here to know the legality before i start so i don't get into any trouble later)\nedit: accidentally didn't to put the 'not'",
  "votes": "0",
  "comments": [
    {
      "text": "Bangladeshi Jeffery Dahmer here....",
      "votes": "-3",
      "replies": [
        {
          "text": "You should avoid mix up things that you dont understand. No offence but your comment is so stupid its not even funny .",
          "votes": "3",
          "replies": [
            {
              "text": "No humour - check\nBone collecting - check\nLack of self-awareness - check\nLooks like Dahmer to me.",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "Its mostly for Studies and hobby, I really don't understand laws and Bangladeshi Laws are old and seem much broken so i'm not sure if they are still implemented or changed.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 202
}