{
  "url": "https://www.reddit.com/r/bangladesh/comments/zd4tlm/wedding_without_parental_consent/",
  "hash": "a96a992d5bf4ef495be0e6025642b34c",
  "scraped_at": "2025-12-10T02:59:03.551766",
  "title": "Wedding Without Parental Consent",
  "description": "We Wanna Get married without our parents knowing...we are currently under aged both being 18 But after reaching 21 we wanna get married..so will there be any problem like police getting involved or anything.. we both are agreed.. it's just our family isn't from same nationality so they won't agree..so our question is..after reaching our 21..will kazi create any problem? Or will police get involved? (N.B we both have consent after reaching 21) T.I.A",
  "votes": "0",
  "comments": [
    {
      "text": "...don't get married at 18, or even at 21, you fetuses. Seriously, don't do it. Do not do it. Down that road is years of regret and other pointless suffering.\nAre either of you financially independent? Where's the money going to come from? Where are you going to live? How are you going to eat?\nTrue Love does not, infact conquer all: you still have to live with the consequences of your decisions, so don't take such life-altering ones before you're capable of taking two steps on your own.",
      "votes": "32",
      "replies": []
    },
    {
      "text": "I think I can speak for most of us in this sub:\nHave you actually thought through the marriage? Like why do you both want to marry? Have you talked about how y’all will support each other, finances, housing, etc? Or is it a marriage of convenience? Do you guys have legal helped backed up if anything goes wrong?",
      "votes": "30",
      "replies": []
    },
    {
      "text": "They shouldn't cause any problem legally speaking but given that it's Bangladesh the Kazi might throw some tantrums. You should talk with a lawyer first, they will help you sort things out.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Depends on the kind of wedding. A secular wedding will have zero issues. You can get what’s called a “special marriage certificate” which is a legitimate marriage. Supreme Court can issue these either. There will be some assessment to verify that there’s no force or compulsion from either party - so expect to be able to account for that, and note that your marriage will have to be posted on some newspaper or the other. But that’s it. Parents of either party don’t have a say nor need to know.\nAs far as religious weddings go, I cannot say what the rules are for what religion. But a kazi office implies a Muslim wedding. Maybe just consider not having a religious one? Secular weddings are secular - they’re not exclusively for atheists. It just features no religious add-ons or bylaws. Can still be religious and have one - but don’t expect religious family law to apply to it.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Bhalobasha diye pet bhorbe na bhai.",
      "votes": "8",
      "replies": [
        {
          "text": "Facts",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Tell us what happens in 3 years, if you’re even together.\n!remind me 3 years",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Wait the three years then ask this question.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "5 years later: Hello darkness my old friend.......",
      "votes": "3",
      "replies": []
    },
    {
      "text": "it's just our family isn't from same nationality..\nI'm confused. Is one of you a foreigner? That might create other issues you haven't thought about yet.",
      "votes": "2",
      "replies": [
        {
          "text": "No no it's just that she's bengali I'm well they call it bihari.. it's just uh like ethnicity",
          "votes": "4",
          "replies": [
            {
              "text": "Gotcha. That will still create some issues as u know sadly how some bengalis tend to feel towards biharis.\nYour best bet is to do a civil court marriage. You would need a witness like a friend or cousin, but the courts don't need parents involved if both partners are of legal age.",
              "votes": "4",
              "replies": []
            },
            {
              "text": "She's both Bengali and Bihari? Both Bengali & Bihari are ethnicities, not nationalities.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "U guys should go for court marriage. May be i can help if u r from Chittagong.",
      "votes": "0",
      "replies": []
    }
  ],
  "id": 203
}