{
  "url": "https://www.reddit.com/r/bangladesh/comments/zaopg1/court_marriage_without_our_parent_consent/",
  "hash": "572c4450e742428bfad6d0b5a8c795aa",
  "scraped_at": "2025-12-10T02:59:21.108807",
  "title": "Court marriage without our parent consent",
  "description": "our family knows about us. And they pretty much agree (not entirely but kinda) about our nikah. but after my graduation. I m just in 1st year. We are thinking about doing a court marriage but we don't want our family to know about this (yet). witnesses will be our friends. so my que is.... when our real marriage does happen will they find out that we already married a couple of years ago? I mean the will marriage certificate has some connection with our NID or something or is it just pretty much n offline thing? thanks in advance. and we have our reasons for doing nikah rather than staying in a so-called relationship. we are Muslims btw",
  "votes": "3",
  "comments": [
    {
      "text": "You sure you guys wanna marry?",
      "votes": "6",
      "replies": []
    },
    {
      "text": "There's no such thing as court marriage, don't fall for those scams, you need to visit a Kazi with 3 male witnesses.\nDon't worry Kazi won't stop you, you gotta pay them something like 3k and you will be fine.\nMake sure you go and talk to a Kazi first to understand the requirements.\nAlso, make sure you two have really strong commitments towards each other, don't hastily get married, sit together and talk about your family life and future in depth, see if you can share a dream. And yeah, make sure your income is good before you get married, money is usually the biggest problem, not love.",
      "votes": "5",
      "replies": [
        {
          "text": "we are not running away or anything...we are just marrying secretly...pretty much no one will know...we will continue our studies in the meantime. My que was when our real nikkah does happen will they find out somehow that we married a couple of years ago?",
          "votes": "4",
          "replies": [
            {
              "text": "Eloping but make sure your close friends know else you have no witnesses\nNo there is no digital system, the kazi will hand you a certificate 3 months after you register, thats all I know.\nAnd no, there's no way your parents can know you got married from the kazi.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "You just need to go to a Kazi office with reacquired documents(NID /Birth Certificate) and witnesses. Kazi will get you married and there is no way for your parents to know about it unless someone snitches on you.\nMarriage is a big decision. Don't take it lightly. You and your partner should think it through",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Good luck with the divorce in 6 months.",
      "votes": "2",
      "replies": [
        {
          "text": "we know else other since we were kids",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 204
}