{
  "url": "https://www.reddit.com/r/bangladesh/comments/z7ol3h/what_can_i_do_if_a_random_person_insults_me_over/",
  "hash": "b98b07cdb69dbfb1b5d4ae35461d891b",
  "scraped_at": "2025-12-10T02:59:37.405719",
  "title": "what can I do if a random person insults me over the phone?",
  "description": "A random guy called me and said very bad insults and ended the call before I could insult him back. Is there anyway to get cops to trace the call and get him in legal trouble?",
  "votes": "0",
  "comments": [
    {
      "text": "You should sue him. Phone companies will legally assist the police to track him down. I'm pretty sure you forgot to record his calls and that's good because recording without consent can be used against you. Now when you go to the police tell him when he called you. You probably have the time stamps in your phone call list. The number of the caller. Your phones IMI code from phone box. And write down the obscene inappropriate harrassing conversation he had with you. Police finds the individual and after interrogation they will likely take action.\nPlease be aware, according to section 70 of the 2001 Act, a person commits an offence if he, without a reasonable excuse, repeatedly makes telephone calls to another person in such a manner that the calls cause annoyance or inconvenience to that other person.\nBy harrassing you he did an offence to your mental health and ruined your day. The police will track him down for sure and you will know if he's your classmate, friend,family or just a stranger and as for his offence, he will be fined 25000TK or be imprisoned for 3 months. If he gets bailed out out of bribery or lack of information, he will still be taken to police custody for once and will learn a lesson to not do such an act again.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Sue his Fkin ass.",
      "votes": "1",
      "replies": [
        {
          "text": "How could he recognize his Fkin ass",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "maybe he called a wrong number....don't be a snowflake..or u could end up throwing a family member in jail for a prank call.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Did he know you? Like was he targeting you specifically or was it like he just called up random numbers to insult them for no reason?",
      "votes": "1",
      "replies": [
        {
          "text": "I am not sure. It could be someone who was targeting me for some reason but I am not able guess who it was, I couldn't recognize the voice at all. I tried truecaller and it doesn't show anything. Or it could be just a random dickhead pranking ppl who knows.\nI want to know if there is any way to take legal action against this? Like can the police trace the call or something?",
          "votes": "0",
          "replies": [
            {
              "text": "Mind my french but police have bigger fish to fry than finding a random prank caller.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 205
}