{
  "url": "https://www.reddit.com/r/bangladesh/comments/z595bv/i_want_to_bring_my_khala_to_london_to_visit_my_mum/",
  "hash": "8ce76aafe11697d3596b6877d0b8ecdb",
  "scraped_at": "2025-12-10T02:59:53.415764",
  "title": "I want to bring my khala to london to visit my mum",
  "description": "My mum and khala are the only siblings apart from cousins etc. My mum is too poorly to fly. Does anyone know the procedure to bring someone over from desh to london on a tourist visa?",
  "votes": "5",
  "comments": [
    {
      "text": "https://www.gov.uk/standard-visitor/apply-standard-visitor-visa\nhttps://visa.vfsglobal.com/bgd/en/gbr/\nYou need to first submit the application for a 'Standard Visitor' visa through gov.uk, then book an appointment at VFS Global to complete the application process (the British HC in Bangladesh does NOT process visa applications, so it has to be done through their contractors like VFS). See the links above for step-by-step instructions and other relevant info.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Uk embassy has all the procedures",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Your mum or you need to sponsor your khala (for accommodation and if your khala is not financially well off then for travel cost as well). Your mum or you will write an invitation letter mentioning khala's prospective arrival-departure date, purpose of visit etc.\nThe UK sponsor needs to show home ownership documents or rent documents, bills such as gas or electricity, bank statements, salary statements, payslips, tax documents.\nYour khala's passport, travel history\nHer bank statement\nJob documents and salary statements\nSavings certificates\nAssets\nProof of family ties in bd (children nid, marriage documents etc.)\nOther documents showing she has strong incentives to return bd\n*this is just a generalised list. Requirements are not strict .\n*after collecting all the documents you should apply uk visitor visa for your khala online. After completing the application you will be directed to vfs site where you will choose biometric date. On this date you will give biometric, fees around 200 pounds which includes vfs and visa application fee, submit above mentioned documents.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 206
}