{
  "url": "https://www.reddit.com/r/bangladesh/comments/z3un41/advice_on_how_to_forgive_a_loan_to_a_deceased/",
  "hash": "252f8d09a1091cc5e5bfd32b3dff714e",
  "scraped_at": "2025-12-10T03:00:09.970898",
  "title": "Advice on how to forgive a loan to a deceased family member?",
  "description": "My [50M] cousin [60M] recently passed away due to a heart attack. He was a good man, and we were very close, but during his last few days was very strapped for cash. He had taken a large loan from me (BDT 1.2 crore, approx $117,000) 2 years ago on an interest free basis. There is a written agreement of the loan, i.e. it wasn't just lent orally. The loan was also reported on his and my income tax statements, so i's \"official\"\nHe's survived by his wife and 2 sons. While I belive his estate will be sufficient to cover my loan (the house the family lived in should be sufficient, and he had some other assets like a car, as well as some liquid cash), I do not want to leave them without any cash, or a place to live. His sons are of age 27/31, and his spouse has no source of income.\nTherefore i'm looking to see if there's a way to forgive a portion of the loan, and extend the repayment of the rest, such that they don't have to sell off their house, and can slowly pay me back.\nIs there a way to do this cleanly and legally? The last thing i want is to cause further grief to his family.",
  "votes": "26",
  "comments": [
    {
      "text": "The best thing to do will be to contact a lawyer right now, since you had the terms and conditions written.\nI think you can forgive the entirety of the loan citing the death of the person and hardship of his family.",
      "votes": "11",
      "replies": []
    },
    {
      "text": "Hi, I’m a lawyer and I can help. Feel free to dm or visit my chamber. Let me know if you want to drop by then I’ll give you the address.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "A lot of money; take it now by consulting a lawyer. Extending means you are getting a lower amount of money due to inflation.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 207
}