{
  "url": "https://www.reddit.com/r/bangladesh/comments/1odjao5/im_in_ctg_now_and_i_cant_get_over_what_ive_seen/",
  "hash": "52269a0a2704a61c78ac6198d21e9989",
  "scraped_at": "2025-12-10T02:08:14.364946",
  "title": "I'm in CTG now, and I can't get over what I've seen today.",
  "description": "My family and I came to CTG for a week. We mostly stayed in Kulshi R /A until today. We went to the Bahaddarhat area to meet someone. We were in Finley South City. When we were coming out of the mall, I went to a small tong/grocery store looking for a specific thing. There were exactly 5 people in that shop: one murubbi, one 35-40 yo aged man, 2 kids aged 10-12, and the shopkeeper. Those two kids were paying for something, and I was waiting behind. That boomer and the middle-aged man were smoking. Outta nowhere, that man stands up and grabs that 12 yo by her neck and kisses her? What the actual fuck was that? That kid looked disgusted. She just wipes it. And my brain started glitching when I saw both of these men start laughing??? Only that shopkeeper looked disgusted. And me? I was standing there because my brain wasn't braining. Those kids left instantly. I paid. I left. No words were spoken. Now I'm in my room trying to make sense of that situation. Am I missing something? Am I trippin??? Can someone explain that?",
  "votes": "57",
  "comments": [
    {
      "text": "U should slapped that mfs",
      "votes": "33",
      "replies": []
    },
    {
      "text": "The filthy devil should be shamed, the shopkeeper might know who they were. Was the grocers near Khwaja market? That part of town has many undesirables lurking around and renowned for this sort of fiendery and sex pesterey of young teens.",
      "votes": "20",
      "replies": [
        {
          "text": "idk about the exact locations, cz im not from here. its near the mall tho",
          "votes": "2",
          "replies": [
            {
              "text": "It's just across Arkan road next to the hotel diamond like 1 minute from the mall.",
              "votes": "4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Please note: this didn't happen today. It happened 4 days ago. i posted about the situation in a different sub, which, according to one of our respectable mods from this sub'' has lax moderation, and has zero Bangladeshi moderators, so the moderation of Bengali content is non-existent '' . So now I'm posting it here.",
      "votes": "18",
      "replies": []
    },
    {
      "text": "What the ***. Did no one saw? No one took action? I live closeby Where you discribed",
      "votes": "5",
      "replies": [
        {
          "text": "Some people did. Actions? Not even a word.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "No Tohidi protest for this kid's sexual harassment?",
      "votes": "8",
      "replies": [
        {
          "text": "what?",
          "votes": "2",
          "replies": []
        },
        {
          "text": "Not done by a hindu 🥀",
          "votes": "1",
          "replies": []
        },
        {
          "text": "The perpetrator could be towhidi. Sodomites hujur who couldn't resist a young boy.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "jamaat ameer is now in CTG?",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Pedophilia exists in Bangladesh; it should get more attention.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Wtf are you saying 🥲🥲",
      "votes": "0",
      "replies": []
    },
    {
      "text": "See this for support after witnessing rape or sexual assault: https://rapecrisis.org.uk/get-help/support-after-witnessing-rape-or-sexual-assault/?utm_source=chatgpt.com",
      "votes": "-1",
      "replies": []
    }
  ],
  "id": 21
}