{
  "url": "https://www.reddit.com/r/bangladesh/comments/yrrul2/laws_related_to_patriarchy_and_womens/",
  "hash": "06795157abd940aeee54dcff1caa45f4",
  "scraped_at": "2025-12-10T03:01:13.663201",
  "title": "Laws related to patriarchy and women's subordination",
  "description": "Hello everyone. I am writing a research paper over the emergence of patriarchy in Bangladesh and the domestic laws which actually encourages women's subordination. I would like to request you to provide me with laws, articles and sections which are related to the growth of our patriarchal state and is also a major reason behid women's suborditnation. Thank you.",
  "votes": "0",
  "comments": [
    {
      "text": "Writing a research paper from a perspective of already held belief, writing from conclusion and searching evidence that supports your views... That's called propaganda, conformation bias.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "…emergence of patriarchy in Bangladesh and the domestic laws which actually encourages women’s subordination.\nSure about that buddy? If your ex claims that you promised to marry her and had s€x (“বিয়ের প্রলোভন দেখিয়ে ধর্ষণ”)- that allegation alone can fukc up your whole life. Police won’t even check if the accusation was true (!) or everything was fully consensual. Just an example.\nPresent BD laws are practically uber female friendly (unfortunately people aren’t… yet).",
      "votes": "4",
      "replies": [
        {
          "text": "Thats because of the emphasise on womans purity and the reputation of her family lies on the \"purity\" of their adult children. What makes you think this law is supposed to be female friendly? Lol",
          "votes": "2",
          "replies": [
            {
              "text": "Thats because of the emphasise on womans purity and the reputation of her family lies on the “purity” of their adult children.\nMaybe 20 years ago, not now. Questioning about that purity/character etc is illegal now, you know that right?",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "wow",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Case 1: Technically speaking, a wife scratches herself, she can then go to the police station and report it as \"domestic violence\" and the husband will be arrested for 3-6 months without a hearing or bail.\nCase 2: A married women can divorce her husband without her returning \"mahr\" or \"moharana\" or dowry. This has led to some women entering series of marriages and basically scaming men. I have seen or known \"probashi\" returning back to bangladesh after years, only to find that their wives had divorced them and took all of their money.\nNot saying, all women do this. Not denying that the vast majority of women are victims of domestic violence.\nBut broadly speaking, the matter isn't so black and write.\nLaws favour Bangladeshi women and girl, and some do take advantage of it.",
      "votes": "3",
      "replies": [
        {
          "text": "Case 3: there are way more instances of girl childs being married with grown men\nCase 4: police routinely write off murders, especially of spouses as \"suicides\", hence why the amount of \"suicides\" of women outnumber men in BD when everywhere else, men outnumber it by a long margin\nCase 5: women with bruises and acid burns dont even get to report their attacker, what makes you think Case 1 happens outside of Dhanmondi or Gulshan?\nIt isnt black and white, but usually a man is a victim if his family is poorer than the wife's (as he will be dependent on the wifes family), OR he had consensual premarital sex with a girl but then their parents find out, and then the parents try to claim that the man promised her marriage to save the girls family reputation and maybe an income too",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Its mostly police and government doing very little efforts, modern BD law is based on a lot of archaic British laws, plus some additional new ones regarding road, education, divorce, religion and marriage",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 211
}