{
  "url": "https://www.reddit.com/r/bangladesh/comments/yl2k37/is_online_betting_legal_in_bangladesh/",
  "hash": "b4efeea909ac60e8e30848e1c1643f56",
  "scraped_at": "2025-12-10T03:01:31.871762",
  "title": "Is online betting legal in Bangladesh?",
  "description": "Looking to bet in foreign sport betting sites. On one specific site's rules, Bangladesh isn't on their list of restricted countries and they do say they only restrict countries where the jurisdiction prohibits their website and its services. Still wanted to make sure.",
  "votes": "10",
  "comments": [
    {
      "text": "Betting is illegal and its a no brainer.\nDoesn't justify how much/where you bet.\nThat being said people still bet here and in daylight they will preach you religion.",
      "votes": "21",
      "replies": [
        {
          "text": "Why is betting being illegal a no-brainer? We have long betting history at least since british rule. People used to bet on horse races hence Sohrawardy Uddyan was called Racecourse Maidan. Also I tried searching but could not find any laws restricting betting in BD. Since you seem to know about this, it would be great if you cam share why betting is illegal.\nEdit: It turns out that except for horse racing, all forms of gambling including online betting is illegal in Bangladesh by the Public Gambling Act 1867 Here is a Daily Star article on this matter.",
          "votes": "4",
          "replies": [
            {
              "text": "least since british rule\nHistory of Bengal did not start from British. Bengal used to be most resourceful land in India. This is called white washing history where people like you think if British done it so it is good thing. What happened during British period should not be taken as legal precedent.\nBritish occupied Bengal, divert resources and move food to UK, where people of Bengal died from starvation. Bengal Famine is a known event in the history. British keep bragging about saving Jews but not that killed millions back in India.\nGambling is a sketchy subject and online gambling also illegal in many states of US as well.",
              "votes": "5",
              "replies": []
            }
          ]
        },
        {
          "text": "how do they bet though? if online betting is illegal?",
          "votes": "4",
          "replies": [
            {
              "text": "ঘুষ খাওয়া বেআইনি. মানুষ কিভাবে খায়?",
              "votes": "18",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "All sorts of betting is illegal. That being said you can probably get away with it if your bank is bideshi",
      "votes": "3",
      "replies": []
    },
    {
      "text": "VPN",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Is watching Doraemon legal in North Korea? No, absolutely not.",
      "votes": "-1",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Nothing is illegal in BD, if not anything. You can do anything and stay untouched by the law.",
      "votes": "1",
      "replies": [
        {
          "text": "I love the Bengal Tigers team. Recently I saw that Parimatch became their official sponsor. What can you say about this site?",
          "votes": "1",
          "replies": [
            {
              "text": "My friend has been betting on parimatch for several months already. They have good bonuses for the first deposit and a nice loyalty system for existing players.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I guess you could buy state-sanctioned lotteries you will never win! A prize bond?",
      "votes": "1",
      "replies": [
        {
          "text": "I think he said sports site, not just any betting.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Betting is illegal in our country, you need to choose the safest betting sites, such as Parimatch, and use the agent service that Parimatch can also provide.",
      "votes": "1",
      "replies": [
        {
          "text": "parimatch shill",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 212
}