{
  "url": "https://www.reddit.com/r/bangladesh/comments/y7uv61/bangladeshi_people_living_in_usa_why_does_no_one/",
  "hash": "137859d376af4b3af600a8611fc64990",
  "scraped_at": "2025-12-10T03:02:04.856493",
  "title": "Bangladeshi people living in USA, why does no one calls child protection service or Police to investigate the father of Suborno Isaac Bari. This kid is literally being abused by his father",
  "description": "Suborno Isaac Bari father exaggerate about his math talents. All his claims are somewhat fake, and we can all understand that. But the father is literally using his kid, it's tantamount to child abuse. This kid will be bullied in the future because the cringe videos will be always on internet.",
  "votes": "49",
  "comments": [
    {
      "text": "Not from the US, in canada. The details matter, it's quite possible children's aid cannot intervene at all as it may not fall under abuse.\nAre their clear indications of abuse in those videos?",
      "votes": "20",
      "replies": [
        {
          "text": "Have you seen the videos? The kid is singing and dancing like e monkey. No sane kid would do that unless they are influenced by their parents.",
          "votes": "-4",
          "replies": [
            {
              "text": "Look if the kid looks like he's willingly going along with this then social service won't intervene. Posting videos of your kid dancing isn't considered abuse. If that was a criteria for abuse, social services would be overwhelmed.\nNow if the kid was seen in a video being forced into doing this or being threatened, then I think there would be grounds for an investigation.\nUnfortunately the kid will have to speak up about this, then something can change for them. Until then, he's going to suffer.",
              "votes": "22",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "From US. even though what he is doing is cringe and abusive. It isn’t overly illegal and CPS can’t exactly do much.",
      "votes": "18",
      "replies": []
    },
    {
      "text": "I think the kid is enjoying this $hit as well,\nthe chip has already been corrupted can't reprogram anymore.",
      "votes": "17",
      "replies": [
        {
          "text": "wanna see the length of my padma bridge?",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Lol I’ve never seen a video of this person.",
      "votes": "9",
      "replies": [
        {
          "text": "Same and Also wondering who this is",
          "votes": "7",
          "replies": []
        }
      ]
    },
    {
      "text": "There is no evidence of any kind of ongoing abuse.\nCringe videos\nYeah well, that's subjective. Maybe he doesn't find it cringe.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Lol you think CPS in North America actually gets work done\nEk din go to the AITA/relationship advice/raisedbynarcissists/asianparents subs and see how useless their CPS is. Check out JasonInHell’s story where CPS did jackshit to get his kids away from his psycho wife and they were stabbed to death by her (made actual headlines). He can’t even visits their graves or be on social media because the maternal family harassed him.\nCPS is very overworked, understaffed and underpaid. Just saw another story where a guy was raped and tried to tell a caseworker handling child support stuff from that rape kid, and the caseworker laughed at him. A mom lost custody to her psycho husband.\nCPS baal kore oikhane. My khala’s daughter cried as a baby in Canada and CPS got called on her constantly. She never abuses her kids. Er pashe ekjon alcoholic thakto je sharakkhon marto tar bacchader and absolutely crickets from CPS and police.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Their behavior is super cringe but it’s nothing compared to your average Bengali parents who’s child rearing methods consists of emotional manipulation and physical violence. The CPS isn’t there to take away people’s kids for being cringe.",
      "votes": "13",
      "replies": []
    },
    {
      "text": "Not gonna talk about how real or fake that prodigy is. Let’s talk about the senior Bara. He is just the male version of classic American pageant mom, clearly has the same psychological issues.\nI feel pity for that kid. Now he’s happily dancing and singing just as his father wanted. Once puberty hits- all his intellectual awesomeness will shutter in few days. He has the maximum possibility of self harming, just because of his a-hole dad and fucking dumb idiot “fanbase”",
      "votes": "11",
      "replies": [
        {
          "text": "ওর বাপটা এক্খান কামলা। বলে যে ১১ বছর নাকি দারোয়ানগিরি করছে, ওর ওই পেশাতেই থাকা দরকার ছিল। 😂",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "what will be the basis of claim ? is there any proof ?",
      "votes": "5",
      "replies": []
    },
    {
      "text": "How dare u speak against The God of Math???? And against his Holy Family????You have hurt my religious sentiments. Im sending a mob to lynch u at ur home.\nIm being sarcastic. Just in case some quintessential redditor see this comment",
      "votes": "8",
      "replies": []
    },
    {
      "text": "That's not how abuse works.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "In no way this is fair for that kid- I mean, no one has any respect or love for this little human. And he could never ask for this attention. The dad seems super irresponsible and I am rn living in Bangladesh but i felt this post bro",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Bruv this is America. Parents cashing in on their kids is practically our national pastime.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "I just hope the US embassy will scrutinize Bengali applicants more, we don’t need kamlachodas to ruin Bangladesh’s reputation in the west like they did in Middle East 20 years ago",
      "votes": "3",
      "replies": [
        {
          "text": "What happened in the ME 20 years ago",
          "votes": "0",
          "replies": [
            {
              "text": "There was a lot of Bengalis in the gulf. They used to commit crimes involved in drugs, prostitution or murder and they tried to hold protests in Kuwait so middle eastern countries collectively got rid of most and replaced them with Indians. As a child identifying as a Bengali was unbearable because people would disrespect, bully me for what Bengalis were doing. Now the situation changed. Less Bangladeshis but they work as doctors, nurses bankers and in the army so overall we’re respected well",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "-7",
      "replies": [
        {
          "text": "If you follow his videos, I wonder what this kid will go through in the future",
          "votes": "1",
          "replies": [
            {
              "text": "",
              "votes": "-9",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "U stole my question bro",
      "votes": "-2",
      "replies": []
    }
  ],
  "id": 214
}