{
  "url": "https://www.reddit.com/r/bangladesh/comments/y22u2c/dual_nationality/",
  "hash": "d2d9e91a6c8079cc4210b8cdc9a5ace7",
  "scraped_at": "2025-12-10T03:02:24.901159",
  "title": "Dual nationality",
  "description": "Hello everyone, first time posting here :)\nI'll get straight to the point, basically I have a second passport from one of the ASEAN countries but I am not aware if I will face any issues if I start using it, since my entire life, I have been using my Bangladeshi passport.\nI do not have a NVR stamp nor do I have any dual citizenship declaration. My main concern is would I be stopped at the airport because I don't have an entry stamp into Bangladesh with that passport since leaving Dhaka would be the first time that I would be using it.\nFurthermore, if I am to get a NVR or dual citizenship declaration/certificate how would I do so?\nThanks in advance!\n(P.S. Websites usually have information regarding American or Canadian nationals, not those residing in Bangladesh with a passport from other places.)",
  "votes": "5",
  "comments": [
    {
      "text": "Well, afaik, you must carry both passports as proof of dual citizenship.\nRegarding NVR, contact the Bangladeshi Embassy you're currently residing. Their website should this information and this is nothing but a seal/stamp in your BD passport, just like arrival/departure seal.",
      "votes": "2",
      "replies": [
        {
          "text": "Thanks for the advice. :)",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Get in touch with your local Bangladeshi embassy. If you're in Bangladesh, contact the Passport office as they deal with NVR stamps inside the country.",
      "votes": "2",
      "replies": [
        {
          "text": "Thanks for the insight :), but for NVRs a police verification needs to be done and that can take anywhere from a month to a year to conduct. :/",
          "votes": "1",
          "replies": [
            {
              "text": "NVRs a police verification needs to be done and that can take anywhere from a month to a year to conduct. :/\nMost embassy pages say NVRs are processed within a few days, so this sounds incorrect",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 215
}