{
  "url": "https://www.reddit.com/r/bangladesh/comments/xw45ks/timeline_to_bringing_sibling_in_the_usa/",
  "hash": "c9af84acf13fd27d017e6023fb95ee80",
  "scraped_at": "2025-12-10T03:02:42.060147",
  "title": "Timeline to Bringing Sibling in the USA",
  "description": "Hi everyone, I am curious to know how long it could take bring sibling in the USA. I know it takes over 15 years from Mexico, China and India. But not sure how long it could take from Bangladesh. Any Bangladeshi brought their siblings in the USA? Or your parents petitioned for your uncle/aunt? How long it took? Thank you.",
  "votes": "16",
  "comments": [
    {
      "text": "https://travel.state.gov/content/travel/en/legal/visa-law0/visa-bulletin/2023/visa-bulletin-for-october-2022.html\nSeems like they're now dealing with petitions filed in 2007 for F4 category, so the current timeline seems to be about ~15 years. Although, I have heard of people getting it in 10-12 years not too long ago.. not sure how.",
      "votes": "6",
      "replies": [
        {
          "text": "Seems like they're now dealing with petitions filed in 2007 for F4 category\nMy mother has heard that now they are dealing with 2008 folks.\nSo it all depends on your luck.",
          "votes": "3",
          "replies": [
            {
              "text": "The bulletin board gives you most accurate information not he says she says",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Legal way it takes about 12-15 years but after trump years the waiting time has gotten longer",
      "votes": "10",
      "replies": []
    },
    {
      "text": "12-15 years.\nThe wait is so long that I have given up waiting for the visa.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Doesnt us wanna reduce chain migration",
      "votes": "4",
      "replies": [
        {
          "text": "Who are “us”?",
          "votes": "3",
          "replies": [
            {
              "text": "I think they meant the US: United States",
              "votes": "6",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "So- the Trump years definitely fucked things up. I’m an American married to a Bangladeshi since 2016 (he’s a US citizen now)- we’ve initiated the process for his sister but our immigration lawyer has basically told us it is going to be a LONG time. It took almost 8 years for my husband to become a citizen because of Covid and Trump anti-immigration. We’ve been told to brace for another 8+ years for family.\nFor context, my husband’s sister was actually married to an American (in an arranged marriage when she was underage)- she was abused heavily, and despite having her child in the US, she has struggled to get citizenship.\nMy husband’s family (his father’s brother) won a lottery green card for his whole family, including his children. They now all have citizenship after 10 years, but despite this, they have not yet been able to help bring another brother over.\nIt is definitely possible- I’m in the middle of the process of doing it, but COVID threw everything super behind. My husband waited 3 extra years before he got his citizenship. Everything is back-logged and honestly, it is not a super inviting environment since Trump came in with all of his anti-immigration, anti-Muslim bans.\nDon’t give up or despair- if you’re in a position to bring a sibling, go ahead and initiate it. If not, I’d consider other options. One of my husband’s cousins got citizenship in Canada a LOT easier. Especially in Quebec- if you have certain skills and are willing to learn French, the immigration process is SO much easier (seriously- learn French).\nGood luck!",
      "votes": "2",
      "replies": [
        {
          "text": "our immigration lawyer has basically told us it is going to be a LONG time.\ndid he give any numbers?numbers as in years?",
          "votes": "1",
          "replies": [
            {
              "text": "10-12, maybe more if Republicans gain power again. I think right now they are seeing unprecedented backlogs because of Covid so no one really knows.\nWe ended up waiting 2 extra years because of Covid and everything just shutting down. My husband also works in the Immigration courts, and even with the asylum cases which are usually high priority or a lot faster, those are backlogged years now.\nIf you are serious about going through this- I would actually reach out to an immigration lawyer in the US and have a conversation with them. You may be able to get a short conversation and some numbers for free if you are seriously considering beginning the process.\nWe got an immigration lawyer, and it wasn’t cheap, but it helped a LOT to streamline the process. Good luck!",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Use to be 11 years. Due to covid things got delayed. Now I think it is 12-14 years.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "It's taking 15 years now but expected to increase to 20 years. Backlog is growing day by day. Check visa bulletin\nEdit: For Mexicans it will likely take more than 30 years.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Look at bulletin board and pick current month category F4 (for brothers sister) .. look for what priority date is being processed",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 216
}