{
  "url": "https://www.reddit.com/r/bangladesh/comments/xnwfve/making_seal_of_foreign_and_education_ministry/",
  "hash": "cb4f23572f18a7819a3090ed56e7c0c5",
  "scraped_at": "2025-12-10T03:03:00.014036",
  "title": "making seal of foreign and education ministry?",
  "description": "one of my friend who lives foreign said to me to make a seal of those and sent him through courier.So I need advice as I feel these things as illegal is it illegal and will I get in trouble for it?",
  "votes": "24",
  "comments": [
    {
      "text": "…is it illegal and will I get in trouble for it?\nYou think??? You are planning to forge the official stamp of a ministry, if that’s not punishable serious offense- I don’t know what would be.",
      "votes": "22",
      "replies": [
        {
          "text": "he is living in foreign and he said that as the counsellor has changed of education ministry from the past time so he need the new ones and said me to make the seal of it and send him through courier.",
          "votes": "0",
          "replies": [
            {
              "text": "What’s your common sense saying? Any change in ministry doesn’t invalidate old original stamp in his old documents - if he had any (because that stamp was with an authentic signature and date). And the excuse your friend gave you - doesn’t validate doing a punishable highly illegal and serious crime.\nI can bet he didn’t collect any authentic document from the ministry before. So he wants to forge now some fake documents, most likely equivalence certificates.",
              "votes": "16",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Get better friends",
      "votes": "13",
      "replies": []
    },
    {
      "text": "Almost certainly as the only purpose is to validate forgeries. You are also asking the seal maker to do something that is illegal. I would avoid this task. Also friends who ask you to do illegal or unethical things are not the best for you.",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Sounds dodgy. Protect yourself. Don't do it.",
      "votes": "11",
      "replies": []
    },
    {
      "text": "Go with your gut feeling and tell your friend to go fuck himself..",
      "votes": "5",
      "replies": []
    },
    {
      "text": "the more i read your post and the comments the more your friend sounds like a future dalal ring leader /s",
      "votes": "5",
      "replies": [
        {
          "text": "Op on his way to Malaysia and do you-know-what to dalal",
          "votes": "1",
          "replies": [
            {
              "text": "2 for 1 sucky sucky great deal 🤝",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Ready For Jail Time 😂",
      "votes": "2",
      "replies": []
    },
    {
      "text": "DB wants to know your location XD 🤣",
      "votes": "2",
      "replies": []
    },
    {
      "text": "He can easily order some from china. Why is he asking you though?",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 217
}