{
  "url": "https://www.reddit.com/r/bangladesh/comments/xm5gvd/laws_about_people_from_bangladesh_voting_while/",
  "hash": "04361303e3b3cbbd5cc8c0cf66112672",
  "scraped_at": "2025-12-10T03:03:33.208208",
  "title": "Laws about people from Bangladesh voting while living abroad?",
  "description": "I live in a neighborhood in America where a lot of people who moved from Bangladesh live.\nAll of a sudden, there are many posters for Sheikh Hasina hung up and even some marches in support of her happening.\nIt made me wonder - what are the laws in Bangladesh regarding voting while you live abroad? (in America we refer to this as \"absentee voting,\" not sure if that term is specific to America or not)",
  "votes": "90711",
  "comments": [
    {
      "text": "Voting process in Bangladesh is the same regardless of whether you live within or outside the country: your vote is tallied for Awami League irrespective of whether or not you turn up to vote.\nThere is no absentee voting. AL/BNP committees are formed by people abroad who want to feel important. They don't matter shit.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Don't you worry my friend. Bangladeshi democracy is so developed that the ruling party has people dedicated to casting votes for citizens. You don't even have to go to the polling booth. The party members care too much about you to make you go through the ordeal of voting, especially with the terrible traffic, heat and pollution of most major cities. In other words, don't worry about your vote, someone else will do it for you.",
      "votes": null,
      "replies": [
        {
          "text": "Woof",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "If you don't vote,your vote will be given for you my the sweet sweet members od awami league",
      "votes": null,
      "replies": [
        {
          "text": "How are they expected to vote? Fly back to Bangladesh?",
          "votes": null,
          "replies": [
            {
              "text": "Vai bangladesh e geleo vite dite parben na, vite er ager raat e vote hoye jai. R eta knno desh er govt k dekhaitese j bd te vite er jonno manush publicity kore which in their logic equates to free fair elections",
              "votes": null,
              "replies": []
            },
            {
              "text": "If you want the vote for BAL then no need to fly back the vote will be casted for BAL but if you want to vote somwone else then yes you'll need to fly back",
              "votes": null,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "As far as I know, there is no way of voting while living abroad. There is no concept of Absentee voting or postal voting in Bangladesh.",
      "votes": "3",
      "replies": [
        {
          "text": "So why all this stuff that appears to be campaigning for her in outerboroughs of New York City?",
          "votes": "3",
          "replies": [
            {
              "text": "These are not political campaigns. Elections are a year away. Its the America wing of BAL doing all of this to impress Sheikh Hasina who is in NYC for UNGA I assume. Even when she goes to London, the UK wing of BAL would do the same. They are doing this to impress Sheikh Hasina.\nWhere exactly are you seeing these posters?Western suburbs of Long island where a lot of Bangladeshis have moved to escape the high cost of Living of NYC?",
              "votes": "3",
              "replies": []
            },
            {
              "text": "Probably someone is pandering for political favors🤔🤔🤔",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "curious too, but i guess this kind of things would never happen in EU haha",
      "votes": null,
      "replies": [
        {
          "text": "Is voting when you are away not a thing in the EU?",
          "votes": null,
          "replies": [
            {
              "text": "sorry, i meant the thing with the posters of the politicians",
              "votes": null,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "u/MarketMan123 I went to grab halal food the other day in a Durham street popular w desi people. Lo and behold, there were posters welcoming the Bangladeshi PM to the states. Like wth! the prime minister is not going to visit your small town nowhere near the UN!\nSo that's the thing with the posters, they're set up to welcome and congratulate the PM for attending the UN sessions, where she brought up the rohingya crisis and border skirmishes by Myanmar armed forces and militias which are already affecting the folks in Bangladesh.\nI'm not a expert on the law, but BD doesn't have any absentee voting, the expatriates remain disenfranchised.",
      "votes": null,
      "replies": [
        {
          "text": "Yeah, the guy in my neighborhood (who was white and born in America) clearly has no idea what he was talking about when he said this was [just] about voting, welcoming her to the UNGA makes a lot more sense.\nThanks for the insight!!",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "No different to Turks who move abroad and support erdocunt’s policies, or russians living here and praising putin (lol wut even).\nSend them back home (or don’t, please keep the aborjona you europeans created)",
      "votes": null,
      "replies": [
        {
          "text": "I think it’s one of the ways these “leaders” try to avoid scrutiny from the West by pressuring or influencing the diaspora, which in turn might intimidate the said country in the West or trying to prevent the West from organising these diaspora against these said “leaders”. Safe to say, it doesn’t work.",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "idiots should go back to bd and live in land of milk & honey that they claim it to be. dont bring ugly politics in usa",
      "votes": null,
      "replies": [
        {
          "text": "USA itself is a place of ugly politics",
          "votes": null,
          "replies": [
            {
              "text": "not as ugly as bd and no need to export such things to usa like deciding votes night before election",
              "votes": null,
              "replies": []
            }
          ]
        },
        {
          "text": "Ugly Bangladeshi politics in the USA?",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "\"there are many posters for Sheikh Hasina hung up \"\nBRUUH NOOOO\nTHEY RUINED USA TOO with political posters",
      "votes": null,
      "replies": [
        {
          "text": "I’m not at all complaining I’m just interested in understanding the people who I live near and what’s going on. It’s the opposite of the tribalism that’s destroying America and most of the planet.\nSince I don’t speak the language I figured I’d ask…",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "don't even bother... your vote is already given you don't need to come in person... just take a day off and chill with your family",
      "votes": null,
      "replies": []
    }
  ],
  "id": 219
}