{
  "url": "https://www.reddit.com/r/bangladesh/comments/1o8t2a7/can_someone_get_this_terrorst_arrested/",
  "hash": "91048741a1a95a3d837d978396bd0fea",
  "scraped_at": "2025-12-10T02:08:48.367389",
  "title": "Can someone get this terror*st arrested?",
  "description": "and then they get mad when someone calls them terror*st",
  "votes": "273",
  "comments": [
    {
      "text": "\"Have a relax see you not for mind!\" হুজুর তো অনেক ishmart! দেখেন কত সুন্দর ইংরাজি বয়ান! আর আপনারা বলেন এরা নাকি মুরূক্ষ?!",
      "votes": "110",
      "replies": [
        {
          "text": "English bolse, nishchoi thik i bolse 🤓",
          "votes": "10",
          "replies": []
        }
      ]
    },
    {
      "text": "No! Because this govt. pets these terrorists!",
      "votes": "50",
      "replies": []
    },
    {
      "text": "ফুলের মত পবিত্র শান্তির ধর্ম থেকে আর কি আশা করেছিলেন",
      "votes": "69",
      "replies": [
        {
          "text": "ফুলের মত পবিত্র শান্তির ধর্ম থেকে আর কি আশা করেছিলেন",
          "votes": "69",
          "replies": [
            {
              "text": "yeah hate a religion just because of single person so mature",
              "votes": "8",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "একে খুঁজে রাস্তায় কেউ পিটায় না কেন",
      "votes": "62",
      "replies": [
        {
          "text": "কারণ, রাস্তাঘাটে এদের মতো লোকেরাই ঘোরে।",
          "votes": "38",
          "replies": []
        }
      ]
    },
    {
      "text": "Who will arrest them? The same government which sponsors them, Admires them, Giving them the courage to talk like this?",
      "votes": "25",
      "replies": []
    },
    {
      "text": "Wrote in a different sub but\nhttps://www.facebook.com/share/p/19SG2xuSfS/\nFor this dude shibir isn't extremist enough.\nAlso This dude's boner for taliban is so much that in other post he wanted Afghanistan to take over Pakistan ( AND India, not realizing India is Taliban's Ally currently). Honestly this is just my opinion I'd let the Taliban fucks and the Anti-liberation Paki supporters fight each other. Let em destroy each other. Even the extremist aren't as united as we fear.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Even if you report, nothing will happen .",
      "votes": "27",
      "replies": []
    },
    {
      "text": "যারা ধর্মকে ব্যবহার করে মানুষ হত্যা করে তারা ধার্মিক না। এদের মতো ইবলিশের জন্য আমাদের দেশে শান্তি নাই।",
      "votes": "17",
      "replies": []
    },
    {
      "text": "আহারে শাপলা চত্তরে জঙ্গি নিধনকে ম্যাসাকার আর জঙ্গিদের নির্মূল করাকে গুম/খুন বলা কিছু কিছু মানুষ এখন এটাতে কেদে উঠবে। তাতে কি, ইনকিলাব সায়দাবাদ 🥰",
      "votes": "70",
      "replies": []
    },
    {
      "text": "Report this to DMP. He will get arrested.",
      "votes": "24",
      "replies": [
        {
          "text": "Dmp already said, terrorism is drama of the previous regime. So you might arrested instead as fascist sympathiser",
          "votes": "21",
          "replies": []
        },
        {
          "text": "then তৌহিদী জনতা will welcome him with ফুলের মালা",
          "votes": "27",
          "replies": []
        }
      ]
    },
    {
      "text": "I’m kind of new to Reddit. If I didn't use Reddit, I would never know there are so many idiots living in our country.",
      "votes": "20",
      "replies": [
        {
          "text": "You should try Facebook. Really makes you want to not exist anymore.",
          "votes": "10",
          "replies": [
            {
              "text": "Facebook is garbage",
              "votes": "13",
              "replies": []
            }
          ]
        },
        {
          "text": "So true bro. Reddit is a place of truth.",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "ফেইক স্ক্রিনশট বানিয়ে তাহলে যে কোনো মানুষকে এরা...",
      "votes": "24",
      "replies": []
    },
    {
      "text": "Rog kata days are back",
      "votes": "21",
      "replies": []
    },
    {
      "text": "Bal lauda tora dekhi to ki kore nibi amader moton atheist ba nastik der sun be hijra toder dhormo mey gula ke niye amra ek ek nastik ra biye korbo biye koire jotokhon ora nastikta na apnaye de etar ami guarantee dilam tora khali egla hi korte thak chutiya gula baal bichi chara manus",
      "votes": "3",
      "replies": []
    },
    {
      "text": "wait for a while…these types of shits will be all over the places. if your idol become a country like pakistan who exports mercenary for proxy war all over the world and lick every arses of west for money…or afghanistan who produces 90% opium to the world and flex their so called version of shariah, then what do you expect from bangu mumins? trust me bangladesh won’t be able to handle the things even like pakistan or afghanistan.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "",
      "votes": "3",
      "replies": []
    },
    {
      "text": "একজন মানুষ আজকে নাস্তিক বলে আগামীকাল আল্লাহকে খুঁজে পাবে না, বা আল্লাহ তার আল হাদি নামের গুনে তার নিজের বান্দাকে নিজেই খুঁজে নেবেন না এমন নিশ্চয়তা কে দিতে পারে? আল্লাহর সৃষ্টজীবকে বিনা বিচারে হত্যার অনুমতি এই সীমালংঘনকারীদের কে দিয়েছে?",
      "votes": "11",
      "replies": []
    },
    {
      "text": "\"আসুন আমরা ঘৃণা ও বিভেদের বদলে একে অপরের প্রতি সম্মান ও সহনশীলতার বার্তা ছড়িয়ে দিই। সহিংসতা বা হয়রানির উস্কানি দেওয়া কোনোভাবেই কাম্য নয়। আমাদের সমাজের ভিত্তি হওয়া উচিত শান্তি ও মানবিকতা।\"",
      "votes": "5",
      "replies": []
    },
    {
      "text": "",
      "votes": "2",
      "replies": []
    },
    {
      "text": "এগুলোকে শাপলা চত্বরের মতো বা তার থেকেও ১০ গুন বেশি পেদানি দিতে হবে৷ মোল্লাগুলো সুযোগ পেয়ে পাগল হয়ে গেছে।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "I feel like hasina was better for these fucking terrorists.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Bojhai jacche ragebait.a Muslim must treat atheists, agnostics, and other non-believers with dignity, honesty, and fairness . This is the teachings of islam.\n“O you who believe! Be steadfast for Allah, witnesses in justice, and do not let the hatred of a people prevent you from being just. Be just; that is nearer to righteousness.” (Qur’an 5:8)\nSo if a Muslim insults abuses cheats or harms a nonbeliever without cause, that Muslim will be held accountable by Allah. So to the people who are blaming islam needs to stop blaming religion and start blaming individuals.",
      "votes": "4",
      "replies": [
        {
          "text": "Moja jinish janen? ei pura post e ektao comment specifically target kore nai Islam ke. manush jon terrorist behaviour er jonogon re pochaitese. But apni oita nijei Islam er opr insult niye nilen. Etto energy nah waste kore judi directly ei terrorist deke galaiten oder eto sahosh thakto nah eto kotha bola.",
          "votes": "2",
          "replies": []
        },
        {
          "text": "যেই ধর্মের নবী একাধিক স্ত্রী ও যৌন দাসী থাকা সত্ত্বেও ৬ বছরের নাবালিকাকে বিয়ে করেছিলেন, যেই ধর্মে যুদ্ধে পরাজিত পক্ষের নারীদের “গণিমতের মাল” হিসেবে সৈনিকদের মধ্যে ভাগ বন্টন করা হয়, সেই ধর্মের কথা বলছেন?",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "What's a \"Shaatim\" ?? 🤨🧐",
      "votes": "2",
      "replies": [
        {
          "text": "anyone who speaks truths about mohammed's life and his deeds",
          "votes": "3",
          "replies": []
        }
      ]
    }
  ],
  "id": 23
}