{
  "url": "https://www.reddit.com/r/bangladesh/comments/wk8qm8/is_there_any_law_regarding_loudspeakers_used_in/",
  "hash": "f5f75aa556eebcad4c7266d98c8bfa00",
  "scraped_at": "2025-12-10T03:06:51.824211",
  "title": "Is there any law regarding loudspeakers used in mosque?",
  "description": "There is a mosque right next to my building. It is somehow surrounded by residential buildings. The sound I measure using my smartphone is around 80db when an Adhan is performed. I could've come to terms with this but whenever any islamic significant date comes, all the religious talks like Milad is performed through the loudspeakers. I want to know if there is any law regarding the sound pollution with loudspeakers. Is there anything that can be done before I buy the most advanced ANC headphone to date?",
  "votes": "32",
  "comments": [
    {
      "text": "Morar age amake apnar laptop ta diye diyen",
      "votes": "77",
      "replies": []
    },
    {
      "text": "I have travelled, born and raised in Middle East eto jore kono mosjid er Mike er awaz Bangladesh er Moto shuni nai. Islam doesn't support using loud high pitch noise loud speakers to be used for AZAN/PRAYERS/WAZ whatever. There are old people, infants, sick people, people from other religion. If u say this things, \"fake\" islamic fanatics will rage upon you. True actual muslims will agree with me/",
      "votes": "27",
      "replies": []
    },
    {
      "text": "Is there anything that can be done before I buy the most advanced ANC headphone to date?\nDude, you better spend a few thousands to get a pair of headphones with ANC because that will be much more cheaper than the price of your life.",
      "votes": "44",
      "replies": []
    },
    {
      "text": "Ha Ha Ha......You got a death wish?",
      "votes": "34",
      "replies": []
    },
    {
      "text": "If i speak , I'm in trouble",
      "votes": "27",
      "replies": [
        {
          "text": "I read that in jose mourinho's voice lol",
          "votes": "23",
          "replies": []
        }
      ]
    },
    {
      "text": "ANC AINT GONNA HELP WITH THIS. it only cancels regular humming noises",
      "votes": "10",
      "replies": []
    },
    {
      "text": "Well I don't think op wants to get obliterated by fanatics.",
      "votes": "20",
      "replies": [
        {
          "text": "Well I don't think op wants to get obliterated by fanatics.",
          "votes": "25",
          "replies": []
        },
        {
          "text": "Complaint korle Bechara k nastik banai dibe.😂",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "True even doing this isnt supported by islam because it becomes annoying so they arent doing any big deed here in fact even saudi decided to address this, anyway its all just for show while our country is literally the dirtiest and corrupt country in the world",
      "votes": "5",
      "replies": []
    },
    {
      "text": "My friend's family tried to complain now they are the nastiks of their para",
      "votes": "5",
      "replies": []
    },
    {
      "text": "moiren na bhai, ar jai koren. soundproof koira lon ghor beshi shoijjo korbr na parle",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Move to non Muslim country.",
      "votes": "15",
      "replies": []
    },
    {
      "text": "ANC isn’t going to be of much help against 80db of sound... So don’t get your hope high.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "are bhai same obostha. uni te vorti hoisi tai DOHS elakay move korsi. people marattok vodro.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Think about changing your home to a distance. There is law about sound pollution but cant be applied everywhere.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Ki r korar, desh ta alga muslim e vorti. Ashe pasher manush er kotha vabei na. Tbh only Azan on speakers seems logical to me.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "I want to know if there is any law regarding the sound pollution with loudspeakers\nLmfao you live in Bangladesh, talk about being self aware.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "XD I'm dead fr",
      "votes": "7",
      "replies": [
        {
          "text": "XD I'm dead fr",
          "votes": "7",
          "replies": []
        }
      ]
    },
    {
      "text": "Move to a non-Muslim country duh",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Yeah buddy as most people are saying if you want to keep your head where it is, you are better off investing a few thousand in soundproofing rather than the law. The law aint gonna help ya, just invest a few thousand into full on soundproofing to save your soul (and your head)",
      "votes": "2",
      "replies": []
    }
  ],
  "id": 231
}