{
  "url": "https://www.reddit.com/r/bangladesh/comments/wc08gx/hero_alom_got_notice_from_high_court_to_stop/",
  "hash": "34d4b06816623f40eb8bbe64f9a42562",
  "scraped_at": "2025-12-10T03:07:43.195791",
  "title": "Hero Alom got notice from high court to stop making satirical songs of Rabindranath Thakur",
  "description": null,
  "votes": "31",
  "comments": [
    {
      "text": "Now I'm not fan or listener of this hero alom but how can the high court demand someone stop singing satirical songs? Government should have no right to tell anyone what they can sing or not! It's not like he is singing song of treason or terrorism. He is just singing shitty remixes with obscure tone which are considered satire.\nThis country is fucked when our law makers are busy with stupid shit like this.",
      "votes": "49",
      "replies": [
        {
          "text": "তালেবানের কাছ থেকে আর কি আশা করা যায়?",
          "votes": "14",
          "replies": [
            {
              "text": "Future of our freedom is very grim. We need to educate our society fast so we don't have idiots like these making our law. And look at the comments of the video, what more can you except from bangladesher khet khamarer lok.\nNext time you tell a joke, you will be behind bars.",
              "votes": "21",
              "replies": []
            }
          ]
        },
        {
          "text": "Could not agree more...",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "There goes our chances of having a Weird Al-om",
      "votes": "15",
      "replies": []
    },
    {
      "text": "Does freedom of speech mean anything or nah?",
      "votes": "11",
      "replies": []
    },
    {
      "text": "Autocracy",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Totally unnecessary no freedom to do almost anything nowadays",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Isn’t he considered as a joke and not meant to be taken seriously at all",
      "votes": "6",
      "replies": [
        {
          "text": "He is a joke but that doesn't mean law makers should threaten him for singing satirical remixes of Rabindranath Tagore and violate his civil rights.\nApparently \"he has fans which are mostly children and young and they may be wrongly influenced by those songs and destroy our jubo shomaj\" (the same shit excuse they use to take away our civil rights and freedoms).\nI also read the article that DB arrested him at 6 o'clock in morning and told him to change his name from hero because he is ugly and doesn't look like handsome heroes from dhaliwood or bollywood.\nHero alom is a clown that's for sure but what the law makers are doing is wrong.",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "cultural fundamentalism",
      "votes": "2",
      "replies": []
    },
    {
      "text": "WHO EVEN LISTENS TO gaybindronath.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "-17",
      "replies": [
        {
          "text": "Not listening rabindranath doesn't makes u cool.",
          "votes": "3",
          "replies": [
            {
              "text": "Ofcourse it doesnt.But my question still stands. Who the fuck listens to robindra shongit ? do you listen to it yourself ? Once in blue moon dont count",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Bullsh*t.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I wonder what's the venn diagram of people who listen to Ravindra song and people who click hero alom video? Is there or should there be any overlap? Never heard his singing but why would the high court get involved in this? What the f***!",
      "votes": "1",
      "replies": []
    },
    {
      "text": "How does actual issues of BD not bat our govts eye, but something like this does?",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 234
}