{
  "url": "https://www.reddit.com/r/bangladesh/comments/vy6tg8/i_was_wondering_whether_it_would_be_legal_to_melt/",
  "hash": "18fbf1a4984756b175c2cef64a1e2a71",
  "scraped_at": "2025-12-10T03:08:36.288317",
  "title": "I was wondering whether it would be legal to melt a Bangladeshi coin and reuse the metal for other purposes (excluding minting other coins, which is illegal)",
  "description": "This is kinda like a showerthought really. A quick google search led me to this page, which is about offences relating to coin and government stamps, but none of the laws say anything about this specific case as far as I can see. Since they don't, would it be considered legal? Does anyone have any knowledge regarding this?\nThis question is regardless of whether it would be redundant to melt a coin and make something. I'm not asking whether doing so would be wise, or even feasible (considering how many coins you'd have to gather to make something of value, or if the alloy itself would be useful for making anything at all), but if it would be legal.",
  "votes": "1",
  "comments": [
    {
      "text": "It wouldn't be legal. Source: your shared link. Read from 248.",
      "votes": "2",
      "replies": [
        {
          "text": "Here's the rub: 248 and 249 refer to altering a coin or any Bangladeshi coin, specifically with the intention of passing it off as a coin of a different description, where the meaning of coin is \"... metal used for the time being as money, and stamped and issued by the authority of some State or Sovereign Power in order to be so used.\" as mentioned in 230.\nWhat I understand by this is that its illegal to alter the appearance of, say, a 2 taka coin and make it look like a 5 taka coin.",
          "votes": "2",
          "replies": [
            {
              "text": "If you are using the metal for other purposes and making it more expensive (let's say, you made a ring out of a 1tk coin and selling it for 100tk) , it should be illegal as well. First, you are willingly altering the a coin, second, making it's value higher.\nAt least that what my understanding is. Perhaps someone with a background of law has another way to interpret.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Why would it be illegal ? its your property do what you like. No ones gonna stop you if you set your cash on fire why would they stop you if you melt your coin .",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 237
}