{
  "url": "https://www.reddit.com/r/bangladesh/comments/v9y945/can_a_foreigner_legally_buy_property_in_bangladesh/",
  "hash": "2821a2ba998e4aa757082d1822cff803",
  "scraped_at": "2025-12-10T03:09:44.729940",
  "title": "Can a foreigner legally buy property in Bangladesh?",
  "description": null,
  "votes": "13",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "No and thank god no. Look at what’s happening to the housing crisis in bidesh due to people buying up properties and turning them into permanent Short Term Rentals.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "but the first link said yes, and at the bottom it said no\nQuora Moment",
      "votes": "11",
      "replies": [
        {
          "text": "but the first link said yes, and at the bottom it said no\nQuora Moment",
          "votes": "11",
          "replies": []
        },
        {
          "text": "A foreigner cannot buy land in Bangladesh. Only way to bypass this is to form a company and that company will buy the land.",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "As far as I know it is not allowed. But it's been a while since I last checked.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "I think you need to be a citizen... but I dont think amyone tried so hard to do...maybe if a foreigner is crazy rich...? idk",
      "votes": "2",
      "replies": []
    },
    {
      "text": "You are in luck. Because I have the answer.\nForeigners cannot buy property in Bangladesh...........\nBUUUUUUUUUUUUUUUUUUUT if you pay bribe you will be able to acquire a national ID and use it to buy property.\nAfter my father passed away I had to do it in order to be able to inherent the properties.\nThe only thing they ask for is NID, which only Bangladesh citizens are supposed to have. But you can make one buy paying ghoosh.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I lost citizenship when I became a US Citizen. Apparently there are ways to buy land as a foreigner, but I've never seen any way to do so without having a national ID card. I had to bribe some government officials to get one.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 241
}