{
  "url": "https://www.reddit.com/r/bangladesh/comments/uzy1mk/to_those_sorts_of_peoples_who_are_familiar_with/",
  "hash": "37a0fabe5c9ebf824049dcbbbbf2153e",
  "scraped_at": "2025-12-10T03:10:51.020765",
  "title": "To those sorts of peoples who are familiar with the word pornography. plz read the *'Pornography Control Act-2012'* law. link will be in comments",
  "description": null,
  "votes": "34",
  "comments": [
    {
      "text": "Gotta remove all the nudes I have of my friends.",
      "votes": "21",
      "replies": []
    },
    {
      "text": "egula supply dewa lage ?",
      "votes": "17",
      "replies": []
    },
    {
      "text": "Porn supply dey? wtf??",
      "votes": "10",
      "replies": []
    },
    {
      "text": "Here you can find the countries where porn is banned . Funny thing is these banned locations consistantly rankes higher in the porn site visit statistics. Maybe only makes the people to go to porn sites even more you know because of the taboo effect as generelly humans have a tendency to go/use the things are banned/frowned upon.",
      "votes": "12",
      "replies": [
        {
          "text": "In my opinion, puritan societies breed sexually frustrated youth who find porn as an avenue of both gathering information and relieving some tension.",
          "votes": "12",
          "replies": [
            {
              "text": "All it does is creating market for VPNs.",
              "votes": "6",
              "replies": []
            }
          ]
        },
        {
          "text": "There’s also Streisand Effect.",
          "votes": "3",
          "replies": [
            {
              "text": "Yes, thank you for this, I was trying really hard to remember this. My point generally was trying to say this.",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "Its not because its a taboo, but rather the countries that ban porn tend to have sexually frustrated population, without sex ed or ability to express sexual desires they find porn to relieve some tension.",
          "votes": "5",
          "replies": [
            {
              "text": "Agreed. This frustration is also one of the reason of Sexual violence and confusion about understanding of the opposite gender.",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "Living in Belarus must suck",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Why does the post title sound like it's been written by an AI that was trained from Facebook posts/comments? XD",
      "votes": "4",
      "replies": [
        {
          "text": "Just wanted to be straight up. No emotions",
          "votes": "2",
          "replies": []
        },
        {
          "text": "Facebook posts/comments\nActually I don't use Facebook since 2015. What kinds comments are you talking about?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Do yall know bout Dauladia, khulna???\none of the world's largest brothels",
      "votes": "3",
      "replies": [
        {
          "text": "Do yall know bout Dauladia, khulna???\none of the world's largest brothels\nWhich must be shut down to protect the innocent and very young girls from selling their bodies and lives",
          "votes": "14",
          "replies": [
            {
              "text": "They are \"forced\" and/or \"manipulated\" into it.\nI would love to see a nationwide protest to close it down. If we can manage to refuge hundreds of thousands of Rohingyas, we can surely reinstate a few thousands of families that are dependent on the brothel in that area.\nI still remember the first time I came across the BBC documentary on the brothel. I was sure they were gonna say \"Doulotdia, India\", imagine my surprise!",
              "votes": "4",
              "replies": []
            }
          ]
        },
        {
          "text": "Yes",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Source about the law'The DailyStar' news",
      "votes": "4",
      "replies": [
        {
          "text": "Give me the source of the image please",
          "votes": "3",
          "replies": [
            {
              "text": "yt",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I'm curious to see their collection anyway...!!!",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I'm glad the government officials are concerned about this matter. hope they succeed",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Porn supply illegal je , naki net.e dhakhaoillegal?\nAsking for a friend.🤔\nBTW, dheshe.e sex education na thakle chele meya.ra porn tow Search korbei.🙄",
      "votes": "1",
      "replies": [
        {
          "text": "sex ed\ndeshi lokjon\ni can agree it'll be beneficial for today's teens\nbut parents---\n💀💀",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Ashole",
      "votes": "0",
      "replies": []
    },
    {
      "text": "When has mass control ever worked. What do they want the youth to do? Watch chetona videos in their free time?\nProduction and distribution of such materials should be monitored but to punish the consumers? It makes no sense. Especially when prostitution is legal is Dhaka’s five star hotels are full of escorts in the lobby",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Please provide a source for the image.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": [
        {
          "text": "Joyjatra news YT video source](https://youtu.be/WEja3W6Cq8w)",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Vice and Virtue battalion.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I dont think it's random porn, probably recorded and shared without consent.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "মনে হয় ভিপিএন চালাইতে জানে না, তাইতো সাপ্লাই দিতে হয়🥴😕",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 245
}