{
  "url": "https://www.reddit.com/r/bangladesh/comments/ulzpeu/can_halfbangladeshi_mother_is_from_bangladesh_get/",
  "hash": "d69ad2b2ee75758d98ae6d64d1728730",
  "scraped_at": "2025-12-10T03:11:58.960069",
  "title": "Can half-Bangladeshi (mother is from Bangladesh) get Bangladeshi citizenship?",
  "description": "Hello All,\nI am an American with a Bengali mom from Mymensingh. I was born in the USA with American citizenship, but my mother is a dual USA-Bangladeshi citizen. When I was young, my mom went to the embassy in Washington DC and got me a \"No Visa Required\" stamp to enter BD. Is it possible for me to naturalize as a Bangladeshi citizen and thus also become dual citizen? My mom has some assets stuck over there and my understanding is that if I cannot become a citizen, then I cannot claim any inheritance. Is there any way for me to become a citizen?",
  "votes": "13",
  "comments": [
    {
      "text": "Yes It's possible!\nMost important thing is ask your mother for her birth certificate. If she don't have one please try to make one. Currently you can't do anything without birth certificate in Bangladesh.",
      "votes": "10",
      "replies": []
    },
    {
      "text": "From legal perspective- it’s possible. Better find a reliable lawyer for guidance.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "I have no idea. If ur moms Bangladeshi u should be able to get it. It’s ur right lol. Also if u don’t mind me asking what’s ur other half? Where’s ur dad from?",
      "votes": "2",
      "replies": [
        {
          "text": "He is American with his ancestry from Germany and eastern Poland/ Western Ukraine. So I am part Desi part Germanic and part Slavic. I am trying to learn Russian and Ukrainian so that then I can know Bangla (Desi language), English (Germanic language) and Russian or Ukrainian (Slavic language). Since my father's ancestors came from Europe many generations ago, they can not any longer speak Polish or Ukrainian.",
          "votes": "2",
          "replies": [
            {
              "text": "Woww that’s such an interesting mix! Actually my moms cousin brothers sons are half Bangladeshi half German. They are my 2nd cousins. Also one time in my city in USA I came across a half Bangladeshi half Puerto Rican. Tbh so far that’s the most unique half Bangladeshi I came across lol. I think this mix is very rare lol.",
              "votes": "1",
              "replies": []
            },
            {
              "text": "He is American with his ancestry from Germany and eastern Poland/ Western Ukraine\nYou may be able to get Polish citizenship by descent as well. Check with a service like POLARON (they have a freee assesment and high success rate). A Polish passport (part of the EU) this will allow you to live/study/work anywhere in the EU.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Is your mother still alive. If so then try to find buyer in NY. If they are willing to pay u in US then ur mother can just sign a power of attorney to the buyer and the buyer will take care of the rest.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "German-bengali here… i had a dual citizenship until the german government says that i cannot have two citizenships\nSo i lost my bengali citizenship but now the rules in germany changed and i can have two citizenship…\nThe problem is that the process is very long and hard….\nSo you must wait and fight for very long time to get a citizenship",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Yep. People with either parents being Bangladeshi can seek Bangladeshi citizenship",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Why would you wanna do that? There’s literally zero advantages.",
      "votes": "1",
      "replies": [
        {
          "text": "Mostly to be able to inherit some property, but if it does not work, then it is no big deal. I am happy with my life here in the USA.",
          "votes": "2",
          "replies": [
            {
              "text": "There are other ways you can inherit. Contact local property lawyer for better advice.",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "Yeah. This person will probably be harassed by gov authority.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "I can help you with this because I've recently done something similar. I'm a Swiss citizen by birth. The embassy asks for your birth certificate (in your case your American birth certificate), you will need copies of your mother's Bangladesh passport (valid, expired, doesn't matter) and you will also need to register yourself in Bangladesh, meaning you need a birth certificate from there. As you are eligible for NVR (like me), you are legally already recognized as someone who is Bangladeshi, you just need to go through the admin steps and get the passport.",
      "votes": "1",
      "replies": [
        {
          "text": "you will also need to register yourself in Bangladesh\nHow is this part done?",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 249
}