{
  "url": "https://www.reddit.com/r/bangladesh/comments/1o6b5jj/%E0%A6%9F%E0%A6%B0%E0%A6%87%E0%A6%AC%E0%A6%AF%E0%A6%A8%E0%A6%B2_%E0%A6%B9%E0%A6%AE%E0%A7%9F%E0%A6%A8_%E0%A6%86%E0%A6%B9%E0%A6%AE%E0%A6%A6%E0%A6%B0_%E0%A6%A6%E0%A7%9F%E0%A6%B2_%E0%A6%89%E0%A6%AA%E0%A6%A8%E0%A6%AF%E0%A6%B8%E0%A6%B0_%E0%A6%89%E0%A6%A6%E0%A6%A7%E0%A6%A4_%E0%A6%A8%E0%A6%AC%E0%A6%AC%E0%A6%A7_%E0%A6%A7%E0%A6%B0%E0%A6%B7%E0%A6%A3%E0%A6%B0_%E0%A6%AA%E0%A6%B0/",
  "hash": "9d6fb56bc83ef2ee1624824428da3fdd",
  "scraped_at": "2025-12-10T02:09:39.887826",
  "title": "ট্রাইব্যুনালে হুমায়ুন আহমেদের ‘দেয়াল’ উপন্যাসের উদ্ধৃতিঃ নববধূ ধর্ষণের পর মোজাম্মেল বলেন— তুচ্ছ বিষয়, বঙ্গবন্ধুকে জড়াতে চাই না",
  "description": null,
  "votes": "7",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "জ্যোৎস্না ও জননীর গল্প বই থেকে কোট করে ৭১ এর রাজাকারদের'ও বিচার করুন তাহলে",
      "votes": "15",
      "replies": [
        {
          "text": "এই যে ফেসিবাদ বেশি হয়ে যাচ্ছে কিন্তু। নতুন ভাঙ্গাদেশে জুডিশিয়াল কিলিং আর হবেনা। ইনকিলাব সায়দাবাদ",
          "votes": "7",
          "replies": []
        }
      ]
    },
    {
      "text": "Tongi's mozammel haque, who went from AL to BNp in late 70s to ershad, and Gazipur's a K M mozammel haque are two different people",
      "votes": "12",
      "replies": [
        {
          "text": "tf? bhai amr toh lagtese yunus iccha koira eshb kangaroo court banaise! ora ki chaitese future e jekono BAL affiliated govt oder ei faizlamir jonno fashi dek naki LOL",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "can any sane person explain how Humayun Ahmed is being quoted in a trial for so-called \"genocide\"? god even shakespeare couldn't write a drama this preposterous!",
      "votes": "8",
      "replies": [
        {
          "text": "",
          "votes": "-12",
          "replies": [
            {
              "text": "ঝুলাইসুদি খাঙ্কিলাব ডেন্ডিখোরদের গায়ে লাগছে কেন!!! হাসিনা পাসা লাল করে গিয়েছে দেখে নাকি!!!",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "A quote from a novel is not a legally substantive evidence though.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "For those who don't know what's being talked about",
      "votes": "-2",
      "replies": [
        {
          "text": "Thanks man, getting contexts nowadays is quite difficult",
          "votes": "2",
          "replies": []
        },
        {
          "text": "Two different people. Even their full name and addreas is not the same. Do you know which party this mozammel haque went to after 75? A clue: founder wore military uniform.",
          "votes": "2",
          "replies": [
            {
              "text": "wrong. the wikipedia page is of the mozammel in picture. where's the source of your two mozammel theory ?",
              "votes": "1",
              "replies": []
            },
            {
              "text": "ভাই আপনি প্লিজ আমাকে আশ্বস্ত করবেন যে বঙ্গবন্ধু এ অপরাধে অভিযুক্ত না?",
              "votes": "0",
              "replies": []
            }
          ]
        },
        {
          "text": "how is an event from 1974 Mozammel was 'implicated' in relevant to the government's excessive use of security forces in 2024? if they really want to prosecute him for that why are they wasting this tribunal's time saying these? it's not as if the chief prosecutor's ex-client (infamous GoAzam) was a saint!",
          "votes": "1",
          "replies": [
            {
              "text": "ইউটিউবে গিয়া ট্রাইবুনালের লাইভ দেখ শাউয়ামি কম কর",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 26
}