{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ozbf0m/gallows_for_hasina_in_crimes_against_humanity_case/",
  "hash": "89f438e6c9ce1f4c74671bf2df6770df",
  "scraped_at": "2025-12-10T02:03:18.043491",
  "title": "Gallows for Hasina in crimes against humanity case",
  "description": null,
  "votes": "71",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "ফৌজদারী কার্যবিধি ৩৮২ ধারা অনুযায়ী, স্ত্রীলোকের মৃ′ত্যু′দ′ণ্ড স্থগিত হতে পারে, যদি সে গর্ভবতী হয়।\nমোদিই ভরসা।",
      "votes": "7",
      "replies": [
        {
          "text": "Lol",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Seems even in Bangladesh people may get justice but not in Israel - if they could only bring Netanyahu to justice. On the other hand, apparently Trump sought forgiveness from the President of Israel for Netanyahu, the guy that said he was doing the right thing. What a crack of joke!",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Mark my words — nothing is going to happen to Hasina. But Yunus? He’s the one who’ll face the heat. He’ll run out of the country right after the election.",
      "votes": "3",
      "replies": [
        {
          "text": "Yeah ok lol",
          "votes": "4",
          "replies": [
            {
              "text": "Sorry to break it to you, I have a strong gut feeling that’s how it is going to go. Thing is its the people of this country, There are still a lot of people out there who still wants Hasina back and I have a strange feeling in some weird way, may god forbid, but in politics nothing truly ends. I just hope the people of this country don’t end up bringing her back. It didn’t take them two minutes to side with Pakistan the same country that once raped countless women in Bangladesh.",
              "votes": "0",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Iranian leftist girls celebrating Khomeini's arrival in 1979. Just like the leftists celebrating this trial like idiot.\nSpoiler alert he then excuted 30,000 of them one of these girl got excuted another one fled to Sweden. This court was filled with jamat nothing to celebrate about.",
      "votes": "2",
      "replies": [
        {
          "text": "I didn’t know holding dictators accountable meant 30,000 people would die. I guess we should never hold our leaders accountable for their crimes.",
          "votes": "7",
          "replies": []
        },
        {
          "text": "Kosto lageh Appa R Jonno? Awww it's ok",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "She's definitely enraged along the lines of \"how dare they?\"",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "-18",
      "replies": [
        {
          "text": "not at all surprised to see a bal কর্মী using ai slop, it just makes sense",
          "votes": "15",
          "replies": [
            {
              "text": "",
              "votes": "-6",
              "replies": []
            }
          ]
        },
        {
          "text": "🤣, ইয়ানুস জামাতি ক্যাংগারুগুলো ভুলে গেছে যে বাংলার মানুষ ওদের প্রতি কতাটা জিগাংসু হতে পারে।",
          "votes": "-3",
          "replies": []
        }
      ]
    }
  ],
  "id": 3
}