{
  "url": "https://www.reddit.com/r/bangladesh/comments/1nyebac/%E0%A6%AA%E0%A6%AC%E0%A6%A4%E0%A6%B0_%E0%A6%95%E0%A6%B0%E0%A6%86%E0%A6%A8_%E0%A6%B6%E0%A6%B0%E0%A6%AB_%E0%A6%85%E0%A6%AC%E0%A6%AE%E0%A6%A8%E0%A6%A8%E0%A6%B0_%E0%A6%85%E0%A6%AD%E0%A6%AF%E0%A6%97_%E0%A6%A8%E0%A6%B0%E0%A6%A5_%E0%A6%B8%E0%A6%89%E0%A6%A5_%E0%A6%AC%E0%A6%B6%E0%A6%AC%E0%A6%AC%E0%A6%A6%E0%A6%AF%E0%A6%B2%E0%A7%9F%E0%A6%B0_%E0%A6%B6%E0%A6%95%E0%A6%B7%E0%A6%B0%E0%A6%A5/",
  "hash": "40b740542f51664f4790c418a12fa0c8",
  "scraped_at": "2025-12-10T02:10:57.512589",
  "title": "পবিত্র কুরআন শরীফ অবমাননার অভিযোগে নর্থ সাউথ বিশ্ববিদ্যালয়ের শিক্ষার্থী গ্রেফতার | NSU Student | Jamuna TV",
  "description": null,
  "votes": "67",
  "comments": [
    {
      "text": "I actually went through his social media a bit. It seemed dude was on something...🍃",
      "votes": "20",
      "replies": []
    },
    {
      "text": "Just when there are no issues in the celebration of Durga Puja, this idiot with main character energy suddenly does this stupid thing !!!!",
      "votes": "48",
      "replies": []
    },
    {
      "text": "Honestly u can be atheist and still respect all the religions",
      "votes": "42",
      "replies": [
        {
          "text": "Respect inherently doesn't refer to \"Not Criticizing\" tho 💀\nBut burning out religious scriptures is extremism.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Hello, I’m a student at NSU, and let me shed some light on what happened.\nThis was the first time I witnessed someone committing a blasphemous act, yet the bystanders didn’t turn violent. They were angry, yes, but they simply told him to leave after taking the Quran from him. He refused to let go of the book, though. Honestly, I’m proud of my classmates and this institution for showing restraint and humanity, instead of resorting to violence or mob behavior.\nAfter the incident began spreading widely on Facebook, some people started demanding the death penalty. A few even said things like, “How can he still breathe the air of this earth after doing such a crime?” That group of people hasn’t stopped yet. The incident happened yesterday around 9 AM, and he was handed over to the police after midnight. Today, the university officially announced his permanent expulsion. Even now, those ignorant people are still shouting in NSU groups, though thankfully, they are few in number.\nSecondly, the whole situation feels suspicious. NSU authorities decided to give him a safe exit after he committed what is, by Bangladeshi law, a punishable offense inside university grounds. What’s more concerning is that this wasn’t his first incident. Previously, he once tried to burn a person alive — he brought petrol, splashed it around, and was about to light it when others intervened and handed him over to the police. No legal action was taken.\nHe also once harassed a girl over her hijab and was suspended for the entire year of 2024. NSU authorities already knew he was unstable and had a criminal history, yet they still let him go home safely that day.\nIt feels like this entire event might have been manipulated by some group, using a person who was already known for taking psychedelic drugs regularly and showing unstable behavior.\nBTW dyk the fun part? Nobody asked the NSU authority about these issues, why they allowed a criminal to roam around in the university grounds. Why?",
      "votes": "18",
      "replies": [
        {
          "text": "NSU authorities decided to give him a safe exit after he committed what is, by Bangladeshi law, a punishable offense inside university grounds.\nBecause this country's idea of a punishable offense means beating a person to death. Gee, I wonder why our university didn't want an even bigger shitshow on campus and instead dealt with this situation by cooperating with proper authorities.",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "I think our country should have \"blasphemy\" laws to a certain degree. I don't mean a death sentence but jailing. Be it 'Qiran porano\" or \"multi bhanga\" egula unchecked gelei ugro lokjon reason peye jay akam kukam korar",
      "votes": "13",
      "replies": []
    },
    {
      "text": "While people sign their name on blasphemous things",
      "votes": "13",
      "replies": [
        {
          "text": "WTF bro, what happend in this country?",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "ধর্মীয় নুনুভুতির ব্যবসায় লিপ্ত হবার আগে কয়েকটা জিনিস বলে রাখি:\n১. ছেলেটা মানসিক ভারসাম্যহীন একজন ব্যাক্তি। তার ফেসবুক পেজে তা পরিস্কার। বাঙ্গুরা কোরআন অবমাননায় রাগান্বিত কিন্তু ছেলেটা যে একজনকে হত্যা করার চেষ্টা করেছিল তা দেখবে না। ধর্মের চোখ থেকে দেখলে যা হয় আর কি।\n২. ছেলেটা নিজে মুসলমান, হ্যাঁ ইয়েস। একসময় হিন্দু ছিল, কিন্তু কোন এক সময় ইসলামে ধর্মান্তরিত হয়। আপনারা যারা কেবল ব্যপারটা সাম্প্রদায়ীক দিক থেকে দেখছেন অনেকেই না বুঝে না জেনে হিন্দুদের মাল্লু ডাকা শুরু করে দিয়েছেন। এমনও না যে আপনাদের তা করার উসিলা লাগে, আপনাদের আনন্দের পাসটাইম এইটা।\n৩. ধর্মগ্রন্থ পুড়িয়ে ফেলা আমি মোটেও সমর্থন করি না, তবে বাংলাদেশ একটা মুসলমান সংখ্যাগরিষ্ঠ দেশ। এদেশে কোন এক বোকাচোদা কোরআন পুড়িয়ে ফেললে ১৫ কোটি মুসলমান হঠাৎ মজলুমে পরিণত হয় না। বাংলাদেশের নিপীড়িত জনগোষ্ঠির কেউ একজন তার উপর হয়ে থাকা নিপীড়নের প্রতিক্রিয়া এমন চরম কিছূ করে ফেললে - সিচুয়েশনটা পশ্চিমা বিশ্বের কিংবা ভারতের ইসলামোফোবিয়ার মতো হয়ে যায় না, যেখানে মুসলমনেরা কাঠামোগত নিপীড়ত। তাছাড়া, উক্তি #১ #২ এর কারনে এখানে তাও প্রোযোজ্য না।\n৪. আপনারা যারা এই ঘটনার প্রতিক্রিয়ায় হিন্দুবিদ্বেষ ছড়াচ্ছেন, এতদিনে মাজার-মন্দির ভেঙে ফেলার বেলায় কই ছিলেন? তখন আপনাদের মৃত্যুদণ্ডের আকাঙ্খা কই ছিল?\n৫. এই উক্তি ওপির জন্যে। নতুন একাউন্টে এই পোস্ট করার ব্যাপার কি? ব্যাপারটা সাস বটে।",
      "votes": "14",
      "replies": []
    },
    {
      "text": "Trying to beat a human to death over some book's pages, humanity is doomed.",
      "votes": "12",
      "replies": [
        {
          "text": null,
          "votes": "4",
          "replies": []
        },
        {
          "text": "This is just a \"book\" for you but this is the holy book of 2 billion Muslims, the \"Qur’an\". No matter what we do, we always treat our religious matters with great care. One thing I don’t understand is that atheists never seem to have problems with any other religion except Islam. They don’t criticize Hinduism or other religions, but they always target Islam. Religion is a sensitive topic for everyone, and any educated, well-mannered person would never hurt such feelings. Those who do are simply inhumane. Loud and clear",
          "votes": "5",
          "replies": [
            {
              "text": "Atheists attack all religion equally, maybe you live in a bubble where you see a specific religion being targeted, that's specially true for a case in Bangladesh where majority is Muslim. For example, In America, the vast majority of atheists would be more hostile toward Christianity.",
              "votes": "20",
              "replies": []
            },
            {
              "text": "Every fu*king atheist have problem with every Effing Religion. Stop this bullshit that Atheist only attacks Islam.\nGrow some effing sense in that empty head of yours!",
              "votes": "6",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Do it. Atheists won't mind.",
      "votes": "8",
      "replies": [
        {
          "text": "Do it. Atheists won't mind.",
          "votes": "21",
          "replies": [
            {
              "text": "That's why they are called atheists.",
              "votes": "4",
              "replies": []
            }
          ]
        },
        {
          "text": "Burn as many books as you want if you bought them with your own money.",
          "votes": "13",
          "replies": []
        },
        {
          "text": "Literally no one cares bro",
          "votes": "7",
          "replies": [
            {
              "text": null,
              "votes": "9",
              "replies": []
            },
            {
              "text": "Really 🤣🤣 Shahabagi and Indian Media be like: 😏",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Blasphemy ah modern witch hunt",
      "votes": "3",
      "replies": []
    },
    {
      "text": "১। কোন আইনে গ্রেফতার করলো তারে? কোন মামলায়? ওয়ারেন্ট ছিল?\nএইসব তো দেশের মানুষ বুঝে না এখনো, মনে করে পুলিশ হইলেই কাউকে তুলে নিয়ে যাওয়া যায়, আবার এরাই আয়নাঘর নিয়ে কান্নাকাটি করে।\n২। ১ এর জবাবে অনেকে বলবে 'এইজন্যই দেশে ব্লাসফেমি আইন করা লাগবে'। এই ধনের আইন হইল শরিয়া আইন চালু করার ফার্স্ট স্টেপ। Feelings should not be protected by law",
      "votes": "1",
      "replies": [
        {
          "text": "Penal Code of 1860 – Section 295A. We already have a blasphemy law.",
          "votes": "29",
          "replies": []
        },
        {
          "text": "BPC 1860,\n295 - Punishes anyone who destroys, damages, or defiles any place of worship or any object held sacred by any class of persons, with the intent to insult their religion. Punishment: up to 2 years imprisonment, or a fine, or both.\n295A - Punishes deliberate and malicious acts intended to outrage religious feelings of any class by insulting their religion or religious beliefs.\nBoth apply to him. The offence was so evident that the police did not require a warrant to arrest him, as stated in The Code of Criminal Procedure, 1898 - Section 54.",
          "votes": "5",
          "replies": []
        },
        {
          "text": "They probably actually took him in to save him from the bloodlusted zombies.",
          "votes": "21",
          "replies": []
        },
        {
          "text": "There's law for this crime in our constitution. Learn about the law first.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "What did he do exactly?",
      "votes": "2",
      "replies": []
    },
    {
      "text": "মজার ব্যাপার হলো শুধুমাত্র কুরআন পোড়ানো হয়, কিন্তু কেউ গীতা, বেদ, ত্রিপিটক, তালমূদ, বাইবেল এবং আরো যা যা আছে পোড়ায় না। ব্যাপারটা বেশ ইন্টারেস্টিং তাই না? অথচ আমরা সমাজ যারা কিছুই পোড়ায় না তাদের দিকেই বারবার শুধু আঙুল তুলি...",
      "votes": "2",
      "replies": [
        {
          "text": "i also wonder why the muslim mental patients vandalise only hindu idols after every few days and still get away with it.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Every muslim is hardwired to believe in Islam since childhood, they learn Islam later. Even without making profound statements about the Prophet or tearing or stepping on the Quran, We all know what happens to a person who says he/she doesn't believe in Islam anymore.. that person will have no friends and family and will be marked to death by other Muslims. Even our law in the country does not allow for the death penalty for blasphemy on islam.. Is it right to let people from other religions convert into Islam and kill someone who leaves Islam??? His father is Muslim, his mother & he was practicing hindu. But recently both of them converted to Islam, what led to their religious change is still unknown. This guy showed psychotic behavior before, one of his ex flatmates said that he was thrown out of their flat because of his repeated drunken misbehavior due to heavy drug usage. He also once tried to burn one person in Ghatpar (adjacent Bazar to NSU) after an argument. After that incident, some seniors beat him and took him to the campus security office and informed his mother and called the police also. He also allegedly misbehaved with a girl wearing hijab in NSU and tried to attack the Imam of NSU mosque when they had an argument regarding some Hadid. His Facebook page is filled with islamic hadids and quotes. He was a student of the 2021\nsession and was suspended for the last 3 semesters. A female coursemate of his shared the guy told her before the Puja vacation that \"he is god, and he created her\". Clearly he was struggling to fit in with other students and struggling with mental health... Are the incidents discussed above are traits of a sane & intellectual atheist??\nOn the morning of the 4th of October, A tracher did not let him enter the classroom, the reason is unknown.. Could be any one, continuous absence, absence from exams or misbehaving.... After this , he was seen ripping Quran pages and stepping on it in the NAC(North Academic building) 2nd floor corridor outside the classroom.. According to him, he was having doubts about his belief and legitimacy of islam, he could not understand the actual meaning of Quaran so he collected an English Quran from the Library.. When reading the English quran, he found it as a lie & brainwashing.. Which ultimately will lead all Muslims on the path of dazzal/shaitan and eventually in hell.. Some students tried to stop him and eventually a crowd started to gather and tried to stop him, he replied repeatedly that it was his Quran and he had the right to do it...Few students started to beat him, the campus security and Proctorial team intervened and took him to the proctor office.. He was later suspended and allegedly thrown out of campus by the security team..Why they didn't call the Police & whether they tried to cover-up the incident is unknown.. He started posting various disjointed posts all day to justify his conduct..Later the touhidi janata surrounded his house in the night & police arrested him after some beating.. He was wearing a free Palestine tshirt when he was arrested.. He did not say Islam is false or any profound statement about the Prophet yesterday.. According to him, he found the Quran false , misleading and filled lies to deceive Muslims... Any sane person would not rip and burn the Quran in the broad daylight in Bangladesh. Every sane person is aware of the consequences.. We have seen such incidents before but they did not dare to do it in broad daylight or in public.. Muslim students and people on the social media asking why they didn't let him escape, basically they are demanding why the hell they let him walk after that incident..\nIt's his foolishness that he did it on campus, a public place.. which destroyed his life..\nI may or may not agree with him but i support his right to do it..",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 31
}