{
  "url": "https://www.reddit.com/r/bangladesh/comments/1nqgxlb/%E0%A6%9A%E0%A6%9A_%E0%A6%86%E0%A6%AE%E0%A6%B0_%E0%A6%A8%E0%A6%AE_%E0%A6%97%E0%A6%A1_%E0%A6%95%E0%A6%A8%E0%A6%A4_%E0%A6%9A%E0%A6%87%E0%A6%9B%E0%A6%A8_%E0%A6%86%E0%A6%87%E0%A6%A8%E0%A6%97%E0%A6%A4_%E0%A6%B8%E0%A6%AE%E0%A6%B8%E0%A6%AF_%E0%A6%B9%E0%A6%AC/",
  "hash": "dd99151b27d71e09e4441287f97873c0",
  "scraped_at": "2025-12-10T02:11:48.900610",
  "title": "চাচা আমার নামে গাড়ি কিনতে চাইছেন — আইনগত সমস্যা হবে?",
  "description": "হ্যালো সবাই, একটা আইনি পরামর্শ চাইছি—\nআমি একটি প্রাইভেট কোম্পানিতে কাজ করি, আমার মাসিক ইনকাম প্রায় ৩০,০০০ BDT। নিজে গাড়ি কেনার পক্ষে সক্ষম নই, আর আমার চাচা একটি নতুন গাড়ি কিনতে চাইছেন। তাঁর ইতোমধ্যে দুইটি গাড়ি আছে। তিনি বলেছেন নতুন গাড়িটি আমার নামে কিনলে আমি (বা তিনি) ট্যাক্স/শুল্ক/কিছু খরচ এড়িয়ে যেতে পারবো — তাদের মতে আমার নামে থাকলে আমাকে ট্যাক্স দিতে হবে না। আমার চাচীরও এভাবে একটি গাড়ি আছে এবং ট্যাক্স দেন না বলেছে।\nআমি এইসব আইনি জটিলতা সম্পর্কে জানি না এবং সত্যি ভাবছি এটা কি বৈধ — না কি কোনো গুরুতর ঝুঁকি আছে? যদি আমি সম্মত হই এবং গাড়ি আমার নামে থাকে, তাহলে কী কী সমস্যা হতে পারে (উদাহরণ: ট্যাক্স/দণ্ড/অপরাধী মামলা/ঋণ/বীমা দাবির অস্বীকার/ক্রেডিট ইত্যাদি)? আর যদি সমস্যা হয়, তাহলে আমি কীভাবে নিজেকে নিরাপদ রাখতে পারি? (উদাহরণ: চুক্তিপত্র, আইনজীবীর পরামর্শ, কাগজপত্র কেমন করা উচিত ইত্যাদি)\nআমার কিছু প্রশ্ন:\nকেউ আইনগতভাবে এ সম্পর্কে জানেন? বাংলাদেশের কী আইন/নিয়ম আছে যেগুলো আমাকে জানতে হবে?\nএরকম অভিজ্ঞতা আছে এমন কেউ থাকলে কী ঘটেছিল তা শেয়ার করবেন?\nআমি কি স্বল্প ও সহজ কোন পদ্ধতি অনুসরণ করতে পারি যাতে উভয় পক্ষ নিরাপদ থাকে? (অর্থাৎ আইনি/আর্থিক ঝুঁকি কমানোর উপায়)\nআগাম ধন্যবাদ — আপনি যদি কোন সরকারি ধারা/বিধি বা ওয়েবসাইট লিংক দিতে পারেন সেটাও খুব সাহায্য হবে।",
  "votes": "9",
  "comments": [
    {
      "text": "উনি বেশ কিছু বাড়তি ট্যাক্স এড়াতে আপনার নামে গাড়ি কিনতে চাচ্ছে। একদমই রাজি হবেন না। আপনার নিজের গাড়ি আপনি নিজের নামে রেজিষ্ট্রেশন করবেন। নিজের নামে গাড়ি রেজিস্ট্রেশন করা মানেই আপনাকে অবশ্যই এডভ্যান্সড ইনকাম ট্যাক্স দিতে হবে ( 25 হাজার টাকা বছরে দেড় হাজার সিসি গাড়ি হলে + রেজিস্ট্রেশন ফি)। এছাড়াও কর অফিসের লোকজন ফাইল অডিট করলে জিজ্ঞেস করতে পারে তিরিশ হাজার টাকা বেতনে কিভাবে গাড়ি কিনলেন। তখন কি বলবেন? ফেঁসে যাবেন। সৎ থাকবেন, লাইফে গ্যাঞ্জাম এড়াতে পারবেন।\nআর ট্যাক্স বাদেও ওই গাড়ি কোন এক্সিডেন্ট বা দুই নম্বরি কাজ করলে পুলিশ আপনাকে ধরবে মালিক হিসেবে।",
      "votes": "13",
      "replies": []
    },
    {
      "text": "Tax is compulsory. Afaik, it falls under advanced income tax. If someone has multiple vehicles registered in their name it will increase the percentage. But it never comes down to zero. Even government vehicles pay this tax, really small, but they do.\nNow the thing is, some people don't pay it. And you will see when trying to sell some car, they say it has certain dues. So someone has to pay it. Without clearing the due, it's impossible to transfer the owner.\nAnd regarding legal troubles, if you do so, you are actually helping someone do tax fraud. Don't do this, our country is already in big trouble because of all these.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "আপনাদের সবাইকে অনেক ধন্যবাদ মূল্যবান পরামর্শ আর সতর্কবার্তার জন্য। আমি চাকরিতে নতুন, ইনকাম ট্যাক্স ও আইনী জটিলতা সম্পর্কে পুরোটা জানতাম না; আপনারা বলায় বুঝতে পেরেছি এতে বড় ঝুঁকি আছে।",
      "votes": "3",
      "replies": []
    },
    {
      "text": "আজকাল ইনকাম ট্যাক্স অফিস বিআরটিএ থেকে চেক করছে যে যার গাড়ি আছে সেই ইনকাম ট্যাক্স দিচ্ছে কিনা।\nভাগ্য ভালো হলে আপনি ধরা পড়বেন না কিন্তু ভাগ্য খারাপ হলে আপনার ঘুষ দিতে হতে পারে।",
      "votes": "2",
      "replies": [
        {
          "text": "yes",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 34
}