{
  "url": "https://www.reddit.com/r/bangladesh/comments/1nphkp7/can_i_ask_a_member_of_police_army_or_rab_to_see/",
  "hash": "16805aa993d6ad9c2968897222aeba99",
  "scraped_at": "2025-12-10T02:12:21.984550",
  "title": "Can I ask a Member of Police, Army or Rab to see his is ID in Bangladesh?",
  "description": "You know that there is a chance to encounter fake police or army person. So to be sure of such personnel's identity is crucial for a citizen. As normal things doesn't go normally here, I thought that I should ask someone for assurance.",
  "votes": "11",
  "comments": [
    {
      "text": "A few years back I had an incident with a plainclothes cop. He asked me to hand over my bag so he could search it, and I asked him to show me his ID first. Things went south pretty quickly after that.\nHe got offended and started questioning and threatening me:\nHow dare you ask me for ID? Where do you study? What do you do? Don’t you know who I am?” and so on.\nI was lucky I was in my hometown and everybody knew me.",
      "votes": "18",
      "replies": [
        {
          "text": "I should add, if I ever end up in that situation again, I’d still ask for their ID.",
          "votes": "19",
          "replies": []
        },
        {
          "text": "Awami League cops were basically uniformed gang members.",
          "votes": "8",
          "replies": [
            {
              "text": "Awami League cops were are basically uniformed gang members.\nFTFY",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "On paper yes but irl no especially in counties like Bangladesh.",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Of course you can. But what you get in return is a different question.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Yes, you can. But you won’t be able to see it and we won’t be able to see you again.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "They can check you under the Special Powers Act iirc.\nBest is to be polite and ask why he's checking under what suspicion.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Yes, you can, and you should. Don't think of consequences; do the right thing. Additionally, they must notify one of your family members within 12 hours and provide justifications for why you have been detained. They have bodycams, and you should also record them using your smartphone, ask for their name, ID, and badge number. You have the right to remain silent and ask for legal assistance.",
      "votes": "3",
      "replies": [
        {
          "text": "That's on Only paper.. I have never seen any Bangladeshi police wearing bodycams...",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "You can, but will probably have a bad time!",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 36
}