{
  "url": "https://www.reddit.com/r/bangladesh/comments/1nm7iai/50000_tk_chada_na_dite_ajke_amar_bhai_hospital_e/",
  "hash": "d5c4bfaf454a64ade7c83d8cfb005c14",
  "scraped_at": "2025-12-10T02:12:39.067612",
  "title": "50,000 tk Chada na dite ajke Amar bhai hospital e. Airokom r koto din?",
  "description": "Amra r koto din ai bhoy niye thakbo, ai bhoyongkor dol and tader member der theke? Will there ever be justice?\nAmar bhai k gotokal raat’e 6-10 BNP er member ra onek mair dhor kore. Tader k amar bhai every month chada dae. Kintu ai month e amader Onek problem hocchilo and taka manager kore na dite pere take mere hospital e pathaise. Onek kharap obosta, sobai please dowa korben.\nMay the Almighty God protect us from this evil party and protect our nation.",
  "votes": "17",
  "comments": [
    {
      "text": "Amra jati hishebe jotodin bhalo na hobo totodin cholbe,judi bhalo na hoi qiyamot porjonto.",
      "votes": "2",
      "replies": [
        {
          "text": "Yes bhai, I understand we all need to change, but what about regular innocent people like us? We never did politics, we don’t have connections or strong political links. Who will save us? My brother may be paralyzed for life now, all because of 50,000tk.\nBNP akhono power e Ashe nai. Ashle amader ki hobe? Amra ki desh e thakte Parbo?",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Regardless whatever party comes to the power. This will continue to happen. That’s the unfortunate part. I hope your brother recovers quickly.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "0",
      "replies": [
        {
          "text": "Yes bro, but even in Dhaka my family are also targeted. They live in Gazipur",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 37
}