{
  "url": "https://www.reddit.com/r/bangladesh/comments/1nj8udq/%E0%A6%B9%E0%A6%A8%E0%A6%A6_%E0%A6%AC%E0%A6%B9%E0%A6%AC%E0%A6%AC%E0%A6%B9/",
  "hash": "9109c91719f174a4aae3a2de69b93497",
  "scraped_at": "2025-12-10T02:12:55.922533",
  "title": "হিন্দু বহুবিবাহ",
  "description": "আমি ২০১২ সালে বরিশালের ভাটিখানা নিবাসী মিঠুন দাসকে হিন্দু মতে বিয়ে করি। আমাদের একটি মেয়ে আছে যে বিয়ের এক বছর পর জন্মায়। এরপর সে কানাডায় ম্যাকগিল ভার্সিটিতে পরাশুনা করতে যায়। আমার বাবা অর্থ সাহায্য করে। কিন্তু সে আমাকে নেয়নি। ফোনে কথা হইতো আর তার মায়ের জ্বালায় আমি আমার বাপের বাসায় থাকতে শুরু করি। পড়াশুনার পর সে কোনো চাকরি না পাওয়ায় অস্ট্রেলিয়ায় মেলবোর্নে লাট্রোব ভার্সিটিতে তার বোনের কাছে যায় ডক্টরেট করতে। সেই সময় আরো কিছু অর্থ নেয়া হয় আমার বাপের থেকে। আমার দেশেই থাকি, সে কয়েকবার আসে আর যায় , আমায় নেওয়ার কথা বললে নানা অজুহাত দেয়। আমি বাপ্ মায়ের একমাত্র মেয়ে বলে বাপের বাসায় থাকতে পারছি। এদিকে সে তার বাপ্ মা কে নিয়ে গেছে, আমাদের নেওয়ার কথা উঠলেই তার অর্থ থাকেনা।\nএখন খবর পাচ্ছি সে আরেক বিয়ে করছে। আমার ফোন সেরকম ধরে না। ধরলে বলে আগের বিয়েতে মায়ের মত নাই। তাই নতুন বিয়ে করবে। তার দিদিরও শুনেছি চার পাচটা বেশ কয়েকটা বিয়ে। এঅবস্থায় কি করা যায় ? তাদের ভাটিখানার বাসা খালি। পুলিশে গেলে পুলিশকে ঘুষ দেয় কি দেয় জানি না। আমার আর মেয়ের কোনো খরচ দেয়না। সেই দেশে গিয়ে মামলা করার মতো সঙ্গতি নাই। বাংলাদেশের বাপ্ মায়েরা বিদেশে ছেলে দেখলেই বিয়ে দিয়ে দেয়। এদিকে দেশে তাদের বৌ পড়ে থাকে। আমি যখন বিয়ে করেছি তখন সে এদেশেই ছিল, ক্যাডারের পরীক্ষায় পাশ না করায় আমার বাবা টাকা দিয়ে বিদেশে পাঠায়। এখন টাকাও গেলো জামাইও গেলো। আমাদের ওই দেশে তেমন পরিচয় নাই। এদেশে নতুন মেয়ের পরিবারের খোঁজও জানিনা। বিয়ে মনে হয় রোখা যাবে না।\nযখন বিয়ে করেছি তখন পরিবার যে এত খারাপ জানতাম না। সতর্ক ভাবে খোঁজ না নিয়ে বিয়ে দেয় বলেই এইসব পরিবার বিয়ে নিয়ে ব্যবসা করতে পারে।",
  "votes": "90711",
  "comments": [
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": null,
      "replies": []
    }
  ],
  "id": 38
}