{
  "url": "https://www.reddit.com/r/bangladesh/comments/1n0y74h/urgent_request_for_guidance_regarding_domestic/",
  "hash": "9dc2a3bb954d4add3df660833e3e1440",
  "scraped_at": "2025-12-10T02:13:42.170496",
  "title": "Urgent Request for Guidance Regarding Domestic Violence in Bangladesh",
  "description": "Throwaway account of privacy but I’m hoping someone here can help.\nI recently learned of a very concerning situation involving my aunt, who lives in Bangladesh.\nHer husband has been violent towards her, physically assaulting her to the point of causing visible injuries and bleeding. He is also involved in gambling and drug-related activities. My aunt finally confided the truth during a phone call with my father, after years of silence. Unfortunately, the rest of the family in Bangladesh has been witnessing the abuse but is too afraid to contact the authorities.\nI am deeply worried for her safety and the wellbeing of her children. From here in the United States, I want to do everything I can to support her, but I do not know the proper steps to take.\nCould you please guide me on what resources or legal protections are available for her in Bangladesh? Are legal aid services she could safely reach out to? If possible, I would also appreciate advice on how I, as a family member abroad, can best support her in this situation.\nThank you very much for the important work you do and for any guidance you can provide.\nI don't know how to write bangla so please forgive the translations.",
  "votes": "2",
  "comments": [
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 41
}