{
  "url": "https://www.reddit.com/r/bangladesh/comments/1mcthut/am_i_still_a_bangladeshi_citizen_after_becoming/",
  "hash": "acac096f704aaeb5365868d93ff956ec",
  "scraped_at": "2025-12-10T02:14:44.462519",
  "title": "Am I still a Bangladeshi citizen after becoming Australian? Consulate isn’t giving clear answers.",
  "description": "Hi all, hoping someone here has been in a similar situation.\nI was born outside Bangladesh but was automatically granted Bangladeshi citizenship by descent. I recently became an Australian citizen and have applied for my Australian passport. I still have a valid Bangladeshi passport (expires in 2027), but I don’t want to have any legal or civic connection to Bangladesh going forward.\nI emailed the Bangladesh Consulate in Sydney asking two simple questions:\nNow that I’m an Australian citizen, am I still considered a Bangladeshi citizen?\nOr do I need to formally renounce it?\nTheir only reply was:\n“Please share your phone number.”\nThen later:\n“We recommend you visit our office.”\nI don’t want to provide my phone number, and I don’t see why I should go in person just to get a basic answer to a legal status question. They haven’t told me what the process is, if there’s a form, a fee, or any paperwork involved. I want everything in writing especially since I don’t feel confident relying on verbal instructions.",
  "votes": "7",
  "comments": [
    {
      "text": "Both Bangladesh and Australia recognize/allow dual citizenships so unless you renounce one you will be citizen of both countries. Note: passports expires citizenship doesn't expire.",
      "votes": "14",
      "replies": [
        {
          "text": "This is correct. Unless you renounce your citizenship, you're still a citizen.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Bangladesh allows dual citizenship. The problem is you have to apply for no visa or something when you want to visit bd.\nThat's what I've seen in Canadian Bangladeshies do.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Yes you are and will remain as a Bangladeshi citizen unless you pay and renounce your citizenship.\nThere's no problem with dual citizenship but there is a very rare chance that if you need assistance from Australian embassy they may push it Bangladesh embassy to handle your situation.",
      "votes": "4",
      "replies": [
        {
          "text": "Thank you. This is what I'm worried about. I've never even lived in Bangladesh and would NOT be able to navigate anything there.\nOf course I don't plan on committing any crimes but I don't want to be ping ponged between Aus and BD in the future for anything.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "short answer- since your passport is still valid, yes, it means you are still a bangladeshi citizen.\nNo you wont face any issues\nyes even after the passport expires you will have to mark as dual citizenship",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Here is the FAQ from NY Consulate\nhttps://www.bdcgny.org/frequently-asked-questions-dnc https://www.bdcgny.org/frequently-asked-questions-dnc",
      "votes": "2",
      "replies": [
        {
          "text": "It says\nDoes a Bangladesh national automatically losses his/her Bangladesh citizenship if he/she becomes naturalized citizen of a foreign country?\nYes, He/She will loss his/her citizenship of Bangladesh",
          "votes": "1",
          "replies": [
            {
              "text": "Ahhh the state of the art... Not even official pages can provide the right answers...",
              "votes": "2",
              "replies": []
            },
            {
              "text": "Thank you for the links. However, this seems to contradict what everyone else is saying.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Technically You are not Bangladeshi citizen. Bangladesh does not automatically recognize/allow dual nationality. To maintain dual nationality you have to apply for dual nationality certificate prior to getting a foreign citizenship. However, any person born in Bangladesh can apply for No Visa Required seal on their foreign passport with fee which allow them to travel freely and without any restrictions to Bangladesh. You will find this information on Google.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "You are and will continue to be a Bangladeshi citizen unless you specifically pay a fee and apply to have your Bangladeshi citizenship revoked. You don't need a valid passport to maintain citizenship.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "The Bangladeshi authorities don’t seem to have a clear idea themselves.\nMy sister was born in the U.S., so she is American by birth and Bangladeshi by descent. As a child, she had both passports. But once we found out about the No Visa Required seal, we stopped renewing her Bangladeshi passport.\nShe hasn’t lived in Bangladesh for 25 years and has only visited 4 or 5 times for short trips. Now, she needs a NID to take care of some property matters in Bangladesh.\nTo apply for a NID, she needs a Bangladeshi Birth Registration Number. She tried to apply for one at the Bangladesh Embassy in Washington but they told her she first had to get a Dual Nationality Certificate from the government of Bangladesh, a process that takes around six months.\nHowever, the embassy’s website says that people who want to regain Bangladeshi citizenship need to apply for a DNC. But my sister never lost her Bangladeshi citizenship, she was Bangladeshi from birth and never gave it up because of naturalization. So technically, she shouldn’t need to “get it back.”\nStill, the embassy staff insisted that she had to get a DNC.\nWe eventually skipped this BS by getting her BRN from Dhaka North City Corporation using my mother’s NID and my sister’s American birth certificate.\nIt’s strange that one Bangladeshi mission tells you that you need to apply to regain citizenship, while another wants you to pay to renounce it.",
      "votes": "1",
      "replies": [
        {
          "text": "Every one is concerned regarding property but there is no legal way one can take any money out of BD when they sell those properties. So, whats the point of maintaining dual nationality?",
          "votes": "1",
          "replies": [
            {
              "text": "Bangladesh Bank does give permission to take funds out for inheritance purposes if the inheritor resides abroad. It’s a complicated process. But before that, to register properties and maintain bank accounts you need a NID.",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "Did your sister obtain her NID with the birth certificate?",
          "votes": "1",
          "replies": [
            {
              "text": "She will apply for her NID when she visits Bangladesh.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Update: Reached out to Bangladesh High Commission in Canberra.\nThrough the terrible grammar I was able to make out that I'm still a Bangladeshi citizen and that I could apply to the Ministry of Home Affairs for a dual citizenship certificate if I wanted to.\nI sent a follow-up email asking if at some point in the future I wished to formally renounce my Bangladeshi citizenship, what would the process involve. They asked me to give them a call...\nAre these people incapable of typing or what? I genuinely don't understand how such pathetic systems/people exist. It's for these reasons I want to completely cut ties and have zero association with them.\nThank you to everyone for the comments.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 45
}