{
  "url": "https://www.reddit.com/r/bangladesh/comments/1mbrfbr/dual_citizenship_question/",
  "hash": "e9b9ed6aa63e437947ce8d3cd5d6bd6f",
  "scraped_at": "2025-12-10T02:15:20.404054",
  "title": "Dual Citizenship question?",
  "description": "I was seeing the dual citizenship requirements for Bangladesh and I saw that children and grand children of Bangladeshi citizens can get citizenship via jus sanguinis. My grandparents on my mother's side migrated from Bangladesh to India in 1969, two years before independence. Would their East Pakistani citizenship beforehand count as 'Bangladeshi' and hence would make me eligible for citizenship? My grandfather's family stayed in Bangladesh but none of them have good enough ID records.",
  "votes": "2",
  "comments": [
    {
      "text": "You will not be eligible. Your grandparents should have Bangladeshi identification and sounds like they left before even Bangladesh got independence.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "This is hard to say. Maybe, you should look for local Bangladeshi lawyer in London. Also, any other alternatives...",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Just curious but does getting a bangladeshi citizenship hold any benefit for you though\nLike sure maybe easier to start a business or get cheaper visa to sone neighbouring countries\nBut whatever jus asking",
      "votes": "2",
      "replies": [
        {
          "text": "It's just nice to have another citizenship. Also if I get a remote job which pays well I can move there and live quite well off. The UK is also going down in pretty much everything good for reasons I can't say so immigrating somewhere else is desirable to me.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "I am a new citizen from a EU country. Lived all my life in BD before that. When visiting BD - do I need an NVR or do I need a dual citizenship certificate? I only care to travel in and out of BD. Don’t plan to use my BD passport, ever. Actually.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "I'm a British citizen, not Indian.",
      "votes": "1",
      "replies": [
        {
          "text": "I'm a British citizen, not Indian.",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 47
}