{
  "url": "https://www.reddit.com/r/bangladesh/comments/1m4ldaq/%E0%A6%9B%E0%A6%A8%E0%A6%A4%E0%A6%87%E0%A7%9F%E0%A6%B0_%E0%A6%9C%E0%A6%A8%E0%A6%AF_%E0%A6%A2%E0%A6%95%E0%A7%9F_%E0%A6%AD%E0%A7%9C%E0%A7%9F_%E0%A6%9A%E0%A6%AA%E0%A6%A4%E0%A6%AE%E0%A6%9F%E0%A6%B0%E0%A6%B8%E0%A6%87%E0%A6%95%E0%A6%B2_%E0%A6%B8%E0%A6%B0%E0%A6%AC%E0%A6%B0%E0%A6%B9_%E0%A6%95%E0%A6%B0%E0%A6%9B_%E0%A6%8F%E0%A6%95%E0%A6%9F_%E0%A6%9A%E0%A6%95%E0%A6%B0/",
  "hash": "e83b87c1721f9b2d412140d165121d9a",
  "scraped_at": "2025-12-10T02:15:53.040998",
  "title": "ছিনতাইয়ের জন্য ঢাকায় ভাড়ায় চাপাতি-মোটরসাইকেল সরবরাহ করছে একটি চক্র",
  "description": "পুলিশ বলছে, এই চক্রের মূলহোতা কবির নামে এক ব্যক্তি। তার কাছ থেকেই চাপাতি ও মোটরসাইকেল ভাড়া নেয় ছিনতাইকারীরা। আর এই ভাড়ার অর্থ শোধ করতে হয় ছিনতাই করা মালামাল বিক্রির পর। অর্থাৎ চাপাতি-মোটরসাইকেল নেওয়ার জন্য অগ্রীম কোনো টাকা দিতে হয় না। ছিনতাই করা মালামাল বিক্রির পর ভাড়া মেটানো হয়। তবে বেশিরভাগ ক্ষেত্রে ছিনতাইয়ের মূল্যবান জিনিপত্র কিনেও নেয় চক্রের মূলহোতা।\nএমনকি কোনো ছিনতাইকারী পুলিশের হাতে ধরা পড়ার পর জামিনে ছাড়িয়ে আনতেও টাকা বিনিয়োগ করে এই চক্রটি। জামিনে বেরিয়ে আবারও ছিনতাই-ডাকাতির পর অপরাধীরা পরিশোধ করে এই টাকা\nবিষয়টি নিয়ে ঢাকা মহানগর পুলিশের (ডিএমপি) গোয়েন্দা শাখার তেজগাঁও বিভাগের উপ-কমিশনার (ডিসি) মোহাম্মদ রাকিব খান বেসরকারি টেলিভিশন চ্যানেল ইন্ডিপেনডেন্টকে বলেন, “তারা চাপাতি, মোটরসাইকেল ভাড়া দেয়। এর বিনিময়ে ছিনতাই করা মালামাল তাদের কাছে বিক্রি করে ছিনতাইকারীরা।”\nডিএমপির গোয়েন্দা শাখার যুগ্ম কমিশনার নাসিরুল ইসলাম ইন্ডিপেনডেন্ট টেলিভিশনকে বলেন, “এসব অপরাধে কারা জড়িত আছে, আশপাশের লোকজনের মাধ্যমে আমরা তা শনাক্ত করার চেষ্টা করি। এর পাশাপাশি ইতোপূর্বে কারা এ ধরনের অপরাধে জড়িত, তাদের আমরা আইনের আওতায় আনি।”",
  "votes": "57",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "This is actually scary! A few ppl cornered my dad with chapati last month in kallyanpur. It was around 10 p.m , the only reason he was unharmed bcz he refused to open the door of the Uber.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "",
      "votes": "5",
      "replies": [
        {
          "text": "oida to banaysilo birodhider…",
          "votes": "4",
          "replies": [
            {
              "text": "oida to banaysilo birodhider…",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "সম্ভব নয়। দেশে জাতিসংঘের মানবাধিকার কমিশন হয়েছে। তারা এটা নিয়ে আপত্তি তুলবে।",
          "votes": "2",
          "replies": [
            {
              "text": "",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "প্রমাণ সহ ধরা পরবে আবার টাকা দিয়ে এমন গুরুতর অপরাধ করে জামিনে বের হয়েও আসবে, কি একটা আইন আর বালের মুসলিম দেশ।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Capitalism, ho!",
      "votes": "2",
      "replies": []
    },
    {
      "text": "আইনের বিষয়গুলো আরো precise করতে হবে।",
      "votes": "2",
      "replies": [
        {
          "text": "আইনের বিষয়গুলো আরো precise করতে হবে।",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "পিস্তলসহ সবই ভাড়ায় পাওয়া যায় মনে হচ্ছে",
      "votes": "1",
      "replies": [
        {
          "text": "পাওয়া যেতেই পারে। আগেও পাওয়া যেত। কিন্তু এখন মাঠ খালি। ওপেন করে দেয়া আছে সব। তাই ভাড়াদাতার কাস্টমার বেড়েছে।",
          "votes": "2",
          "replies": [
            {
              "text": "হয়ত",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Should make an app \" খসাও\" or \" ফাসাও\"",
      "votes": "1",
      "replies": []
    },
    {
      "text": "How do these people get bail is the question time to hold the judiciary responsible",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 49
}