{
  "url": "https://www.reddit.com/r/bangladesh/comments/1lcu3zb/former_bal_minister_saifuzzaman_chowdhury_son_of/",
  "hash": "e4c9a2a84c1526d8ef0700d2523ec1e3",
  "scraped_at": "2025-12-10T02:18:38.126847",
  "title": "Former BAL minister Saifuzzaman Chowdhury son of Ex BAL MP Aktharuzzaman chowdhury Babu, UK properties has been frozen by National crime agency(UK).",
  "description": "Short summary from wiki:\n⁠⁠Central Figure in Hallmark Scandal:Chowdhury was the Chairman of the Board of Directors of Sonali Bank during Bangladesh's largest banking scandal at the time.\nMassive Embezzlement:The scandal involved the embezzlement of Tk 35 billion (approx. $438 million)from Sonali Bank's Ruposhi Bangla Hotel branch in 2012.\n2.Funds were illegally disbursed through fake documents and Letters of Credit (LCs)primarily to the Hallmark Group and several other companies.\n3. Alleged Role:As Chairman, Chowdhury faced significant allegations of negligence and failure in oversight,enabling the massive fraud to occur under the bank's watch. His political influence was also cited as a factor.\nConsequences: He was suspended from his position as Chairman of Sonali Bank. He was forced to resign from his post as State Minister for Land.\nSaifuzzaman Chowdhury, as Chairman of Sonali Bank, was centrally implicated in a Tk 35 billion embezzlement scandal involving fake LCs to companies like Hallmark Group, leading to his suspension and resignation from ministerial office due to alleged negligence and oversight failure.\nWiki Link: https://en.m.wikipedia.org/wiki/Saifuzzaman_Chowdhury",
  "votes": "95",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Noice finally something good...Bring that money home, to the people",
      "votes": "18",
      "replies": [
        {
          "text": "Not gonna happen. Brits have been historically chor!",
          "votes": "9",
          "replies": [
            {
              "text": "Oh f... Forgot it's them",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "i promise you that money wont come to bangladesh. its gonna stay in UK just like how other money laundered is ultimately welcomed here.",
          "votes": "11",
          "replies": [
            {
              "text": "Maybe I am overly optimistic, let's just hope some of it comes back or we get a diplomatic deal in return",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "It’s ironic that this post got only 13 upvotes so far. But if it was anti Jamat/ NCP post then hundreds would have upvoted it. Seems like Reddit has become the new place for Awami Leaguers.",
      "votes": "16",
      "replies": [
        {
          "text": "True. Bal supporters looted money and they are spending it now in Reddit and other places.",
          "votes": "9",
          "replies": []
        }
      ]
    },
    {
      "text": "If anyone is interested, there is a documentary by Al Jazeera",
      "votes": "7",
      "replies": []
    },
    {
      "text": "In r/deshbangla Reddit the admin rubens_va (follower of Mr. Joy from Virginia USA) aren’t allowing these posts!!",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Altharuzzman had historic & heroic role in 1971 as freedom fighters,I respect his bravery in 1971.\nBut there are many freedom fighters later turned into politicians , Amala and did heinous crime,fraud ,looting against Bangladesh 🇧🇩.",
      "votes": "1",
      "replies": [
        {
          "text": "Altharuzzman had historic & heroic role in 1971 as freedom fighters,I respect his bravery in 1971.\nBut there are many freedom fighters later turned into politicians , Amala and did heinous crime,fraud ,looting against Bangladesh 🇧🇩.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "If the UK of all places cracks down on your laundered wealth, you really really suck at doing it. Bro's a nepo baby who sucks at doing shady politician stuff",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Are these all developments done by these ministers during BAl reign?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Dumb people do the dumbest crap after they steal like dumba$$e$.\nEven white people usually don't keep their ill-gotten wealth in white nations because they'll invite whoever they want with the cash and then keep said cash when the math doesn't add up, which they know usually don't given the context.\nThis fool even had a heads-up with the Russo-ukraine war where Rus oligarchs had their assets confiscated in the UK and this clown still dove headfirst onto the same path.\nOfcourse can't say he doesn't deserve it but I hope we get some of it back",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Er naki UK te 300+ apartment 🤯",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I think we should open the doors for foreign money launderers. It would be a good way to recover some of this loss lol",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Good",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 59
}