{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ov2e8w/property_inheritance_to_our_child_who_is_not_a/",
  "hash": "2d037a48138fbce9a5e4545bc37b508b",
  "scraped_at": "2025-12-10T02:04:07.184706",
  "title": "Property inheritance to our child who is not a Bangladeshi citizen.",
  "description": "My wife is a Bangladeshi citizen. Me and our daughter are Indian citizens. We are all currently residents of UAE for the past several years.\nBoth me and my daughter have NVR visas to visit/stay in Bangladesh.\nMy wife is the single child to her parents and her father had previously bought properties and lands under my wife's name.\nMy wife now wants to prepare a will to nominate our daughter + future children (if any) as beneficiary(ies) to all her land and properties in Bangladesh. The main problem being the heirs not being Bangladeshi citizens.\nHow complicated is the process and can anyone refer a good lawyer/firm who can handle this ? We are currently in Dhaka.",
  "votes": "19",
  "comments": [
    {
      "text": "Well, your daughter can get citizenship by descent, can't she?\nEdit: India doesn't allow dual citizenship, I forgot.",
      "votes": "8",
      "replies": [
        {
          "text": "Indian law doesn't permit dual citizenship. And giving up Indian citizenship for BD nationality isn't really a good option.\nMy daughter will be inheriting properties from my side as well. Which is significantly more.\nThe only issue is my wife is worried about the hassle out daughter/children will face in a claim to her properties if something happens to her.\nBoth countries are not in the best of terms. Thats why my wife wants to prepare a will.",
          "votes": "7",
          "replies": [
            {
              "text": "That's a bummer, But I believe talking to a lawyer in BD will definitely help.\nJust used ChatGPT, according to GPT your child doesn't need to have bangladeshi citizenship, rather needs to prove family relationship. She can also use Muslim inheritance law in BD if applicable. Anywas, I believe you will get better response from a Bangladeshi lawyer.",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Sell the properties and take the money and give to your kids or invest it somewhere else",
      "votes": "2",
      "replies": []
    },
    {
      "text": "The requirement to have an NVR (No Visa Required) is to be a Bangladeshi citizen. This means you (not sure how) and your daughter (she can be Bangladeshi as the mother is) are Bangladeshi citizens. If you can workout on this, will be much easier.\nI know India doesn’t allow dual citizenship, but maybe using just the birth certificate to have the basic documents like NID, would work. No need to get a passport. Would that not work? From the Indian government’s side, no passport means she still conforms with the rules, just not fully. You are still in the risk side anyway with an NVR, which is issues only yo citizens. And if you formally renounced the citizenship, I don’t see how you’d get an NVR.\nOtherwise, as a “foreigner”, getting properties and inheritance is hard.",
      "votes": "4",
      "replies": [
        {
          "text": "Not sure if they changed the rule anytime recently, but Indians and other SAARC nationals are not eligible for NVR. In fact, Bangladesh has an exclusionary dual citizenship rule, and a Bangladeshi citizen cannot be a dual citizen of certain countries, which includes India. Therefore, she will have issues on both the Indian & Bangladeshi side to maintain dual citizenship.\nNID also requires proof of citizenship. It’s only issued to Bangladeshi citizens. However, as far as I know, just like everything else rules are laxly enforced and if you know the right people, lots of non-citizens end up getting NIDs.",
          "votes": "1",
          "replies": [
            {
              "text": "But OP has a NVR on an Indian passport.. How did he even obtain it? If he could pull that off, I don’t see why he can’t pull off an NID as well.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Your daughter, as she was born to a Bangladeshi mother, is a Bangladeshi citizen by birth as per our constitution. There’s no legal way that she can renounce her Bangladeshi citizenship. Well, she can cancel her Bangladeshi passport and give a declaration for the sake of Indian citizenship, however, she’ll be given a Bangladeshi passport upon request.\nNow, regarding her right to the land, you can talk to a good lawyer and they can sort it out for you. You are daughter is technically a non-resident Bangladeshi. This link can help.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Your daughter can possibly get an NID which should allow inheritance\nHow/when did you get your NVR? In my experience it’s not normally issued to spouses of SAARC heritage",
      "votes": "1",
      "replies": [
        {
          "text": "A lawyer actually suggested this.\nGetting NID for my daughter. But I was under the impression that he is trying to do this through his connections. Because how can a citizen of another country apply for an NID legally ? Will our daughter/children face issues like \"you have acquired NID illegally\" and as a result her claim to the will becomes a messy task.\nI got my NVR a year after marriage. In 2018. I had a good lawyer then. Took about 45 days in total. It was hard because my wife was still doing her university then.\nMy daughter got It rather quickly as she was daughter to a Bangladeshi parent.",
          "votes": "3",
          "replies": [
            {
              "text": "Give a call to the Bangladeshi embassy in India and ask them how to do NID for your daughter. Tell them she is the daughter of a Bangladeshi woman and see what they suggest. I think the birth certificate (Bangladeshi) + a permanent address in Bangladesh would be enough.",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Not too complicated, but since your daughter’s not a Bangladeshi citizen, she might not be able to own the land directly though she can still inherit it or sell it later. Just make sure your wife’s will clearly names her as heir.\nYou can contact Rahman’s Chambers, The Legal Circle or FM Associates in Dhaka since i heared they handle these cross-border inheritance cases all the time",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 6
}