{
  "url": "https://www.reddit.com/r/bangladesh/comments/1l0k3it/international_crimes_tribunal_live_trial_against/",
  "hash": "a6627c1f2350d14c844d13407544afe0",
  "scraped_at": "2025-12-10T02:18:57.145933",
  "title": "International Crimes Tribunal Live trial against Sheikh Hasina for crimes against humanity.",
  "description": "Former Bangladeshi Prime Minister Sheikh Hasina is facing a multitude of legal challenges, including charges of corruption and crimes against humanity.\nCrimes Against Humanity: Hasina is accused of orchestrating a \"systematic attack\" against protesters during the 2024 student-led uprising, resulting in mass casualties. Prosecutors at Bangladesh's International Crimes Tribunal (ICT) presented evidence suggesting a coordinated and widespread attack on protesters, according to Al Jazeera.\nThe prosecution cited video evidence and encrypted communications to support the claim that the killings were planned. Hasina faces charges including \"abetment, incitement, complicity, facilitation, conspiracy and failure to prevent mass murder\". The trial against her began on June 1, 2025.\n2. Corruption Allegations: Hasina and her family are implicated in several corruption cases, including allegations of illegal land acquisition and embezzlement.\nThe Anti-Corruption Commission (ACC) has filed cases against Hasina and her family, accusing them of illegally acquiring land in Dhaka. One case involves the alleged embezzlement of $5 billion related to a Russian-funded nuclear power plant.\nHasina's niece, Tulip Siddiq, a British MP, is also implicated in the land grab allegations. Hasina's son, Sajeeb Wazed Joy, has denied any involvement in the corruption allegations.",
  "votes": "1",
  "comments": [
    {
      "text": "If Hasina can be brought back then it's a big deal. There's no justice if she's not arrested in the first place.",
      "votes": "3",
      "replies": [
        {
          "text": "Let’s be honest not a single politician was convicted in Bangladesh for their crime and corruption.\nPolitician Goes to jail only when they are in opposition and get Scot-free by bribing or compromising with Government.",
          "votes": "2",
          "replies": []
        }
      ]
    }
  ],
  "id": 60
}