{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ks6erl/have_anyone_been_to_prison/",
  "hash": "f0acf79e0f7664a87201232bafb3360a",
  "scraped_at": "2025-12-10T02:20:03.693786",
  "title": "Have anyone been to prison?",
  "description": "Only know about US & Latin American prison systems because of crime documentaries & movies. Curious how prisons work here, similarities & differences 🤔",
  "votes": "2",
  "comments": [
    {
      "text": "Never man. What a late night thought",
      "votes": "11",
      "replies": [
        {
          "text": "Haha, watching a video on prisons for illegal immigrants in El Salvador. It feels kinda weird to not know anything about our stuff",
          "votes": "5",
          "replies": [
            {
              "text": "Have talked to some local prisoners. Their experience is worse compared to the ones that we see in movies or documentaries",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "About ten years ago my older brother got arrested from an anti-awami league protest. He was in jail for three and a half months before being released by court because he was 17, and his lawyer argued that the police tortured him in remand (he had head injury from the torture). Other than the police brutality in remand, his stories of jail are mostly funny.\nAccording to him, the first day he was sent to jail, he was sold to some group immediately (idk about other jails but Dhaka central jail which is now defunct apparently had some level of slavery). Soon the shibir block in jail bought him out and sheltered him. Due to a massive number of arrests the jails are all full of opposition party members.\nThe currency in jail are packets of cigarettes, and sometimes other goods. Inmates smoke marijuana all the time. He had some funny stories with other inmates and interactions that I don’t filly remember. Soon he was transferred to Kashimpur Jail in Gazipur where things were slightly better.\nThe prison system is Bangladesh is vile and disgusting. The people working there are the most corrupt, and if you have the wealth and influence- you can do/get anything.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Watch some videos from our news channels. I've watched some once I was curious.",
      "votes": "2",
      "replies": [
        {
          "text": "Any particular investigation/documentaries from news channels you recommend?",
          "votes": "1",
          "replies": [
            {
              "text": "1\n২\n৩ important",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "No but jemne bortoman shorkarer biruddhe kotha boltesi I might as well be",
      "votes": "4",
      "replies": [
        {
          "text": "না জেলে যাওয়ার ভয় নাই, বর্তমানে কোন ফ্যাসিস্ট সরকার নাই। আপনি ইচ্ছামত যা ইচ্ছা বলতে পারেন তবে সামনে নির্বাচিত সরকার আসলে আর পারবেন না",
          "votes": "-2",
          "replies": [
            {
              "text": "It's debatable je ekhon kotota shadhinota ase, but it's true je porer amole jei ashuk shei abar bakshadhinota purapuri maray dibe",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "ভালো প্রচেষ্টা ডিডি",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 64
}