{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ou8h7b/in_patiya_chattogram_an_officer_himself_gets/",
  "hash": "9f7c7ba22fca035cd8532e8fac80b367",
  "scraped_at": "2025-12-10T02:04:26.444534",
  "title": "in Patiya, Chattogram, an officer himself gets arrested with 60,000....",
  "description": "In an operation in Patiya, Chattogram, the Rapid Action Battalion (RAB) arrested five people with 60,000 (don't want to get flagged) so, let's say: ''father tablets'', around Tk 250,000 in cash, and two microbuses. Among those arrested is an official of the Department of N@rc0tics Control (DNC). The raid was conducted on Saturday night at the Khornna area in Patiya after setting up a checkpoint.\nThe arrested official has been identified as Md Abdullah Al Mamun (41), an Assistant Sub-Inspector (ASI) at the DNC’s Patiya Mujafarabad office under the Chattogram “B” Circle. During the operation, RAB recovered 10 tablets from his pocket, one walkie-talkie, a DNC-branded coat and cap, and Tk 243,515 from his vehicle. The remaining tablets were found hidden under the driver’s seat of the other microbus.",
  "votes": "11",
  "comments": [
    {
      "text": "Kanoon ka rakhwala, bhosriwala",
      "votes": "2",
      "replies": []
    },
    {
      "text": "source : https://www.prothomalo.com/bangladesh/district/297724yxzs",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Where do these come from? Are they locally produced? Or are they shipped from nearby countries?\nAs an expat, I’m not very familiar with the crisis this item is causing in BD. I even had to look up what the codes here referred to. When I lived there, the big problem was with a certain brand of cough syrup.\nThe ingredients in the “father tablets” are very damaging to society. I’ve personally known several people here who had their lives ruined by that active ingredient.",
      "votes": "1",
      "replies": [
        {
          "text": "If you look at our map its quite obvious where all the narcotics, illegal weapons and substances are coming from.",
          "votes": "-1",
          "replies": []
        },
        {
          "text": "Mostly Myanmar",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Damn, aita to amar badir pasher ghotona; ar ami jani na",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 7
}