{
  "url": "https://www.reddit.com/r/bangladesh/comments/1jy6mky/asif_nazrul_meghna_alams_detention_process_was/",
  "hash": "520bda7214c41f0ad33abdda8b3f1e6c",
  "scraped_at": "2025-12-10T02:22:30.690267",
  "title": "Asif Nazrul: Meghna Alam’s detention process was improper",
  "description": null,
  "votes": "11",
  "comments": [
    {
      "text": "If only Asif Nazrul was in a position of power to help this woman out or something.",
      "votes": "14",
      "replies": []
    },
    {
      "text": "আপসোস আসিফ নজরুল স্যারের মত একজন যদি আজ রাষ্ট্র পরিচালনার কাজে থাকতো",
      "votes": "11",
      "replies": []
    },
    {
      "text": "Press secretary spewing more hate here",
      "votes": "16",
      "replies": [
        {
          "text": "It’s such a shame because I used to like him a lot during his AFP days.",
          "votes": "6",
          "replies": []
        },
        {
          "text": "The press secretary is such a buffoon. I can't stand him. He is always spewing propaganda and causing controversies.",
          "votes": "10",
          "replies": [
            {
              "text": "He is a third rate propagandist.",
              "votes": "8",
              "replies": []
            },
            {
              "text": "I asked him a few questions on the KC podcast but he kept dodging them by bringing vuri over and over again\ngovernment doesn’t really care about anything anymore it’s all just about good PR now",
              "votes": "4",
              "replies": []
            },
            {
              "text": "Is he, though?\nBD government didn't know the story yet. Do you expect BD to burn bridges to a high-profile country without concrete evidence.\nIf anything, the arrest was a smart trick to keep her until the situation is calmed down",
              "votes": "-1",
              "replies": []
            }
          ]
        },
        {
          "text": "Shafiqul Alam:",
          "votes": "4",
          "replies": []
        },
        {
          "text": "The press secretary is turning into কাউয়া কাদের ২.০ He needs to be controlled before he does irreparable damage to CA.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "So he meant to say that he did not know about this earlier....interesting....and DB chief became scapegoat out of all the higher official people involved....noice",
      "votes": "4",
      "replies": []
    },
    {
      "text": "I appreciate that Asif Nazrul can admit and say her detention process was flawed and she should not have been arrested like that, least of all using the controversial special powers act. But I want to know what steps will be taken against the ones who arrested her like this.",
      "votes": "6",
      "replies": [
        {
          "text": "He is the gov's law advisor, for fuck sake.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Asif Nazrul and his government are a bunch of disgusting pigs. Fucking fascists.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Chinmoy was arrested the same way.",
      "votes": "3",
      "replies": []
    }
  ],
  "id": 73
}