{
  "url": "https://www.reddit.com/r/bangladesh/comments/1jwlkhr/the_people_who_were_waving_the_nazi_flag_in_the/",
  "hash": "f7a14c9ba2fd9c9dcea45aca0ad77747",
  "scraped_at": "2025-12-10T02:22:48.443751",
  "title": "The people who were waving the nazi flag in the protests, have they been arrested yet?",
  "description": "Saw pictures of idiots carrying nazi germany flags and doing the nazi salute, this does a great disservice to the cause of the protest and such acts cannot be encouraged. I have not seen any news of them being arrested.",
  "votes": "23",
  "comments": [
    {
      "text": "ppl in bd doesn’t even get arrested for rape and murder, and you’re expecting someone to get arrested for waving nazi flag? dude, wake up.",
      "votes": "64",
      "replies": [
        {
          "text": "Hmm thats unfortunate,\nMy concern is globally when someone looks at those pictures its going to harm the movement and also paint us in a very bad way (not that we have a good reputation to begin with).\nOutsiders won't really care or realize how much of an idiot some of us bangladeshis can be.\nAtleast if the government had taken some strict actions it would've helped.\nI hope we speak about this openly in schools, universities and workplaces to atleast teach people that this is wrong and only harms us.\nIsraelis have been profiting from WW2 for decades, they're not bothered but rather benefit when someone waves that flag against them.",
          "votes": "9",
          "replies": [
            {
              "text": "we’re capable enough to harm ourselves, outsiders can’t do much harm than we’re already doing to ourselves, chill 😎",
              "votes": "7",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Dumb bangalis are too dumb to realize, you can practically call Hitler the father of Israel, if Hitler didn't do what he did, there would be no Israel, also Israel borrows much of its ideology from pre ww2 germany",
      "votes": "26",
      "replies": [
        {
          "text": "It's their \"Promised lands by God\" They would have taken over Palestine nonetheless. (The Zionism movement started Pre-WWII) https://en.wikipedia.org/wiki/First_Zionist_Congress",
          "votes": "4",
          "replies": []
        },
        {
          "text": "Lets actually do that though.... It would piss the Israelis a lot!",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "While it's morally reprehensible, it's not a crime by law in any country except Germany (perhaps one or two more.) We aren't in Europe, there are no laws against waving Nazi flags or heiling Hitler.",
      "votes": "13",
      "replies": []
    },
    {
      "text": "There’s no law against it afaik",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Why would they be? It’s only a crime in some specific European countries, not even all of them.",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Buddy thinks we live in Europe",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Is Bangladesh in Europe?",
      "votes": "16",
      "replies": []
    },
    {
      "text": "How many neo Nazi's got arrested in Europe? ( Let's not bring america, ykw )",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Well in Bangladesh those symbols aren't banned. So, they won't arrest them over showing these symbols.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Do you think this country is Germany? Why would you be arrested for waving the nazi flag?",
      "votes": "3",
      "replies": []
    },
    {
      "text": "No because we aren't Europeans. We don't have law for that. This isn't new in Bangladesh, we also scream N words thinking it's cool. Get over it.",
      "votes": "1",
      "replies": [
        {
          "text": "it’s funny as fuck bc those same nazis they’re emulating would think we are dirty ass dogs 😭 like what are they even trying to accomplish other than being soooo edgyyy",
          "votes": "6",
          "replies": []
        },
        {
          "text": "Get over it?\nI'm sorry but no, this sort of an idiotic move to wave nazi flags that too in a protest for the existential rights of palestinians is WRONG.\nAnd whats wrong needs to be called out as such.\nIf an illiterate thinks it is 'cool' to wave the nazi flag or use the 'N' word than they need to be educated.\nDon't ask the people calling it out to get over it. What is wrong with you?",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "“just displays Naziism” isn’t really the casual statement you think it is",
      "votes": "1",
      "replies": [
        {
          "text": "“just displays Naziism” isn’t really the casual statement you think it is",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "It's not illegal. It isn't even relevant for BD, there is no need to download other nation's problems, we have plenty of our own.",
      "votes": "1",
      "replies": [
        {
          "text": "Dawg bro, commiting ethnic cleansing against any race or people is unacceptable, that is literally happening to Palestinians, how do you condemn Israel then turn around and do the n*** salute? They literally have the same ideology",
          "votes": "11",
          "replies": []
        },
        {
          "text": "You do realize that if these pictures go viral globally than it does become our problem?",
          "votes": "2",
          "replies": [
            {
              "text": "No it won't because people everywhere know there are dumb people everywhere. Get out of the internet and check out reality sometimes.\nThere are nazi flags flying in current US protests, what problem did it cause other than \"omg its a nazi flag!!!\"? And that's in a country that was in the war. BD is irrelevant.",
              "votes": "11",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "this ain’t Europe",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Imagine being so catastrophically ignorant that, a brown-skinned Bangladeshi, proudly wave the flag of a man who would’ve seen them as dirt under his boot. Hitler didn’t fight for them he fantasized about exterminating ‘inferior races’ like them. If the Nazis showed up in Bengal, tney wouldn’t be saluting them they'd be begging for your life. Waving that swastika doesn’t make anyone bold, revolutionary, or anti-establishment. It just makes someone a clown, one so historically illiterate that celebrate a regime that would’ve thrown them into a mass grave without a second thought.\nBut hey, no surprise there, this is the same crowd that still lines up to milk Pakistan's dick, tongue out, ready to worship the very regime that butchered millions in '71. Historical amnesia is one thing, but this level of self-humiliating bootlicking is a whole new genre.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "This post was removed as it breaks reddiquette, which is a set of guidelines that all users of r/bangladesh follow in order to make the subreddit a civil discussion space.\nThis also includes discrimination or offensive language which is not tolerated here. This includes racism, misogyny, xenophobia, homophobia, and/or religious discrimination.\nBe civil. Remember the human that you're interacting with.\nWhile your post may have had substantive content, either right or wrong, we have had to remove this in order to be fair about enforcing the rules. Thank you for understanding.\nRule #1. Follow Reddiquette.\nএই পোস্টটি সরানো হয়েছে কারণ এটি রেডিকেট লঙ্ঘন করেছে। রেডিকেট হলো একটি নিয়মাবলী যা r/bangladesh এর সকল সদস্য মেনে চলে, যাতে এই প্ল্যাটফর্মটি শালীন এবং গঠনমূলক আলোচনার পরিবেশ বজায় রাখতে পারে।\nএই সাবরেডিটে কোনো ধরনের বৈষম্যমূলক বা আপত্তিকর ভাষার অনুমতি নেই। এর মধ্যে পড়ে বর্ণবাদ, নারীবিদ্বেষ, জেনোফোবিয়া, কুইয়ারফোবিয়া, এবং ধর্মীয় বৈষম্য।\nআপনার আচরণে শালীনতা বজায় রাখুন। মনে রাখবেন, যার সঙ্গে আপনি কথোপকথন করছেন, তিনিও একজন মানুষ।\nআপনার পোস্টে হয়তো গুরুত্বপূর্ণ কিছু বিষয় ছিল, তবে নিয়মের প্রয়োগ নিশ্চিত করতে এটি সরাতে হয়েছে। বিষয়টি বোঝার জন্য আপনাকে ধন্যবাদ।",
      "votes": "0",
      "replies": [
        {
          "text": "This post was removed as it breaks reddiquette, which is a set of guidelines that all users of r/bangladesh follow in order to make the subreddit a civil discussion space.\nThis also includes discrimination or offensive language which is not tolerated here. This includes racism, misogyny, xenophobia, homophobia, and/or religious discrimination.\nBe civil. Remember the human that you're interacting with.\nWhile your post may have had substantive content, either right or wrong, we have had to remove this in order to be fair about enforcing the rules. Thank you for understanding.\nRule #1. Follow Reddiquette.\nএই পোস্টটি সরানো হয়েছে কারণ এটি রেডিকেট লঙ্ঘন করেছে। রেডিকেট হলো একটি নিয়মাবলী যা r/bangladesh এর সকল সদস্য মেনে চলে, যাতে এই প্ল্যাটফর্মটি শালীন এবং গঠনমূলক আলোচনার পরিবেশ বজায় রাখতে পারে।\nএই সাবরেডিটে কোনো ধরনের বৈষম্যমূলক বা আপত্তিকর ভাষার অনুমতি নেই। এর মধ্যে পড়ে বর্ণবাদ, নারীবিদ্বেষ, জেনোফোবিয়া, কুইয়ারফোবিয়া, এবং ধর্মীয় বৈষম্য।\nআপনার আচরণে শালীনতা বজায় রাখুন। মনে রাখবেন, যার সঙ্গে আপনি কথোপকথন করছেন, তিনিও একজন মানুষ।\nআপনার পোস্টে হয়তো গুরুত্বপূর্ণ কিছু বিষয় ছিল, তবে নিয়মের প্রয়োগ নিশ্চিত করতে এটি সরাতে হয়েছে। বিষয়টি বোঝার জন্য আপনাকে ধন্যবাদ।",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Why would that be a problem? Does Holocaust hurt your butt?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Thank you goy for addressing this. You will be kept as one of the best slaves for the jews with the advent of the Messiah",
      "votes": "1",
      "replies": [
        {
          "text": "Ashche extremist chacha",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 74
}