{
  "url": "https://www.reddit.com/r/bangladesh/comments/1jqo58h/were_the_criminals_in_the_street_hanging_posters/",
  "hash": "325edede3e1753d7ab0bc8833c6ffc7f",
  "scraped_at": "2025-12-10T02:23:10.218775",
  "title": "Were the criminals in the street hanging posters really hanged?",
  "description": "Hanging posters can be seen everywhere, often with images of criminals + ropes + bloody victims. Is this a protest poster or an official announcement? I didn't see any official signature.",
  "votes": "3",
  "comments": [
    {
      "text": "What? Post pic.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Bro share a pic",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "well OP if you look at the poster it more or less says \" Want hanging of X\". so its pretty much a protest (Demand?) of a kind.",
      "votes": "1",
      "replies": [
        {
          "text": "Rape and murder of a young girl can be exempted from the death penalty? such a great country.",
          "votes": "1",
          "replies": [
            {
              "text": "Yes , like much of the western country and even our neighboring country India the minimum sentence for convicted rape is not a death sentence. whether I agree on the minimum sentence or not you singling out Bangladesh (and judging by your post history multiple times too) its weird.\nMakes it even more weird because in one of your comment on a post which asked will Hasina get death sentence you called Bangladeshi more cruel than Koreans, yet here you are also saying Bangladesh is bad for not giving death sentence every time?\nNot to add i actually went through your comments and it seems like you even been called out by even other Indians for pointing out Bangladesh where it did not matter.\nJust a rule of thumb , don't scroll reddit when you hate other country which is clearly not yours so much. makes your life much more difficult.\nP.s I do agree the disgusting man should get hanged , albeit I also know there are proper cons to it too.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "They are protest posters. I've seen people doing these since childhood.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 75
}