{
  "url": "https://www.reddit.com/r/bangladesh/comments/1j6v4f1/%E0%A6%AF_%E0%A6%A8%E0%A7%9F_%E0%A6%86%E0%A6%A8%E0%A6%A6%E0%A6%B2%E0%A6%A8_%E0%A6%B9%E0%A6%93%E0%A7%9F_%E0%A6%89%E0%A6%9A%E0%A6%A4/",
  "hash": "ee562078af55d9224853239d4e8b2bf8",
  "scraped_at": "2025-12-10T02:24:15.051948",
  "title": "যা নিয়ে আন্দোলন হওয়া উচিত",
  "description": "কিছুদিন পরপর বিচারের দাবি নিয়ে রাস্তায় নামতে হয় কেন? কারন আইনের শাসন প্রপার্লি ফাংশন করে না বাংলাদেশে।\nক্রাইম সবসময়ই হচ্ছে, সামনেও হবে। আপনাকে এমন একটা সিস্টেম তৈরি করতে হবে যাতে অপরাধী তার কৃতকর্মের সাজা অবশ্যই ভোগ করে।\nএই রেজাল্টের জন্য প্রয়োজন আইনের শাসন। আইনের শাসনটা আসবে কিভাবে? ১। সহজে অভিযোগ দায়ের করার ব্যবস্থা ২। অভিযোগ অনুযায়ী সঠিক এবং দ্রুত তদন্ত ৩। ভিক্টিম এবং অভিযোগকারীর নিরাপত্তা প্রদান ৪। মিথ্যা অভিযোগ নিরোধে ব্যবস্থা গ্রহণ ৫। এভিডেন্সের প্রপার হ্যান্ডেলিং এন্ড প্রডাকশন ৬। প্রসিকিউশনসহ তদন্ত এবং বিচারে সংশ্লিষ্ট সব পক্ষের দুর্নীতি রোধ ৭। বিচারকার্য দ্রুতকরণে ব্যবস্থা নেয়া ৮। বিচারের ফলাফল এবং এক্সিকিউশন সম্পর্কে জনগণকে অবহিত করে সামাজিক সচেতনতা তৈরি। ৯। আরও খুঁটিনাটি যেসব কারনে কনভিকশন হয় না, সেসব সমস্যার গোড়ায় গিয়ে সেটা সমাধানের চেষ্টা করা।\nএসব ইনিশিয়েটিভ না নিয়ে বা ইনিশিয়েটিভ নেয়ার জন্য চাপ প্রয়োগ না করে একবার যাবজ্জীবনকে মৃত্যুদন্ড করার আন্দোলন, তারপর মৃত্যুদন্ডকে প্রকাশ্য মৃত্যদন্ডের আন্দোলন। এসব করে কিছুই হবে না। কিছুদিন গলা ফাটাবেন, কিবোর্ড গরম করবেন, তারপর যেই লাউ সেই কদু।\nঅপরাধ রোধ করতে আপনার ডিটারেন্ট ফোর্স তৈরি করতে হবে। সেটা তৈরির একটা প্রসেস হচ্ছে সামাজিক সচেতনতা এবং সুশিক্ষা। আরেকটা হচ্ছে সবার মনে এই ভয় ধরিয়ে দেয়া যে অপরাধ করে পার পাওয়া যাবে না। শাস্তি ভোগ করতেই হবে।\nমৃত্যুদন্ডের বিধান ডিটারেন্ট ফোর্স না। ডিটারেন্ট ফোর্স হচ্ছে অপরাধীর সাজার নিশ্চয়তা। অপরাধ করেছে মানে তাকে শাস্তি পেতেই হবে। সেটা ৫-১০ বছর হলেও গণহারে কনভিকশনহীন মৃত্যুদন্ডের আইনের চেয়ে ভালো কাজ করবে।\nআসল সমস্যা নিয়ে কথা বলেন। কিছুদিন পর পর বিচার চাই আর মৃত্যুদন্ড চাই আন্দোলনের অবসান ঘটবে।",
  "votes": "5",
  "comments": [
    {
      "text": "জেল থেকে জোর করে ছাড়িয়ে নিয়ে গেলে কি করবেন?",
      "votes": "4",
      "replies": [
        {
          "text": "আইনের সুশাননের জন্যই তো এটা হচ্ছে। উপরে কি লিখলাম। আইনের শাসন থাকলে তো এই জিনিস করার সাহসই পাইত না।",
          "votes": "3",
          "replies": [
            {
              "text": "তাইলে স্পষ্টভাবে উল্লেখ করে প্রতিবাদ করতে হবে। হালকার উপর ঝাপসা বলে লাভ নেই।",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 79
}