{
  "url": "https://www.reddit.com/r/bangladesh/comments/1j3o9yg/is_this_really_how_bangladeshi_media_going_to/",
  "hash": "39f236be2d1d0e79e8a89da548779992",
  "scraped_at": "2025-12-10T02:25:18.256859",
  "title": "Is this really how Bangladeshi media going to function?",
  "description": "A BNP mob raided to a house owned by ex parents in law of Tanvir Imam. They are divorced since 2001.",
  "votes": "98",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Accept the reality. Anyone can can rob your home. You can't do anything. If you do, you might be arrested in Devil hunt operation. Chief Advisor said that everything is normal.",
      "votes": "68",
      "replies": [
        {
          "text": "This is exactly what's going on. People who are quiet because they are not affected yet will be the next victim.",
          "votes": "41",
          "replies": [
            {
              "text": "People stay silent until they are the target. And if you are not silent, you are definitely the next. Sad but true.",
              "votes": "24",
              "replies": []
            }
          ]
        },
        {
          "text": "I'm a Bangladeshi born and raised in the USA so please forgive my ignorance. But what's going on here?\nA quick Google search tells me Tanvir Imam is a part of Awami League, a rival political party, but the replies seem to suggest these sorts of raids can happen to private citizens as well?",
          "votes": "11",
          "replies": [
            {
              "text": "The flat belongs to Tanvir Imam's ex wife. They got divorced in 2001 and she is a USA resident right now. Tell me in which law give you the audacity to raid any house (who so ever) without any proper warrent? As USA resident, you should have enough knowledge how law works. Isn't it? But unfortunately in BD right now, it is a lawless situation.",
              "votes": "15",
              "replies": []
            },
            {
              "text": "",
              "votes": "1",
              "replies": []
            },
            {
              "text": "TL;DR: This post is from a known pro-BALer. Many of the comments here are either from BAL supporters/naive people who they use as pawns.\nViolence is happening now, just like before. Our media was often suppressed from reporting on it, which isn’t surprising after living under 15 years of dictatorship. Don’t get me wrong—this government needs to do more to stop it and I’m not a fan of the home advisor’s lack of action.\nHowever, posting misinformation like this only helps BAL supporters push the story that things were “better” under dictator Hasina and that we should return to that. It’s as simple as that, and people just run with it. They benefited from the regime so why not, right?\nYou’ll see now in the comments this post is debunked. But, most comments correcting this information will be down voted by the same people who benefit from the misinformation.",
              "votes": "-4",
              "replies": []
            }
          ]
        },
        {
          "text": "Accept the reality",
          "votes": "0",
          "replies": [
            {
              "text": "Ashchorjo to...k ba kara jeno media theke mob er live gula delete kore ditese...video te to aro oneke chilo...ei tinjon charayo r ekjon slogan ditesilo...ekta chosma pora chele gate vangtechilo...ekta lal panjabi pora chele lead ditesilo.....mojar to bepar ta...ki sundor oporadhi der lukaye fela hoilo...thik bolsen khali ei 3 jon e chilo...press kaku ja bolbe tai sotti...accepted",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "… Of course its Shomoy TV coverage",
      "votes": "18",
      "replies": [
        {
          "text": "Not only somoy TV, all the media were there...Jamuna TV did live... apparently presence of media and calling themselves 'Chatro-jonota' gave them immunity.",
          "votes": "15",
          "replies": []
        }
      ]
    },
    {
      "text": "কুত্তার বাচ্চা গুলা দেশটা ধ্বংস করে দিলো.....",
      "votes": "9",
      "replies": [
        {
          "text": "Who’s destroying the country?",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "If it were America, there would have already been multiple rounds shot for trespassing.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Did we ever see mobs break into people home and loot infront of police and army before shadhinota 2.0",
      "votes": "9",
      "replies": [
        {
          "text": "nope nope.",
          "votes": "1",
          "replies": [
            {
              "text": "Noticing the way your comment got downvoted by BAL dalals for spreading the accurate information. It’s no surprise that that subreddit is all about creating a rumour mill for them",
              "votes": "3",
              "replies": []
            },
            {
              "text": "",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Man, they have to find jobs for these young firecrackers or else they will explode doing stupid sh&$..and then this media channel needs to be fined by the government. What a sad story..",
      "votes": "4",
      "replies": [
        {
          "text": "Sad story is you fell for misinformation, unfortunately - it’s what this OP does best",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Damn it, this is going way too far....",
      "votes": "4",
      "replies": [
        {
          "text": "This misinformed post was shared by a known BAL supporter on this sub",
          "votes": "4",
          "replies": [
            {
              "text": "Thanks man keep us updated, and save us from misinformation. Feeling at ease, as slowly these perpetrators are getting caught...",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Enjoy this Bangladesh 2.0! Your beloved country! The Red Independence!",
      "votes": "4",
      "replies": []
    },
    {
      "text": null,
      "votes": null,
      "replies": []
    }
  ],
  "id": 83
}