{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ilf22b/operation_devil_hunt_1308_arrested_so_far_the/",
  "hash": "8362b2209d59bed3c896bcaefe74e959",
  "scraped_at": "2025-12-10T02:26:43.598011",
  "title": "Operation Devil Hunt: 1,308 arrested so far | The Daily Star",
  "description": null,
  "votes": "27",
  "comments": [
    {
      "text": "Number of people from \"Towhidi jonota\" arrested = 0",
      "votes": "27",
      "replies": []
    },
    {
      "text": "mobonnoyok = 0 Towhidi jonota = 0 nice.",
      "votes": "17",
      "replies": []
    },
    {
      "text": "Number of mobonnoyoks arrested = 0",
      "votes": "14",
      "replies": []
    },
    {
      "text": "Blatant corruption and bias",
      "votes": "7",
      "replies": []
    },
    {
      "text": "That sounds so absurd. Whom did they arrest? Seems like the government is attempting to focus on numbers to eyewash the public that things are being taken care of. They need to release the details. And also how many they arrested in the light of the recent attacks and vandalization.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "-5",
      "replies": [
        {
          "text": "Yup, Godspeed bro 😎 let them cry",
          "votes": "-2",
          "replies": [
            {
              "text": "To be honest, I don’t really care whether BNP, Jamaat, or student groups come to power. As someone who spent his childhood in Bangladesh and has now lived in Europe for almost half of his life, I just want my country’s foreign policy to be independent. I don’t want my country to be India’s puppet. (I’m not mentioning Pakistan because, realistically speaking, we don’t share a border with them, and they’re too broke and weak to influence other countries—except maybe Afghanistan, since they share a border.)\nYou don’t need to be a geopolitical expert to understand that Pakistan will never be a threat to Bangladesh. Given that we share the majority of our border with India, they are the biggest potential threat. This subreddit is filled with BAL loyalists who serve India’s interests.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "-12",
      "replies": []
    }
  ],
  "id": 88
}