{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ot9zry/crude_bombs_exploded_at_four_separate_locations/",
  "hash": "9c704b8dc5e825bb1037e89f939bc0fd",
  "scraped_at": "2025-12-10T02:04:59.462183",
  "title": "Crude bombs exploded at four separate locations in Dhaka this morning (10 November)",
  "description": "Crude bombs exploded at four separate locations in Dhaka this morning (10 November), including the premises of Fisheries and Livestock Adviser Farida Akhter. Two bombs targeted her business on Sir Syed Road around 7:10am, with one exploding inside the premises and the other on the street, according to Mohammadpur Police Station’s Officer-in-Charge.\nIn Dhanmondi, two motorcycle riders hurled crude bombs near Ibn Sina Hospital and in front of Midas Center at Dhanmondi-27 around 7:30am. Police confirmed no injuries and said the suspects fled the scene when officers tried to apprehend them. CCTV footage and other evidence have been collected.\nEarlier, around 3:45am in Mirpur, a bomb exploded on the road in front of Grameen Bank headquarters. Mirpur Model Police Station confirmed no injuries and said investigations are ongoing to identify those responsible.",
  "votes": "12",
  "comments": [
    {
      "text": "প্রাক ২০০৬ বাংলাদেশে আবার স্বাগতম, কে হবে নতুন বাংলা ভাই?",
      "votes": "14",
      "replies": []
    },
    {
      "text": "Source: The Business Standard - https://www.tbsnews.net/bangladesh/crime/crude-bombs-exploded-4-separate-locations-dhaka-including-adviser-faridas-business",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Littol one, will you post about the police attack on teacher's protest day before yesterday? That incident needs attention too!",
      "votes": "5",
      "replies": [
        {
          "text": "Police er dalals downvoting this? My god 😭😭",
          "votes": "5",
          "replies": [
            {
              "text": "imma give an upvote RQ😌. btw, i made a post abt it already.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Jamaat er kaj deshe atonko toirir jonne",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 9
}