{
  "url": "https://www.reddit.com/r/bangladesh/comments/1if616n/correction_not_indian_bangladeshi_navy_harassing/",
  "hash": "b4ace93e291592485fb33c926b3b96ba",
  "scraped_at": "2025-12-10T02:28:20.117809",
  "title": "* Correction not Indian Bangladeshi Navy Harassing Foreign Women in Sri Lankan",
  "description": null,
  "votes": "0",
  "comments": [
    {
      "text": "INS Vijatbahu(India) and KRI BUNG (Indonesia) was also parked the same day. It would be hard to tell it's really Bangladesh. Bangladesh's Samudra Joy made more headlines so it's easy to get into the suspicion. AMAN is an event in Pakistan which some countries are visiting and stopping at Sri Lanka on the way.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Proof? How are you sure they’re Bangladeshi? You’re most prolly rendian in Bangladesh sub",
      "votes": "1",
      "replies": [
        {
          "text": "This post was removed as it breaks reddiquette, which is a set of guidelines that all users of r/bangladesh follow in order to make the subreddit a civil discussion space.\nThis also includes discrimination or offensive language which is not tolerated here. This includes racism, misogyny, xenophobia, homophobia, and/or religious discrimination.\nBe civil. Remember the human that you're interacting with.\nWhile your post may have had substantive content, either right or wrong, we have had to remove this in order to be fair about enforcing the rules. Thank you for understanding.\nRule #1. Follow Reddiquette.\nএই পোস্টটি সরানো হয়েছে কারণ এটি রেডিকেট লঙ্ঘন করেছে। রেডিকেট হলো একটি নিয়মাবলী যা r/bangladesh এর সকল সদস্য মেনে চলে, যাতে এই প্ল্যাটফর্মটি শালীন এবং গঠনমূলক আলোচনার পরিবেশ বজায় রাখতে পারে।\nএই সাবরেডিটে কোনো ধরনের বৈষম্যমূলক বা আপত্তিকর ভাষার অনুমতি নেই। এর মধ্যে পড়ে বর্ণবাদ, নারীবিদ্বেষ, জেনোফোবিয়া, কুইয়ারফোবিয়া, এবং ধর্মীয় বৈষম্য।\nআপনার আচরণে শালীনতা বজায় রাখুন। মনে রাখবেন, যার সঙ্গে আপনি কথোপকথন করছেন, তিনিও একজন মানুষ।\nআপনার পোস্টে হয়তো গুরুত্বপূর্ণ কিছু বিষয় ছিল, তবে নিয়মের প্রয়োগ নিশ্চিত করতে এটি সরাতে হয়েছে। বিষয়টি বোঝার জন্য আপনাকে ধন্যবাদ।",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 94
}