{
  "url": "https://www.reddit.com/r/bangladesh/comments/1if32qy/my_maid_is_being_abused_by_her_husband/",
  "hash": "8664503495c17d8b3a5ccc09afd7229b",
  "scraped_at": "2025-12-10T02:28:36.141720",
  "title": "My maid is being abused by her husband",
  "description": "My maid 21-23 (F) married her husband mid 30's (M) when she was about 17-18. She has been physically abused by her husband, I've seen her come into work multiple times with bruises, cuts and once even a few broken bones. They have two children, age 3 and the other 5 years old. The husband has abused and hit said children along with her and the husband has gone to Jail for drug abuse 6-7 times. Each time he has gotten bailed out by his parents. This has put a lot of strain on their relationship and the well-being of their kids and my maid. She wants to get a divorce, but due to her financial situation, she is unable to afford a Lawyer. Instead has to rely on civil lawyers who despite being \"free\" have asked for a fee of 20,000 tk. What should she do in this situation and what can I do to help her?",
  "votes": "40",
  "comments": [
    {
      "text": "Thank you for caring and trying to look out for her. Will it get sorted out if she pays the civil lawyers what they are demanding? In this case, one easy solution is to simply pay the lawyers what they are asking. By raising some money or giving it to her as a loan or donation.\nAlternatively, you can contact law students and relevant groups to get more suggestion. Contacting with any organization that deals with abuse of poor women could also be helpful.",
      "votes": "13",
      "replies": []
    },
    {
      "text": "If you want to raise the 20k taka and need help creating a go fund me fundraiser, let me know. I am happy to help. Usually only people from eligible countries can create them.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Try contacting BLAST\nhttps://blast.org.bd/",
      "votes": "8",
      "replies": []
    },
    {
      "text": "I don't remember the names but there were a couple of NGOs that work in this area. The government also has a dedicated department for this.",
      "votes": "10",
      "replies": []
    },
    {
      "text": "Try GoFundMe",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 95
}