{
  "url": "https://www.reddit.com/r/bangladesh/comments/1icu8zj/anyone_protesting_under_al_banner_will_face_legal/",
  "hash": "38cf4a63e9cf2f173ac5557471260464",
  "scraped_at": "2025-12-10T02:28:52.411405",
  "title": "Anyone protesting under AL banner will face legal action: CA Press Secy | The Daily Star",
  "description": null,
  "votes": "34",
  "comments": [
    {
      "text": "Abandoning constitutional protocols for this Interim Government will prove disastrous in the longer run.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "I see, so it’s only fascism when hasina does it 🤣🤣 Other government regime can suppress civilian organization and now that’s ok 🤡 dumbest shit I’ve ever seen",
      "votes": "11",
      "replies": [
        {
          "text": "",
          "votes": "-2",
          "replies": [
            {
              "text": "Okay can you explain why?",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Well, I would normally agree but interim government showed incompetency or downplayed minority issues compare to past plus not as opposed to the BNP leaders who are just as corrupted. I can't support them either. But if Hindus get killed protesting for Bal as they have been given no alternatives by this incompetent Yunus government, I will have to take side with those Hindus because it will be used as an argument against Hindus that they deserved violence for supporting Bal. But overall, it's a total mess. In ideal situation it will be under new leadership, but I don't think Bal will ever abandon Shiekh Family just like BNP abandoning Zia family.",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Did we in our history ever have a press secretary who spoke so much? Every day every moment kisu na kisu bolar lagbe.",
      "votes": "18",
      "replies": [
        {
          "text": "I mean he is the press secretary and seems like there are a lot of questions coming up for govt.",
          "votes": "6",
          "replies": []
        },
        {
          "text": "Thats literally his job. Everyday update dawa.",
          "votes": "1",
          "replies": [
            {
              "text": "He should be doing that in the official capacity fron the advisors office and meet the press when they ask question. Not go around giving his opinion and wants and needs.",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "office birds hobbies plough elastic memory brave cautious hungry squeeze\nThis post was mass deleted and anonymized with Redact",
          "votes": "0",
          "replies": [
            {
              "text": "Gonoshontru is the present govs kauwa. But kauwa ke protidin shunar lagto na.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "-5",
      "replies": []
    },
    {
      "text": "",
      "votes": "-14",
      "replies": [
        {
          "text": "tumi mathe naime odr bash mairo sahos thakle reddit e aishe faporbaji bad dao",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-9",
      "replies": []
    },
    {
      "text": "Sounds a bit like the F word doesn't it?",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 96
}