{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ls93n2/bangladeshi_crypto_discord/",
  "hash": "07152983b9dbb472dd7921c5da5b6ca1",
  "scraped_at": "2025-12-08T15:24:19.149800",
  "title": "Bangladeshi Crypto Discord",
  "description": "I’m a Bangladeshi international student living in Canada, and I’ve been deep in crypto for a few years now. I’ve seen a few cycles, been through the ups and downs, and picked up a lot of experience along the way. I mostly go for solid plays, but I’m not above getting into meme coins when the vibes are right lol.\nWhat I’ve noticed though there’s no proper crypto community for Bangladeshis. No Discords, no active Telegram groups, nothing where we can actually talk, share plays, or just learn from each other.\nSo I’m building one.\nThe goal is simple: create a Discord for Bangladeshi crypto people (or anyone who speaks Bangla tbh) where we can:\nTalk strategies and plays\nDo portfolio reviews\nHelp each other learn\nTake advantage of this bull run together\nIf that sounds like your vibe, DM me and I’ll send over the Discord link. Just getting started but I want to build something solid, long-term.",
  "votes": "4",
  "comments": [
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Yeah vro. I would invest in meme coins if it was legal",
      "votes": "1",
      "replies": [
        {
          "text": "there are safe work arounds",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Lol crypto is illegal here, what do you expect?",
      "votes": "1",
      "replies": [
        {
          "text": "Banks dont allow deposit, but P2P diye kora jaye",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 103
}