{
  "url": "https://www.reddit.com/r/bangladesh/comments/1lrc88v/news_alert_bangladeshs_external_debt_doubled_from/",
  "hash": "849b3776aa42b95059b2c42b86615a13",
  "scraped_at": "2025-12-08T15:24:35.676557",
  "title": "News Alert: Bangladesh’s external debt doubled from $51 billion in FY 2016‑17 to $103 billion by end‑December 2024, its debt‑to‑GDP ratio staying stable around 23% due to rapid GDP growth.",
  "description": "By the end of December 2024, Bangladesh's external debt reached $103 billion, up from $51 billion in FY 2016–17 roughly twice as much over seven years .\nGDP rose from $223 B to $450 B in the same period, so the debt-to-GDP ratio stayed stable at ~23% (22.9% → 22.8%) .\nDebt is mainly financing infrastructure and energy projects, with private-sector borrowing now at about $19 B.\nDebt-service-to-exports climbing (~14%) is a growing concern, as interest payments (projected $2.2 B by 2027) rise amid a weakening Taka .\nAs per 2025,\nExternal debt stands at $103.6 B, a modest 3% rise from the previous year’s $100.6 B\nDebt-to-GDP ratio remains steady at around 22–23%, well below IMF’s 40% ceiling\nDebt servicing has increased sharply during July–April FY 25: principal payments hit $2.21 B (+33%), interest $1.30 B (+13%)\nShort-term debt is manageable at about 3.2% of GDP\nBangladesh has also secured a fresh $1.33 B under IMF programs to help cushion reserves and maintain macro stability.",
  "votes": "37",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "23% is very healthy tbh. Our people freaked out for nothing.",
      "votes": "23",
      "replies": [
        {
          "text": "Yes it is Healthy",
          "votes": "4",
          "replies": [
            {
              "text": "If you believe so, why are you sharing a post with an alarming title?",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "It's healthy only when you have production and reserve surplus with a good enough tax-revenue collection! Govt has to buy the foreign currency to pay back! In our context it squeezes the budget heavily!",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "USA wishes it only had 103 billion in debt.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "-9",
      "replies": [
        {
          "text": "bro is onto nothing like always",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "We have a tax-to-gdp ratio of around 8%, so external debt like 100+B is not good for the fiscal budget and going to increase in upcoming years!",
      "votes": "1",
      "replies": []
    },
    {
      "text": "There is a better acid-test for the short term. Debt servicing as a percentage of foreign currency income projections. According to that, BD was quite healthy. But not anymore. Foreign income has decreased. 23% debt-to-gdp ratio is sustainable only if you have a very good inflow of money at least for the near future. Otherwise you have to keep asking for loans to repay loans. In 2023, 23% debt-to-gdp ratio was healthy considering the foreign income and COVID bounce back. But is that healthy right now?\nI do not have sufficient data to answer that.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 104
}