{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oz5y57/bangladesh_imports_over_five_times_its_exports_to/",
  "hash": "5022717fb93ce6916e0ab2287580df1f",
  "scraped_at": "2025-12-08T14:59:21.708029",
  "title": "Bangladesh imports over five times its exports to SAARC nations",
  "description": "News Source: https://www.thedailystar.net/business/news/bangladesh-imports-over-five-times-its-exports-saarc-nations-3846631",
  "votes": "62",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Bangladesh had a large amount of exports during the 1700s and 1800s. After that, the British destroyed our industries. Then, Pakistan also destroyed our industries. Finally, we got physical freedom from Pakistan, but failed to get economic independence from India because of our corrupt rulers' love for power. They bootlicked the policy of our neighboring country to stay in power.\nCan you tell who destroyed the jute and sugar industries of Bangladesh?",
      "votes": "10",
      "replies": [
        {
          "text": "All nations have their neighbours as the largest trading partner",
          "votes": "2",
          "replies": [
            {
              "text": "That is true, but unfortunately India is an unreliable partner. They have repeatedly treated us as an enemy state, rather than seeing us as equals to work with.\nIndia wants to be a super power who bullies it's neighbors.\nI accept that we trade a lot with them, but we need look elsewhere and diversify away from India",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Full points for stupidity. Canada & Mexico have their largest trading partners as US. What do you what to import from Bhutan or Nepal ? You are locked by India in all sides, you share customs & culture with a section of Indian population (Indian Bengalis) & what will you trade against Pakistan @ the other end through sea route or countries like Bhutan, Sri Lanka or Nepal.\nPlease use your brain. BTW, Bangladesh also used to export a lot via India pre Yunus. The Petrapole land port in West Bengal used to one of the busiest across South Asia & used to ship Bangladeshi products across. There was transit finalised to Nepal/Bhutan via India. And Bangladeshi people will only crib when Hilsa is exported where you have a trade surplus & gain foreign exchange.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "It’s all about economics not religion. Think with a cool head. To start with you need minerals. To process these minerals you need refineries like steel mills. Later you need industrial machinery or tools to produce something meaningful. Then you need to make stuff that others need at the lowest cost. For this you need capital. Money and skills. For money, you need foreign investment. To attract foreign investment, you need political stability and law and order. Stable government and stable institutions and perfect law n order.\nLet’s discuss this on some other day, when BD checks every box.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Boycott India Saar. ওরা গোমুত্র খায় সার। ওদের কোন জিনিস লাগবেনা সার। আমাদের ব্রাদার পাকিস্তান থেকে আনলেই হবে সার। ইন্ডিয়া থেকে আনি কি হইছে সার? আমরা কি টাকা ছাড়া আনি সার? যেখান থেকে খুশি আনব সার।",
      "votes": "7",
      "replies": [
        {
          "text": "Indian?",
          "votes": "2",
          "replies": [
            {
              "text": "না। বাস্তববাদী। আমার দরকারে সবার সাথে সুসম্পর্ক রাখা লাগবে। বিশেষ করে সে যদি সুপারপাওয়ার হয় 😉 কিন্তু আপনাদের মাথায় এসব ঢুকবে না। মুখে দিল্লী না ঢাকা। মনে শুধু টাকা, টাকা 🤑",
              "votes": "0",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Racist bot",
      "votes": "1",
      "replies": [
        {
          "text": "Racist bot",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "this was because of hasina. i dont use a single indian product. everyone should do the same",
      "votes": "0",
      "replies": [
        {
          "text": "60% of onion market , a decent size of of the rice market, cooking oil, and even a part of our electricity is imported from India.. so the truth u do use indian product not directly ... but u do",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "What exactly do you want to import from Nepal, Bhutan, Maldives or Afganistan?",
      "votes": "1",
      "replies": [
        {
          "text": "…. and Pakistan",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "just say india",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 11
}