{
  "url": "https://www.reddit.com/r/bangladesh/comments/1l36k87/as_india_bans_land_route_garment_exports_from/",
  "hash": "b9c2f0e7cc2a566caad3ebecc732fc10",
  "scraped_at": "2025-12-08T15:26:29.041974",
  "title": "As India Bans Land Route Garment Exports from Bangladesh, Who Pays the Price?",
  "description": "Nearly 70% of West Bengal’s extensive cross-border logistics fleet, mostly owned by small transport operators, are dedicated to trade with Bangladesh. With daily truck movements at these vital land ports sharply reduced, an estimated 12,000 to 15,000 workers are on the verge of losing their primary source of income.\nPetrapole alone, South Asia’s largest land port and a hub for roughly 70% of India-Bangladesh land-based trade, daily truck movements dropped from 600-700 to less than 200 within a week, forcing many shopkeepers to shut down due to a complete lack of customers. An estimated 2,000-3,000 labourers who typically earn Rs 300-600 daily on piece-rate contracts are now faced with uncertainty.",
  "votes": "29",
  "comments": [
    {
      "text": "I understand your point but you forget that Mamata Banerjee and not BJP runs West Bengal. BJP may in fact benefit from this economic turmoil as the party in power generally suffers with hard economic times.",
      "votes": "15",
      "replies": []
    },
    {
      "text": "If Bangladesh can't find alternatives, then It's Bangladesh",
      "votes": "3",
      "replies": [
        {
          "text": "Bangladesh isn't waiting. Their shipping is still going at full steam but India's transhipiment was the cheapest option now the profit has cut down a bit because they are using their own methods",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Imports from garments raw materials jumped by 40% last year our exports suddenly didn't jump 40% so what is the reason.\nThe reason is last year, our garments thread industries were unable to produce due to gas shortage. Imports from india allowed us to execute those orders.\nIf indian imports shuts down and we are unable to get gas.\nWe pay the price.",
      "votes": "14",
      "replies": [
        {
          "text": "But but... india is also paying price we should be happy with it, who cares we are suffering....... Are you barotio dalal??",
          "votes": "13",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-5",
      "replies": [
        {
          "text": "At least till elections are held.",
          "votes": "9",
          "replies": []
        },
        {
          "text": "That what you get for being anti India instead of being neutral",
          "votes": "2",
          "replies": [
            {
              "text": "Being netural out of fear of India is pure Boot licker mentality.",
              "votes": "3",
              "replies": []
            },
            {
              "text": "Being neutral implies being both against India and Pakistan, not bootlicking either of them",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "-2",
      "replies": [
        {
          "text": "",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "Sri Lanka’s garment industry grew significantly because of the political instability.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 111
}