{
  "url": "https://www.reddit.com/r/bangladesh/comments/1l2vbd4/%E0%A6%AC%E0%A6%B7%E0%A6%AF%E0%A6%9F_%E0%A6%A6%E0%A6%B7%E0%A6%9F%E0%A6%95%E0%A6%9F_%E0%A6%A8/",
  "hash": "e7f041c08ccc17b0f35bbc40721df7d7",
  "scraped_at": "2025-12-08T15:26:46.781282",
  "title": "বিষয়টা দৃষ্টিকটু না?",
  "description": "দুইটা স্ক্রিনশট চেক করেন। আসন্ন বাজেটে এক দিকে আমেরিকান 110 টি পণ্যে শুল্ক ছাড় দেওয়া হয়েছে। অন্যদিকে দেশীয় পণ্য এবং দেশীয় উদ্যোক্তাদের উপর বাড়তি কর আরোপ করা হয়েছে। আমি অর্থনীতির মানুষ নই, এসব বিষয়ে এমনিতেও কম বুঝি। জ্ঞানী গুণীরা আমাকে বুঝায় দেন তো - আমেরিকান পণ্যকে সুবিধা দিয়ে দেশীয় পণ্যের দাম বাড়িয়ে দিলে আমাদের অর্থনীতির কি কি উপকার হচ্ছে?",
  "votes": "11",
  "comments": [
    {
      "text": "If Bangladesh hadn't lowered its tariffs, the U.S. would've hit back with higher tariffs on Bangladeshi goods due to Trump's current retaliatory tariff policy, which would've completely crippled the country’s economy. Remember, Bangladesh runs on RMG, and the U.S. is its biggest importer.\nThis would have led to soaring inflation, an unprecedented spike in unemployment (as garment factories would lay off workers to cope with shrinking profits), and a sharp depletion of foreign reserves. That, in turn, would have impacted the energy sector too, since Bangladesh relies heavily on energy imports, which require a steady supply of dollars.",
      "votes": "19",
      "replies": [
        {
          "text": "Well said🙌🏾",
          "votes": "3",
          "replies": []
        },
        {
          "text": "কিন্তু দেশীয় উদ্যোক্তাদের উপরে কেন এই চাপ?",
          "votes": "1",
          "replies": [
            {
              "text": "They need to make up for the lost revenue incurred from reduced tariffs somehow.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Trump is like a big bully, while we are like the scrawny kids in school. The problem is - this bully's dad is the headmaster, so you gotta keep him happy if you want to pass. If he asks you to eat dirt, you eat dirt.\nBangladesh has to keep it's garments sector alive to keep the economy afloat. USA is the biggest importer of Bangladeshi garments. With 37% tarrif, many US companies may find it no longer feasible to manufacture garments in BD.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "সেটাই মনে হচ্ছে",
      "votes": "0",
      "replies": [
        {
          "text": "সেটাই মনে হচ্ছে",
          "votes": "0",
          "replies": []
        }
      ]
    }
  ],
  "id": 112
}