{
  "url": "https://www.reddit.com/r/bangladesh/comments/1kz16tr/japan_to_provide_1_billion_to_bangladesh_in/",
  "hash": "bd43419ff6ca06aa7dd3a72269f641dc",
  "scraped_at": "2025-12-08T15:27:38.546265",
  "title": "Japan to provide 1 Billion to Bangladesh in Budget Support",
  "description": "Japan will provide $1.063 billion in support to Bangladesh for budget assistance, railway upgrades and education, Dhaka said on Friday, as interim head Muhammad Yunus visits Tokyo to strengthen ties between the two countries.The package includes $418 million as a development policy loan to Bangladesh to help with economic reforms and climate resilience, Yunus' press office said in a statement.Another $641 million will be used to upgrade a railway line while Japan will also provide $4.2 million in grants for scholarships for Bangladeshi students.\nhttps://www.reuters.com/markets/asia/japan-give-106-billion-bangladesh-budget-support-dhaka-says-2025-05-30/",
  "votes": "30",
  "comments": [
    {
      "text": "It is an MOU, a non-legally binding agreement. It holds a slightly higher value than a verbal agreement. You just got conned by the media. Almost 80% of MOUs are broken midway.",
      "votes": "9",
      "replies": [
        {
          "text": "Do you think it will get passed?",
          "votes": "1",
          "replies": [
            {
              "text": "There is no way to know, as Bangladesh doesn't make MOU statistics public.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "নিঃস্বার্থ বন্ধু",
      "votes": "5",
      "replies": []
    },
    {
      "text": "এই লন সেকাসিনা নিলে কয়ডা গালি খাইতো ভাবতেছি। But, they are lending 641m for railway improvement which I really look forward to.",
      "votes": "7",
      "replies": [
        {
          "text": "Japan bd re emnei dey. Kisu hoilei dey. Khaleda na hasina care koee na.",
          "votes": "9",
          "replies": [
            {
              "text": "Right",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "Shekih Hasina nia to London a rakto, LNG bill to pay korto na.",
          "votes": "2",
          "replies": []
        },
        {
          "text": "Funny thing is rail line extention from ishordi to joudebpur was already settled with Jica at the end of 2023. Ei gov i just stolen credit niye shamney jabey",
          "votes": "3",
          "replies": [
            {
              "text": "Just like all other projects",
              "votes": "2",
              "replies": []
            },
            {
              "text": "Its not just rail, a lot will disburse for different stuff.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "This is great. My dad worked in Japan as a guest worker during the late 80s/early 90s. I wish he were alive to see how far things have come.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "as a loan or grant? I'm confused.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "বাজেট ব্যবস্থাপনার নামে ওয়ার্ল্ড ব্যাংক, জাপানসহ অন্যান্য সংস্থা থেকে লোন নিচ্ছে ইন্টেরিম সরকার! রিজার্ভ বাড়ানো মূল উদ্দেশ্য হলে ঠিক আছে, না হলে লোন তো লোন‌ই! এর থেকে রেমিট্যান্স পাঠানোর ব্যাংকিং খরচ কমানো আর মানি লন্ডারিং এর রাস্তা আরো ছোট করা বেশি জরুরি! এটা করতে পারলে রিজার্ভ এমনিতেই বাড়বে!",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": [
        {
          "text": "Link den, screenshot na.",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 115
}