{
  "url": "https://www.reddit.com/r/bangladesh/comments/1kyz5f0/japan_may_suspend_loan_for_matarbari_project_over/",
  "hash": "19a72ba1f38ca46d6fe728ff7cd13baf",
  "scraped_at": "2025-12-08T15:27:57.136669",
  "title": "Japan may suspend loan for Matarbari project over corruption allegation",
  "description": "\"The corruption allegations are centered on Jahangir Alam, a former project director appointed during the Awami League government. He served in the role from 2022 to 2024. On 13 May, the ACC filed a case against him, accusing him of amassing Tk 290 million (29 crore) in illegal wealth. On the day of the filing, ACC Director General Md Akhtar Hossain told the media that Jahangir Alam made suspicious transactions totaling Tk 1.27 billion (127.35 crore) across 94 bank accounts, in addition to possessing assets beyond his known income.\"",
  "votes": "28",
  "comments": [
    {
      "text": "We need to deal with the corrupt scumbags ASAP. Our country have suffered enough now is the time to get rid of this trashes",
      "votes": "21",
      "replies": [
        {
          "text": "I do not think that the interim government will take sufficient actions against corrupt government officials right now because they are fearful of protests, blockades, and sit-ins.",
          "votes": "8",
          "replies": [
            {
              "text": "It should be done passively and as a long term goal.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "stuff like this is the reason we wont get foreign investments.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Shameful incident these people are traitors i dont know why no strict punishment are taken against corrupt people, need 20 plus years like Sri Lanka did recently",
      "votes": "8",
      "replies": [
        {
          "text": "Because the IG is fearful of protests, blockades, and sit-ins by government employees.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Hopefully Yunuses visit and BIDA will solve this. They have already talked about MIDI. Loosing this loan will be a big blow.",
      "votes": "2",
      "replies": []
    }
  ],
  "id": 116
}