{
  "url": "https://www.reddit.com/r/bangladesh/comments/1kxabwa/%E0%A6%8F%E0%A6%95%E0%A6%A6%E0%A6%87_%E0%A6%AE%E0%A6%B8%E0%A6%B0_%E0%A6%AE%E0%A6%A7%E0%A6%AF_%E0%A7%AB%E0%A7%A6_%E0%A6%B6%E0%A6%A4%E0%A6%B6_%E0%A6%AB%E0%A6%AF%E0%A6%95%E0%A6%9F%E0%A6%B0_%E0%A6%AC%E0%A6%A8%E0%A6%A7_%E0%A6%B9%E0%A7%9F_%E0%A6%AF%E0%A6%AC_%E0%A6%AC%E0%A6%9F%E0%A6%8F%E0%A6%AE%E0%A6%8F_%E0%A6%B8%E0%A6%B9%E0%A6%B8%E0%A6%AD%E0%A6%AA%E0%A6%A4/",
  "hash": "25f85de0f34bdffd01ee00ea514ad96a",
  "scraped_at": "2025-12-08T15:28:13.990415",
  "title": "এক-দুই মাসের মধ্যে ৫০ শতাংশ ফ্যাক্টরি বন্ধ হয়ে যাবে: বিটিএমএ সহসভাপতি | | বাংলাদেশ প্রতিদিন",
  "description": null,
  "votes": "11",
  "comments": [
    {
      "text": "Why isn't enough people talking about these things?\nThe EPZ's and other factories and businesses are dying right now. If these businesses shuts, then we will be in a economic turmoil.\nYunus gov't has many flaws, but the economic sector is a blunder. The whole sector is totally vulnerable. They should do something to help the businesses.",
      "votes": "14",
      "replies": []
    },
    {
      "text": "পথে বসে যাব আমরা, এসব মালিকফের পুরানো কথা।\nইদ আইসা গেছে কোটিপতি মালিকদের এখন প্রাডোতে বইসা বলতে হবে আমি ফকির, শ্রমিকের বেতন দেয়ার টাকা নাই। সব বাটপারদের ভর্তুকি পাওয়ার লোভ।\nএদের প্রত্যেকটা শত কোটি টাকার মালিক। রাজনীতি করে। হাসিনার পার্লামেন্ট এ ১০ এর অধিক গার্মেন্টস ব্যবসায়ী ছিল। এই বাটপারদের শ্রমিকরা পিটায় না এদের ভাগ্য।",
      "votes": "5",
      "replies": []
    },
    {
      "text": "ঈদের বেতন বোনাস দেয়ার সময় কিভাবে যেনো কোম্পানি গুলো বন্ধ হবার উপক্রম হয়। ২ মাসের বেতন ভাতা বকেয়া রাখতে পারলে এগুলো খুব ভালো চলে।",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Sadly, there is no way to significantly increase gas supply in the short term. We do not have adequate infrastructure at the moment to import more gas, and domestic production has been on the decline since 2021. Even if new gas fields are discovered, it will take time to add that to the gas grid.\nThe previous government did not prepare for this, which is why we are in this situation now. And no, it is physically impossible to fix this problem at the moment.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "-10",
      "replies": [
        {
          "text": "Gas deya, power supply deya and security situation thik kora is the responaibilty of the state.",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "ঈদ আসলেই ফকির হয়ে যায় শালারা",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Lmao these weasels say this shit regularly. Eid er beton deyar time hoilei factory bondho hoye jawar upay hoy taina? Waaa we can't take massive loans and default on them anymore 🤣",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 117
}