{
  "url": "https://www.reddit.com/r/bangladesh/comments/1kst5x7/i_think_that_humanity_corridor_is_the_dumest/",
  "hash": "d3fd43ade59d8bbf7c2023ff15b5c4e8",
  "scraped_at": "2025-12-08T15:29:03.075632",
  "title": "i think that humanity corridor is the dumest thing if it is used the Bangladesh will also directly involved involved in Myanmar internal conflicts then there will be a attack from the opposition. US will be involved in our internal politics then we will be forced to be a puppet state for US",
  "description": "any thoughts on it ?",
  "votes": "17",
  "comments": [
    {
      "text": "I am an Indian and I know it’s not my place but I would just say it is a terrible idea cos\nWhen US army enters a country some of the sovereignty is compromised. Look at Afghanistan and Pakistan right now\nChina will be watching it very closely as they are investing\nIt makes my country uncomfortable as there may be spill overs of war into India\nRussia would also be watching cos this is a major trade route at this time\nYou guys should think and consider this very carefully",
      "votes": "11",
      "replies": []
    },
    {
      "text": "I think in the short run while we might want to relive the Rohingya population, in the long term, we need to do PR work with Myanmar, as we absolutely need them on our side in the long run.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I say we enforce a safe zone inside Myanmar for Rohingyas and other peoples of Myanmar seeking refuge from war and destruction. It has a precedent as Turkey has done it with the Kurds and Syrian refugees when they were escaping the civil war. Indeed it is better than sitting on our asses hoping it magically gets better like we've been doing for most part of the decade. It may also have the added benefit of uniting the peoples of Myanmar and restore democracy for their own good. As we would not negotiate with the Junta.",
      "votes": "1",
      "replies": [
        {
          "text": "So, what is your opinion on a permanent solution to ensure lasting peace in the whole region? We are housing 1.2 million Rohingyas. Nearly 140,000 came in last 6 months. Another 400,000-80,000 are likely to arrive in the coming months and years. Also, the more time we spend sitting back and doing nothing. The more emboldened India and Myanmar become. The Junta says Rohingyas are Bengalis alien to their nation. India has started sending their registered Rohingya refugees here because they are undesirable Muslims. If we are perceived as weak then that day is not too far away that all hundreds of millions of Muslims of Bengali-origin are pushed into what is already the world's most densely populated country. Where would we house them? We had to destroy such a great portion of Cox Bazar's nature just to house only a million Rohingyas. Rohingyas get to eat barely 2 meals a day even single meal some days. What will we do with those hundreds of millions of people? How do we provide for them? We need to send a powerful message. An unapologetic display of force is imperative to deter them all for good and I believe that window of time and opportunity is closing and closing fast.",
          "votes": "4",
          "replies": [
            {
              "text": "So, what is your opinion on a permanent solution to ensure lasting peace in the whole region? We are housing 1.2 million Rohingyas. Nearly 140,000 came in last 6 months. Another 400,000-80,000 are likely to arrive in the coming months and years. Also, the more time we spend sitting back and doing nothing. The more emboldened India and Myanmar become. The Junta says Rohingyas are Bengalis alien to their nation. India has started sending their registered Rohingya refugees here because they are undesirable Muslims. If we are perceived as weak then that day is not too far away that all hundreds of millions of Muslims of Bengali-origin are pushed into what is already the world's most densely populated country. Where would we house them? We had to destroy such a great portion of Cox Bazar's nature just to house only a million Rohingyas. Rohingyas get to eat barely 2 meals a day even single meal some days. What will we do with those hundreds of millions of people? How do we provide for them? We need to send a powerful message. An unapologetic display of force is imperative to deter them all for good and I believe that window of time and opportunity is closing and closing fast.",
              "votes": "0",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Being a US puppet in the case of Bangladesh is the best of a bad situation. India is hostile towards Bangladesh, If Bangladesh has US bases India will not attack it. this is why Qatar, KUwait, Bahrain, UAE have US bases.",
      "votes": "0",
      "replies": [
        {
          "text": "Yes but in one condition if we bangalis become most smart and taking advantage of this situation for development of country like uae..",
          "votes": "1",
          "replies": [
            {
              "text": "",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "US is already involved. who do you think is actually running the country? iykyk",
      "votes": "-2",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "You are correct",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 120
}