{
  "url": "https://www.reddit.com/r/bangladesh/comments/1knkfoq/interest_payments_subsidies_soak_up_almost_half/",
  "hash": "c34ceba392d0d423f3ade128a2bbdeb2",
  "scraped_at": "2025-12-08T15:29:53.230214",
  "title": "Interest payments, subsidies soak up almost half of budget | The Daily Star",
  "description": null,
  "votes": "11",
  "comments": [
    {
      "text": "One reason for the high subsidies is the power sector. The previous government built way too many power plants, most of them rely on imported fossil fuels. Unfortunately, they lacked the USD to purchase this fuel. As a result, the cost of producing electricity from these plants rose because they had to remain idle due to the fuel shortage but still accumulated capacity charges. This year, the subsidy for the power sector will be close to $5 billion.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Fuck. Now I see why govt thought about increasing tax and fixing the damn NBR.\nFor those who don't understand, the country is at a huge debt. Mostly from the inconsiderable about of loans taken by previous government.\nEvery debt has interest and even that interest is so high all combined that its a huge part of our fiscal year budget.\nSo we got little money left to actually spend of things like energy and education.\nThe fiscal year budget is really big this year. A whopping 790000 crore. But it needs to be even more. For that we need more tax money.\nA problem is there's tax evasion and mismanagement and not enough taxing.",
      "votes": "5",
      "replies": [
        {
          "text": "The budget has decreased this year.\nhttps://en.prothomalo.com/business/local/jo2tfs3yiw",
          "votes": "5",
          "replies": []
        },
        {
          "text": "Previously, the taxation was done through the taka printer. Once the international trade took off, it became very hard to print taka, as people had foreign currency to buy. Business people can use hundi at very good rates too. Taxation through currency debasement kinda worked decades ago, but no chance today.",
          "votes": "7",
          "replies": [
            {
              "text": "Previously, the taxation was done through the taka printer. Once the international trade took off, it became very hard to print taka, as people had foreign currency to buy. Business people can use hundi at very good rates too. Taxation through currency debasement kinda worked decades ago, but no chance today.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Sadly, this was expected after the previous regime rampart looting and defaulting on loans.\nSome people don't know how terrible the economy of the country was, and it still requires massive work to have to go up to a reasonable shape.",
      "votes": "1",
      "replies": [
        {
          "text": "They should have also skipped taking the iMF installemeny this time around.",
          "votes": "4",
          "replies": []
        },
        {
          "text": "I do not understand why you are getting downvoted for stating the obvious.",
          "votes": "1",
          "replies": []
        },
        {
          "text": "",
          "votes": "-1",
          "replies": [
            {
              "text": "Some people are still in Nazi like denism about what the previous regime did.",
              "votes": "-2",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 123
}