{
  "url": "https://www.reddit.com/r/bangladesh/comments/1kbab7q/bangladesh_now_ranks_as_9th_largest_economy_in/",
  "hash": "c0fbdb2ab28f7d8bf1f27bdc12be7c05",
  "scraped_at": "2025-12-08T15:32:33.100733",
  "title": "Bangladesh now ranks as 9th largest economy in terms of GDP in Asia",
  "description": "Link: https://www.instagram.com/p/DJDx7E5u7Fj/",
  "votes": "61",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Some say Hasina, some say Yunus, some say Khaleda Zia, some say Ershad.\nBaby, Bangladesh has been growing continuously for over 40 years now with no recession in between. Due to the size of the country’s population means our economy is going to be big anyways. It would have been better and bigger, with transparency, better infrastructure and education.",
      "votes": "70",
      "replies": [
        {
          "text": "That's the thing that some BD people don't realize. BD for better of worse have great resources in both population, fertile land and sea. If we had decent governments and less bloodshed to secure people's political rights, we would have gone closer to Malaysia and possibly the Singapore level.",
          "votes": "7",
          "replies": []
        }
      ]
    },
    {
      "text": "Wtf is this? Are we trying to fool ourselves now?",
      "votes": "16",
      "replies": []
    },
    {
      "text": "And how did he contribute to this? What policies did he adopt that made our country have such high GDP?\nMost importantly, why is his picture even plastered there?\nঝড়ে বক মরে, ফকিরের কেরামতি ফলে।",
      "votes": "38",
      "replies": [
        {
          "text": "This proves my theory, we don't even need a good leader. We just need someone who won't fuck things up and won't steal. Our people can handle the economy. I think his biggest achievement is that he isn't corrupt.",
          "votes": "16",
          "replies": [
            {
              "text": "tax evasion and money laudering is corruption. He as an employee and MD of Grameen bank opened up several companies and even ones abroad. Due to his good relations with gov in the past he god away with it. Now he is in comflict of interst with his previous companies.",
              "votes": "8",
              "replies": []
            },
            {
              "text": "think his biggest achievement is that he isn't corrupt.\nYou can never be sure about that. Even if he ain't like that, people under him will be. Our system is fucked.",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Class e duijon. Ar ami second. Lmfao.\nEdit: To be clear one has no people in it. Two has civil wars. And one has been a kingdom for so long, and land blocked as well. W*f do u expect? There is none in south asia.",
      "votes": "26",
      "replies": []
    },
    {
      "text": "এইসব ধন মার্কা ছবিগুলা কারা বানায় আসলে?\nমূর্খের দেশে AI দেয়া উচিত না",
      "votes": "18",
      "replies": []
    },
    {
      "text": "🤣🤣🤣",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Ami bujhlam na. 1 month aageo ei sub e khali BAL propaganda and BAL bots chilo. Ekhon etto Yunus bot ashse kibhabe I wonder.",
      "votes": "14",
      "replies": []
    },
    {
      "text": "This is based on Hasina’s economy. All Yunus did was halve the growth from last year.",
      "votes": "25",
      "replies": [
        {
          "text": "Get ready to be labeled as bal dalal",
          "votes": "14",
          "replies": []
        }
      ]
    },
    {
      "text": "What did Yunus do",
      "votes": "18",
      "replies": [
        {
          "text": "Nothing. It is how our media works. Constant dickriding.",
          "votes": "21",
          "replies": []
        }
      ]
    },
    {
      "text": "Was 2nd in SA since 2018. Nothing new",
      "votes": "4",
      "replies": []
    },
    {
      "text": "এই লোকটাকে কেউ থামান, না হয় পুরো বিশ্বে আমরা প্রথম স্থানে চলে যাবো 🫢",
      "votes": "14",
      "replies": []
    },
    {
      "text": "Means nothing if it does not improve quality of life for the working class. “Bangladesh GDP will surpass X country” headlines has been on for years but I have to still swing in the bus and walk on people’s spit to go to work.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Source?",
      "votes": "5",
      "replies": [
        {
          "text": "All the posts from The Daily Star about it are from 2020 or 2021, seems like bongowiki purposefully posted this by using the news.",
          "votes": "12",
          "replies": []
        }
      ]
    },
    {
      "text": "আওয়ামী লীগ ভালো না তবে তাদের কামিয়ে যাওয়া ক্রেডিট অতি উত্তম🤣",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Some say Hasina, some say Yunus and some say Obama. But the reality is that Bangladesh has been growing rapidly for years",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Bro wtf are these clown ahh edits from these online news pages 😭😭",
      "votes": "2",
      "replies": []
    },
    {
      "text": "GDP means jackshit in terms of living standards.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "The constant dickriding of Bangladeshi media outlets is hilarious. Only thing Yunus has done great so far is hiring an excellent PR team.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "And ranked 5th in population.\nIt is ranked 38th out of 49 on GDP per capita\nPalestine is 42nd... let that sink in, were marginally better than Palestine and they are colinised, beseiged and fragments with checkpoints all over within their lands. Israel controls their trade.\nI dont think the low GDP per capita is bad per se. Bangladesh has a lot of human capital and a big workforce. The failure of bangladesh is the inability to capital on their labour force. If you see how china has managed to make it so easy for other countries in the world to order goods from them very very easy. Bangladesh has failed to make it easy for fashion designers and small startup fashion groups to work directly with Bangladesh factorties.\nThere shiuld really be a alibaba version in bangladesh geared towards bangladesh garment factory where anyone who wants to start their clothing brand in the west can contract and order directly from bangladesh. I think currently people go to china and then china outsources to bangladesh.\nI was actually thinking of setting up a sofa cover business. Bespoke covers for IKEA sofas, There are companies like soferia.com and bemz where they produce and dispatch bespoke sofa covers to customers all over the world. I have a web background and if I could easily found a garment company who can do made to order covers from bangladesh I could undercut these european countries and send work to bangladesh. But bangkladeshi government is useless - dont not understand frictionless business, does not protect investors, allows thugs to go after any business that does well to extort them. In fact the governments directly controlled groups extort busineses.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "When the quality of life drastically improves for the average citizen, only then will we be very successful.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Largest economy, how foolish are these people. Lowest growth rate in 36 years, educate yourselves Bangladeshi peoples.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "-8",
      "replies": []
    }
  ],
  "id": 133
}