{
  "url": "https://www.reddit.com/r/bangladesh/comments/1k8zm9o/%E0%A6%A8%E0%A6%A4%E0%A6%A8_%E0%A6%AC%E0%A6%A8%E0%A7%9F%E0%A6%97_%E0%A6%A8%E0%A6%87_%E0%A6%9A%E0%A6%95%E0%A6%B0%E0%A6%93_%E0%A6%B9%E0%A6%B0%E0%A6%9A%E0%A6%9B%E0%A6%A8_%E0%A6%85%E0%A6%A8%E0%A6%95_%E0%A6%AE%E0%A6%B2%E0%A6%A7%E0%A6%A8_%E0%A6%AF%E0%A6%A8%E0%A6%A4%E0%A6%B0%E0%A6%AA%E0%A6%A4%E0%A6%B0_%E0%A6%8B%E0%A6%A3%E0%A6%AA%E0%A6%A4%E0%A6%B0_%E0%A6%96%E0%A6%B2/",
  "hash": "d9371087e5d1e7877c961ea85a4a994e",
  "scraped_at": "2025-12-08T15:33:29.208016",
  "title": "নতুন বিনিয়োগ নেই, চাকরিও হারাচ্ছেন অনেকে, মূলধনি যন্ত্রপাতির ঋণপত্র খোলা কমেছে ৩০ শতাংশ",
  "description": "গত দুই মাসে আমার পরিচিত কয়েকজনও চাকরি হারিয়েছেন। বর্তমান এই পরিস্থিতি নিয়ে আপনারা কে কী ভাবছেন??",
  "votes": "11",
  "comments": [
    {
      "text": "সব মূর্খ। মাইক্রো লোন নিলেই তো হয়! আমাদের নুনুস তো আছেই, তাই না?",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Alarming, and there is no indication the administration is doing anything to prevent it. They hiked gas prices, interest rates, now talking about electricity rates too. We are in for a bumpy ride it seems. The economy needs to be stimulated if you ask me, and there's no way IMF is allowing that.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "-6",
      "replies": [
        {
          "text": "আমি তো একমত , ভাই।\nভাই, পূর্ব পাকিস্তানে কিছু দালাল হয়েছিল ঠিকই। চলেন, একসাথে কোলাকুলি করে হাগুস্তানে হাঁ করে প্ল্যানিং করি!",
          "votes": "3",
          "replies": []
        },
        {
          "text": "If you live in the country, you should care about this. We can't afford a recession. The current government has no liability, they can just quit and move on. We'll be stuck with the mess.",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "মনে করেন আমি আজকে ১ কোটি টাকা ইনভেস্ট করে একটা কারখানা দিলাম, এখন আপনি ২০১৭ সালে উত্তরপাড়ার কুদ্দুছ আলীর ছেলের সুন্নতে খাৎনায় এক আওয়ামী লীগ নেতার সাথে তোলা ছবি প্রচার করে বললেন এ শালা স্বৈরাচারের দোসর, আমিও মার খাইলাম, জেলে গেলাম, আপনি সুন্দরমত আমার কারখানা দখল করে নিলেন, এ অবস্থায় নিতান্ত পাগল না হলে কেউ ইনভেস্ট করবে না",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 136
}