{
  "url": "https://www.reddit.com/r/bangladesh/comments/1k7ocqe/crown_sunglass_missing_unacceptable_blunder_made/",
  "hash": "f8ddca50e3067ca81e990ae1b012222e",
  "scraped_at": "2025-12-08T15:34:02.344217",
  "title": "Crown & sunglass missing: Unacceptable blunder made by Janakantha reporter",
  "description": "\"মাত্র আট মাসে ড. ইউনুসের নেতৃত্বে দেশের অর্থনীতিতে যে অগ্রগতি হয়েছে, তা বাংলাদেশের ইতিহাসে এক অনন্য মাইলফলক। এই সময়ে বাংলাদেশ পৌঁছেছে এক নতুন উচ্চতায়।\"",
  "votes": "62",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "As a medical man, this is so embarrassing. She's trying to say we're not good enough, even when compared to the healthcare professionals from Pakistan? Or we don't have the facilities? I mean what facility doesn't Dhaka medical or top non government facilities of Dhaka don't have that's abundantly available in Pakistan? I'm curious",
      "votes": "21",
      "replies": [
        {
          "text": "As a medical man, this is so embarrassing. She's trying to say we're not good enough, even when compared to the healthcare professionals from Pakistan? Or we don't have the facilities? I mean what facility doesn't Dhaka medical or top non government facilities of Dhaka don't have that's abundantly available in Pakistan? I'm curious",
          "votes": "21",
          "replies": [
            {
              "text": "Dhaka medical ki jongi training dei?? Na.",
              "votes": "9",
              "replies": []
            }
          ]
        },
        {
          "text": "\"I will fix her\"",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "A staggering display of carelessness. In their rush to attack, they forgot the basic, accuracy and dignity. Reducing serious economic debate to cheap mockery not only insults figures like Yunus but also diminishes the credibility of journalism itself. When truth is sacrificed for spectacle, both the public and the press lose.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "আরও পাঁচ বছর ইউসুফ সরকার কে চাই 🤟🤟",
      "votes": "21",
      "replies": []
    },
    {
      "text": "বিবিচিকে বিচ্চাচ করবেননা জনখন্টকে করুন",
      "votes": "28",
      "replies": []
    },
    {
      "text": "BBC-ও দেখি 'ফেসিস্ট'-এর দোসর।",
      "votes": "29",
      "replies": [
        {
          "text": "",
          "votes": "-18",
          "replies": []
        }
      ]
    },
    {
      "text": "ইউসুফ govt forever gawk gawk gawk",
      "votes": "17",
      "replies": []
    },
    {
      "text": "ঠিকই তো, ইউনুস ও তার গং এর সম্পদের পরিমান পাহাড়ের চুড়া সমান হয়ে গেছে। ফক্কিন্নির পোলারা জাস্ট হলের বারান্দায় সিট পাওয়ার জন্য আর ক্যানটিনে মাগনা খাওয়ার জন্য যখন ছাত্রলীগ করতো, এখন দেখেন না শয়ে শয়ে কোটি টাকা মাত্র ৮ মাসেই কামিয়ে ফেলছে। বাংলাদেশ টা হলো ডাইনিং টেবল।",
      "votes": "7",
      "replies": []
    },
    {
      "text": "ইয়ুনুস, স্বৈরাচারদের স্বৈরাচার, যে তার শাসনে দেশটাকে অভিশপ্ত করে তুলেছে! এই ধূর্ত দানব, সৌজন্যের মুখোশ পরে, বিশৃঙ্খলা থেকে পুষ্টি পায়, আর দুর্ভোগের এক ভয়াল সুর সৃষ্টি করে জাতিকে ছিন্নভিন্ন করে দিচ্ছে। তার হৃদয় বিদ্বেষের আগুনে পোড়া, যেখানে হিন্দু ও সংখ্যালঘুদের নিশ্চিহ্ন করার এক নির্মম অভিযানের আগুন জ্বলছে, যা আত্মাকে কাঁপিয়ে তোলে।\nতার রক্তে রাঙানো পতাকার নিচে অগণিত নিরীহ মানুষ—মা, শিশু, বৃদ্ধ—হত্যার শিকার অথবা নিজভূমি থেকে বিতাড়িত, আর তাদের আহাজারি হারিয়ে যায় তার প্রচারযন্ত্রের গর্জনের মধ্যে।\nইয়ুনুস, সেই রূপবদলানো সাপ, এমন নির্লজ্জ মিথ্যা বুনে যে সাধারণ মানুষ চোখে ঠুলি পড়ে যায়, আর তার নৃশংস কাজ ঢেকে যায় ধোঁকায়। সংখ্যালঘুদের জোর করে বিতাড়িত করে, তাদের ইতিহাস পুড়িয়ে দেয়, ভবিষ্যৎ ছিনিয়ে নেয়।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "IMF saying something else.inflation might go down to 6 in next economic year.before posting anything from bbc check the name of the journalists if they are from india.bcz most of the time they post something negative about Bangladesh it turns out to be from Indian journalists with made up facts",
      "votes": "1",
      "replies": []
    },
    {
      "text": "even the world bank raised concerns over our gdp growth this year. It's supposed to see the least bit of growth of three decades. We are fucked",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "-7",
      "replies": [
        {
          "text": "You mean to say people's right to express an opinion or the acceptability of their opinion depends on their political ideology?\nIsn't this exactly what fascism is?",
          "votes": "12",
          "replies": [
            {
              "text": "",
              "votes": "-8",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "যদি মন্দের ভালো পার্থক্য করি তাহলে বিবিসি বাংলা এর তুলনায় জনকণ্ঠ খবর একটু বিশ্বাসযোগ্য। কিন্তু বিবিসি বাংলা চালায় কলকাতার পাগলেরা এটার বেশিরভাগ খবর বিশ্বাস করার কোন মানেই হয় না।",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "-20",
      "replies": [
        {
          "text": "Reddit be like:",
          "votes": "9",
          "replies": []
        },
        {
          "text": "Do us intelligent folks a favor and put it here with source",
          "votes": "7",
          "replies": [
            {
              "text": "Already provided in auto moderator thread.",
              "votes": "9",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 138
}