{
  "url": "https://www.reddit.com/r/bangladesh/comments/1k6gs5y/bangladeshs_gdp_growth_to_slump_to_36year_low_30/",
  "hash": "e5119ac254233a6c5b5d24f6bbe20783",
  "scraped_at": "2025-12-08T15:34:38.203680",
  "title": "Bangladesh's GDP growth to slump to 36-year low, 30 lakh more set to sink into poverty: WB",
  "description": null,
  "votes": "70",
  "comments": [
    {
      "text": null,
      "votes": "4",
      "replies": []
    },
    {
      "text": "you are acting like dr. yunus did something and the gdp fall down an all time low? so you were happy with all the fake stats presented by bbs before and whats happening in reality doesnt matter to you, as long as the numbers are good?",
      "votes": "43",
      "replies": [
        {
          "text": "The very same article also mentions that much of this is due the inherited inflation, which largely has to do with the dictator's persistence on single-digit interest rates. Global uncertainty is also to blame. Furthermore here's a direct quote.\n\"Despite the gloomy current outlook, the World Bank projects Bangladesh's GDP growth will recover to 4.9% in FY26, buoyed by critical reforms. Inflation is also expected to decline to 7.7%, down from a peak of 10% in the current fiscal year.\nThe World Bank remains the most pessimistic among international lenders. Just a day earlier, the International Monetary Fund forecasted 6.5% growth, with inflation dropping to 5.2%. Similarly, the Asian Development Bank recently projected a 5.1% growth rate, with inflation estimated at 8%.\"",
          "votes": "30",
          "replies": [
            {
              "text": "This is Pakistan level of growth.\nAnything less than 6% for a trash bottom developing countries (BD, India, Paxtan) is tragic.\nI do agree that most of this is down to a lack of control over inflation, which has slumped consumer confidence and spending. CPD, and others have rang alarm bells even during the last government about the trajectory of BD's economy. But government never listen\nIf you're a salaryman, your wages aren't increasing, and living costs are soaring\nIf you're a business owner, fewer people are coming to your stores because they have less money in their pockets\nIf you're a criminal syndicate, than business is booming in a place like Bangladesh. For every taka of your ill-gotten gains, lies hundreds, thousands being pushed into poverty\nGone are the days of \"next Asian tiger\" optimism",
              "votes": "17",
              "replies": []
            },
            {
              "text": "As I said, most readers are uninformed and cannot distinguish a forecast from an actual number",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Podda setur taka maira montrir pocket e dhukan, gdp amni amni baira jabe",
      "votes": "21",
      "replies": []
    },
    {
      "text": "",
      "votes": "24",
      "replies": [
        {
          "text": "He's busy on a world tour right now. Maybe after he gets free from it, he will focus on making Bangladesh Singapore",
          "votes": "13",
          "replies": []
        },
        {
          "text": "What do you mean by that we are already Singapore. As per Hasina's ministers.",
          "votes": "5",
          "replies": [
            {
              "text": "Singapoor?",
              "votes": "12",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "The government should try to borrow high interest loans from any country and screw the future generation.\nThey could also think of digging up roads and destroying flyover for bad planning. And then rebuild them for instant gdp mining/ boosting.",
      "votes": "17",
      "replies": []
    },
    {
      "text": "আমাদের দেশ প্রধান তো বিভিন্ন কনফারেন্স এ গিয়ে উনাকে দ্বিপক্ষীয় সফরে দাওয়াত দিছে এম্ন ভাব নেওয়ায় ব্যস্ত।",
      "votes": "15",
      "replies": []
    },
    {
      "text": "“Egulo shob shorojontro. Amrica india r shorojontro.”",
      "votes": "2",
      "replies": []
    },
    {
      "text": "\"emon sadhinota e ki amra ceyechilam???\"\ndont take it as a sarcasm like before. now i am serious",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Shusss.... don't tell them the truth",
      "votes": "3",
      "replies": []
    },
    {
      "text": "I'm hearing from people in the know that the numbers look bad because the numbers are now true. Allegedly, the GDP numbers previously were misleading and false.\nThe example I was given is Bangladesh used to show a higher GDP by using a lower than accurate population.\nEither ways, I personally think in a short time bangladesh has improved alot. Just my two cents",
      "votes": "4",
      "replies": [
        {
          "text": "Then why there will be 3 million people falling back into poverty if economy is doing so good",
          "votes": "11",
          "replies": []
        }
      ]
    },
    {
      "text": "Well yes I agree that hasina was corrupt and an autocrat he still made our nation better than I expect from people like her . look at many African nations how they are struggling to develop",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Please stop publishing such news! Please Stop!\nI am calling all deshpremik to resist people like OP to protect our freedom of speech that we have regained after 17 years!",
      "votes": "2",
      "replies": [
        {
          "text": "এখন বইসা বইসা কথার খই ফাটান আর অইটাই খান",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "This is a forecast , not actual GDP growth. The IMF predicted 6.5% while WB forecast 3.9%\nIt is only in a years time that we will know what the actual growth in FY 2025 was\nThe World Bank remains the most pessimistic among international lenders. Just a day earlier, the International Monetary Fund forecasted 6.5% growth, with inflation dropping to 5.2%. Similarly, the Asian Development Bank recently projected a 5.1% growth rate, with inflation estimated at 8%.\nUnfortunately economically uninformed readers are taking it as actual GDP growth, and not just a prediction",
      "votes": "2",
      "replies": [
        {
          "text": "IMF has also estimated GDP growth rate for the current financial year to be 3.8% only. The current financial year ends in 3 months.\nNext year is still 15 months away, and estimates are changing every quarter.\nhttps://www.tbsnews.net/economy/bangladeshs-inflation-ease-52-gdp-grow-65-next-fiscal-year-imf-1123186",
          "votes": "5",
          "replies": [
            {
              "text": "Yes current year GDP will be lower than normal due to the disruptions last July and August",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "r/commentmitosis",
      "votes": "0",
      "replies": [
        {
          "text": "r/commentmitosis",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "Hope the \"students\" are happy now",
      "votes": "1",
      "replies": [
        {
          "text": "Our founding father Nahid islam will make it rain money inshallah Bangladesh 2.0 revolution ☪️🔥",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "BAL GDP was fake. BD has 22 crore if not more population. But they lied and kept population low to cook the numbers. A good chunk of the population is the allotment of money for development budget. We all know 70-80% of the budget was looted. This government is allocating less budget for development but near 90% will be utilized and will not be looted. End of the day true GDP right now is much higher than BAL GDP. Export is up 11%. Import is down. Remit is flowing more than ever. A huge sum of pending payments have been made resolved. Now the forex is flowing into reserve and forex reserve is growing.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "I have a math anxiety (that's because I am focused on reading ridiculously 🤣), so I never used economy when criticizing this new government but it did seem the lower price in Ramadan was just calm situation before the storm (economy 101). My main concern was how Yunus and his student gang helped social fringes like Jamaat and islamists going mainstream and liked by non-hindu people. Since the ideas of feminism, minority safety, LGBTQ is the criticism of society/baised against society, that \"inherently\" means most of the society will not like those ideas (so good reason to allow extremism). If society is unbiased/right (which it isn't), then ideas of feminism/minority safety has to be baised/wrong (which it isn't). So, I understand why society ignores disadvantaged groups but if economy is doing bad, that means I will be personally affected 🤣.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "ভালো খবর। দেশে আরও মানুষ মাইক্রো লোন নেবে। এতে আমাদের মহান নেতা আরও টাকা কামাবেন। ঠিক ঠিক!",
      "votes": "1",
      "replies": []
    },
    {
      "text": "It’s understandable for what the country went through last year and what’s happening in the world.\nBut we got cooked by Hasina so bad, it’s gonna take years to recover.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 140
}