{
  "url": "https://www.reddit.com/r/bangladesh/comments/1jt44cs/buyers_from_the_united_states_are_suspending/",
  "hash": "3f5f1b60e4d2fa23a1b1de083251eb7f",
  "scraped_at": "2025-12-08T15:36:21.617845",
  "title": "Buyers from the United States are suspending ongoing export orders",
  "description": null,
  "votes": "19",
  "comments": [
    {
      "text": "I wrote about this predicted future and stupid people with no understanding about economy and global politics started arguing. Tariff deficit or reciprocal tariff is the most stupid calculation which one can do. Global recession is underway with crashing down the markets all over the world. We don't have any leverage to negotiate. We are just a tiny piece of a puzzle.",
      "votes": "3",
      "replies": [
        {
          "text": "Consumer confidence.... Winter is coming",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Question to economists, what happens if we give in to Trump's demand ?",
      "votes": "5",
      "replies": [
        {
          "text": "Bangladesh economy crashes lol we are a poor country we got no choice",
          "votes": "11",
          "replies": [
            {
              "text": "Can you explain how that will happen in simple terms? I have no idea how trade and tariff works",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "His demand is that we buy from the US. Our economy is more broken than ever, we literally can't buy anything.",
          "votes": "2",
          "replies": []
        },
        {
          "text": "The US doesn't produce a lot ,we consume.Short cut will be reduced tax on alcohol and import them.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "এটা বায়ারদের অন্তর্বর্তীকালীন পদক্ষেপ যা বেশি দিন থাকার কথা নয়, কারণ বেশি দিন ট্রেড বন্ধ থাকা মানে নিশ্চিত বড় মন্দায় পড়ে যাওয়া যেটা উন্নত দেশের জন্য বেশি ক্ষতিকর! ট্রাম্পের ট্যারিফের মূল টার্গেট চীন, ভারত, ভিয়েতনাম, ইউরোপ আর ইস্ট এশিয়ার হাই ট্রেডিং দেশ গুলো! বাংলাদেশের জন্য যুক্তরাষ্ট্রের সাথে সমঝোতায় যাওয়া অন্য অনেক দেশের তুলনায় সহজতর, আর এটা একটা সম্ভাব্য সুযোগ‌ও বটে!",
      "votes": "0",
      "replies": [
        {
          "text": "You should join Trump's economists team with this much knowledge about economy",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 146
}