{
  "url": "https://www.reddit.com/r/bangladesh/comments/1jp5xlk/why_is_the_usd_to_bdt_exchange_rate_soaring_will/",
  "hash": "04a5678a886b94b13aa5333270bf06a5",
  "scraped_at": "2025-12-08T15:37:26.017085",
  "title": "Why Is the USD to BDT Exchange Rate Soaring & Will It Decrease Soon?",
  "description": "Why is the exchange rate between Bangladeshi Taka and the USD not decreasing, and is there any chance it will decrease? I am planning to go abroad for higher studies and need to take a loan, but due to the huge exchange rate difference, it is becoming a challenge. (Previously, it was 1 USD = 84 BDT, but now it is 121.59 BDT.)",
  "votes": "12",
  "comments": [
    {
      "text": "Its unlikely to go down ever. IMO the best that can happen is it'll stay the same for a long period of time.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Well depends, do you have Trillion dollar worth of mineral reserve? Do you have something you produce that the world needs? Tell me, why on earth would a foreigner want to hold BDT? What on earth can they buy with it?",
      "votes": "2",
      "replies": []
    },
    {
      "text": "BDT to USD exchange rate has never gone down in the history of our currency, looking back all the way from 1970. It has either gone up or stagnated, so you better get used to the new 120-ish rate, and hope it doesn't go up again any time soon.\nThe fact that we didn't experience a total economic collapse despite our currency losing 31% value against USD in the span of just 3 years is a miracle in of itself.",
      "votes": "2",
      "replies": [
        {
          "text": "Bangladeshi economy has always perplexed economists. Despite all the political shitshow and instability, dogshit infrastructure, endemic corruption, the country continues to grow and the economy has always held on and stayed stubborn.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "What you’re seeing is a healthy-ish depreciation against the dollar. If there are sudden spike in depreciation, then that is a problem, for example, after the Russian invasion of Ukraine in 2022.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 150
}