{
  "url": "https://www.reddit.com/r/bangladesh/comments/1jh6gem/%E0%A6%95%E0%A6%B0%E0%A6%96%E0%A6%A8_%E0%A6%AC%E0%A6%A8%E0%A6%A7_%E0%A6%9A%E0%A6%95%E0%A6%B0_%E0%A6%B9%E0%A6%B0%E0%A6%A8_%E0%A6%B6%E0%A6%B0%E0%A6%AE%E0%A6%95%E0%A6%A6%E0%A6%B0_%E0%A6%88%E0%A6%A6_%E0%A6%86%E0%A6%A8%E0%A6%A8%E0%A6%A6_%E0%A6%AC%E0%A6%B2%E0%A6%A4_%E0%A6%95%E0%A6%9B_%E0%A6%A8%E0%A6%87/",
  "hash": "eea077d3a419144127b6ea6a94604852",
  "scraped_at": "2025-12-08T15:38:46.075011",
  "title": "কারখানা বন্ধ: চাকরি হারানো শ্রমিকদের ঈদ আনন্দ বলতে কিছু নেই",
  "description": "গত বছরের রাজনৈতিক পটপরিবর্তনের ফলে কারখানা বন্ধ এবং ছাঁটাইয়ের কারণে চাকরি হারিয়েছেন এমন শ্রমিকের ঈদ আনন্দ এবার ম্লান হয়ে গেছে।\nট্রেড ইউনিয়নগুলোর মতে, গত সাড়ে সাত মাসে প্রায় ১ লাখ শ্রমিক চাকরি হারিয়েছেন, যাদের বেশিরভাগই পোশাক ও টেক্সটাইল খাতের।\nSource https://bangla.thedailystar.net/news/bangladesh/news-660546",
  "votes": "22",
  "comments": [
    {
      "text": "কিন্তু আলু পেঁয়াজের দাম তো কম",
      "votes": "18",
      "replies": [
        {
          "text": "Economics 101:\nWhen demand decreases but production doesn’t fall due to mismatch in market expectations between participants, price falls.\nThis usually happens during early stage of a crash of the market where there is a large barrier on the flow of information.\nProducers expected similar or more demand. However, for whatever the reasons, demand crashes leading to fall in price.\nMarket economics 101!",
          "votes": "3",
          "replies": [
            {
              "text": "True, but there is also elasticity of demand. If there is deflation, the demand for underwear or shoes should decrease more aggressively compared to the price of onions and potatoes. The price will remain the same or slightly increase for those goods.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "First Hindus, then women and now workers. It's like the plot of final destination sequel where everything is going backwards.",
      "votes": "14",
      "replies": []
    },
    {
      "text": "\"আমরা স্বাধীন, মুক্ত। গড়ব মোদের বাংলা, রাখব বিশ্বাস সমন্বয়কের উপর\" - Gen-Z.",
      "votes": "10",
      "replies": []
    },
    {
      "text": "",
      "votes": "-8",
      "replies": [
        {
          "text": "Jalil shedin ei kothai boltesilo. Ekhane to Beximco ase dekhi. Loan default ekhon factory bondho kore dise.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "মিথ্যাচার করে লাভ আছে? রফতানি বাড়ছে কিভাবে?",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 155
}