{
  "url": "https://www.reddit.com/r/bangladesh/comments/1je80qj/bangladesh_once_the_worlds_3rd_largest_rice/",
  "hash": "8befb5581fbacf1aeae2b617e82b698b",
  "scraped_at": "2025-12-08T15:39:19.288971",
  "title": "Bangladesh, Once the World’s 3rd Largest Rice Producer, Now an Importer - BDDiGEST",
  "description": null,
  "votes": "17",
  "comments": [
    {
      "text": "karon khub simple. indurer baccar moto bacca poyda korle etogula manusher thakar jayga koi?\nar abadi jomi nosto kore ghor bari tulle dhan ki akash theke porbe??",
      "votes": "12",
      "replies": [
        {
          "text": "They say produce more kids, God will provide",
          "votes": "11",
          "replies": []
        },
        {
          "text": "Stop whining bro. Fertility rate in BD is already below 2 children per woman. Demographic crisis like East Asian countries are going to hit us hard within a few decades. Instead of bickering about currently non-existent high birth rate we should rather focus how to solve the future demographic crisis. Since unlike those East Asian countries we aren’t so industrialised.",
          "votes": "4",
          "replies": []
        },
        {
          "text": "Gorib ra beshi bacha poyda kore noshto korche desh ke eto bacha ke thik moto lalon poshon kora jayna boro hoye dakat baje Manush hoye uther othoba bekar",
          "votes": "2",
          "replies": []
        },
        {
          "text": "Bangladesh's fertility rate is below the world average. It's lower than countries like India, Kuwait, Israel, Argentina, Oman, Peru etc.",
          "votes": "0",
          "replies": [
            {
              "text": "This fertility rate is a lie. BAL intentionally showed false low rate.",
              "votes": "0",
              "replies": []
            }
          ]
        },
        {
          "text": "Aro karon ase. Dokkhin Purbanchole chasabad onek kome gese. Beshir vag middle east e gia ekhon ar agriculture e agroho nai. 20 bosor ageo amder 40-50 mon dhan hoito. Ekhon kaj korar lok paoa jay na.",
          "votes": "0",
          "replies": [
            {
              "text": "Farming is hard ... working 12 hour shifts in middle east yields more dollar",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "No the karon is, you're dumb. I know I'm being mean, but I think you should just accept it, or acknowledge that you've read the title wrongly. Nowhere in it says that Bangladesh once used to export rice and now we're being forced to import it. Because I'm fairly certain we were never self-sufficient in terms of rice and other grains like crops, we always had to and still have to import a huge amount of wheat, rice, each year. Maybe things were different during 1700s, but after that? I doubt it.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Allah dibe 😒",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Bangladesh still is third largest in producing rice\nProducer≠Exporter, in case some people are weak in English. Misleading title, or at least people are just being dumb and taking the title wrongly, with the tone of ' Age ki sundor din katai tam'. Lol, with people like these no wonder misinformation can spread like wildfire. Hilarious. Don't people even know the difference between producer and exporter?",
      "votes": "1",
      "replies": [
        {
          "text": "Wait, do people not know that despite producing huge amount of rice it's never been enough and we've always needed to import rice, wheat, and other food stuffs?...",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 157
}