{
  "url": "https://www.reddit.com/r/bangladesh/comments/1iyv33g/a_fairer_economic_system_for_bangladesh/",
  "hash": "8668ddaa019274c7902112f4e8a43f3c",
  "scraped_at": "2025-12-08T15:42:14.641721",
  "title": "A fairer economic system for Bangladesh",
  "description": "I have been thinking about this system for a while and I jot down some points, give me your opinions. Here they are:\nInstead of relying on high-interest loans that trap individuals and businesses in perpetual debt, we establish profit-sharing partnerships where investors and entrepreneurs share risks and rewards. This creates a system that encourages real economic activity rather than speculative gains.\nExcess wealth shouldn’t sit idle in a few hands while the majority struggle. A structured redistribution mechanism could ensure that wealth flows back into society, funding welfare programs, public infrastructure, and small businesses rather than being hoarded.\nThe economy should be built on industries that benefit society, not those that thrive on human vice (e.g., exploitative banking, gambling, monopolies). Policies should favor businesses that create real value and contribute positively to communities.\nA mandatory, structured charitable contribution from the wealthy to support the poor could reduce extreme poverty without creating dependency. Instead of arbitrary taxation, this could be a fixed percentage of surplus wealth, ensuring those in need always receive support.\nInstead of an economy that favors stock market manipulation, currency speculation, and artificial inflation, we should focus on real assets, productive industries, and direct trade that benefits everyone.",
  "votes": "2",
  "comments": [
    {
      "text": "You just explained public limited companies.\nHow?\nGreat idea. Bangladesh has one of the highest potential for these but politicians don't want these, these will stop them from stealing.\nYou just explained zakat.\nThe artificial inflation part is wrong. we need it.",
      "votes": "1",
      "replies": [
        {
          "text": "Public limited companies aren’t the same thing. They thrive on speculation, interest-based debt, and short-term profits, which cause financial instability. The system I’m proposing isn’t about buying and selling stock for quick gains—it's about creating real, sustainable wealth through shared risk and reward. Instead of playing with numbers on paper, this approach ensures that investments drive actual growth and benefit the economy in the long run. So no, it’s not \"just public limited companies,\" it’s a complete shift towards a fairer, more stable financial ecosystem.\n2.Wealth circulates when excess money isn’t hoarded but reinvested into businesses, infrastructure, and social programs. A structured system could require surplus wealth holders to reinvest or redistribute a fixed portion annually, ensuring continuous economic activity.\n3.Exactly. A system like this naturally limits corruption because it decentralizes financial power and prevents monopolies from forming. Politicians and the elite benefit from the current system, where they can manipulate markets and exploit debt-based financing. Changing the structure would reduce their ability to extract wealth unfairly.\n4.Wealth redistribution isn’t a new concept—it exists in different forms across various economic models. For example, some Scandinavian countries impose high progressive taxes on the wealthy to fund social programs. Similarly, in a structured system, a fixed percentage of surplus wealth could be directed toward poverty alleviation, healthcare, and education, ensuring that wealth isn’t hoarded indefinitely. The key difference is that instead of arbitrary or ever-changing tax rates, this system would ensure a fair and predictable redistribution mechanism that benefits society without discouraging productivity.\n5.Some inflation is natural and even necessary, but artificial inflation—caused by speculative trading, excessive money printing, and interest-driven financial bubbles—hurts the average person. A stable economy should focus on productive growth rather than artificial price hikes that benefit only the elite.\n*Sorry The reply is a bit big, But I thought I need to clear my thoughts fully*",
          "votes": "1",
          "replies": [
            {
              "text": "You did explain public limited companies. Every listed company in stock exchange is a public limited company but not all public limited companies are listed in stock exchange.\nThe question remains, how? It is one of the biggest problem contries like india are looking answer for.\nIt will discourage productivity for sure. Why would i work hard to build my wealth just to see it get redistributed to someone else?",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "So how can you build those wealth in Bangladesh? Bangladesh has no resources for it's over population and no one interested in building products base economy in Bangladesh no foreign investors come here so how do you incentives those big player to come here and build economy? The real problem in Bangladesh is  no one interested in building huge wealth in Bangladesh so then we could use it for development of our country",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 168
}