{
  "url": "https://www.reddit.com/r/bangladesh/comments/1imvft3/does_the_significant_reduction_in_balance_of/",
  "hash": "dcb935ad66fdd23f3e949080d2ba7e0a",
  "scraped_at": "2025-12-08T15:43:34.469013",
  "title": "Does the significant reduction in balance of payment deficit indicate economy has started to recover?",
  "description": "As you can see from the article, our balance of payment deficit has reduced by 89%. What do you think has contributed to this? And what did the interim government do to achieve this?",
  "votes": "1",
  "comments": [
    {
      "text": "Depends on where the reduction in import is happening. If it's in raw materials and capital machinery, then It's a bad sign. If it's done through an increase in export or reduction in consumer goods, then it's a good sign.",
      "votes": "5",
      "replies": [
        {
          "text": "Import actually increased by 3.5%. But export and remittance inflow increased even further hence the reduction in deficit.\nBut one concern is the reduction in capital machinery based import due to the overall unrest in the last 6 months. This urgently needs to be taken care of.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Bs. Mostly raw materials reduction as yunus targets all industries that support league leading to huge unemployment and dark incoming days",
      "votes": "5",
      "replies": [
        {
          "text": "I have seen your other posts man. I will take your opinion with a grain of salt.",
          "votes": "1",
          "replies": []
        },
        {
          "text": "Factually incorrect. Atleast read the article before commenting. Overall import increased as per the article. Dont make urself a laughing stock man.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "People ... read up about over invoicing and under invoicing. These strategies were followed to move dollar out of Bangladesh. Now 90% of it has been stopped.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "It's quote possible a lot of those import orders were fake to loot more money from our country's coffer. Once the previous regime ran away, there were no new fake tenders.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 173
}