{
  "url": "https://www.reddit.com/r/bangladesh/comments/1i8uhrh/economy_slowing_negative_revenue_growth_shows_the/",
  "hash": "306ca7447a399170b95acf53442f6f01",
  "scraped_at": "2025-12-08T15:45:59.250577",
  "title": "Economy slowing, negative revenue growth shows the sign | The Daily Star",
  "description": null,
  "votes": "24",
  "comments": [
    {
      "text": "How many economist will it take to fix the economy now? 🤔",
      "votes": "13",
      "replies": [
        {
          "text": "Just hire the Spiffing Brit and he will find an exploit to fix our economy 🤑🤑",
          "votes": "6",
          "replies": [
            {
              "text": "Just hire the Spiffing Brit\nHate your flair, but man of culture I see.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "but saar Yusuf saab iz Nobel economics prize winnar",
      "votes": "12",
      "replies": [
        {
          "text": "Sir only knows how do the economics for the poor people but no problem he make us all poor then problem solved",
          "votes": "8",
          "replies": []
        }
      ]
    },
    {
      "text": "Banker to the poor needs poor people to keep existing so that he can still be banker to the poor.",
      "votes": "11",
      "replies": [
        {
          "text": "that’s an interesting way to look at it. it makes me think about the NGOs.",
          "votes": "2",
          "replies": []
        },
        {
          "text": "If he wasn’t qualified to run the country before he sure will be soon!",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "Fack",
      "votes": "3",
      "replies": []
    },
    {
      "text": "We don't need revenue stats anymore now. Clearly stopping laundering and it's stats are far more important. The Fascist BAL regime was headily corrupted, and also accused of laundering at skyrocket rate",
      "votes": "-3",
      "replies": [
        {
          "text": "Schrödinger’s economy! If we don’t look at the facts and figures we can’t really know how fucked we are. I love it. Have you considered running for minister of finance!?\nAlso if it wasn’t obvious this is sarcasm. You’re an idiot.",
          "votes": "7",
          "replies": [
            {
              "text": "Idk where you live or the level of your knowledge about the global market. Even if you had worked for any USA or European companies, you would've known this.\nDue to political unrest, the revenue growth was hampered in H2 of 2024 or Q2 and Q3 of 2024.\nEconomy usually rises in the beginning of every Q2 or at the end of Q1 every year.\nStudy more before you speak",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "-7",
      "replies": [
        {
          "text": "Source? What’s the time scale of these figures? If it’s up 18% from last month but still 50% down from last year it doesn’t really look good does it.",
          "votes": "5",
          "replies": []
        },
        {
          "text": "Nah pochattur means 75. Guess what happened in 1975? Based on his threads it's quite clear he's a jamat shibir supporter",
          "votes": "9",
          "replies": [
            {
              "text": "Nah pochattur means 75. Guess what happened in 1975? Based on his threads it's quite clear he's a jamat shibir supporter",
              "votes": "2",
              "replies": []
            },
            {
              "text": "",
              "votes": "-7",
              "replies": []
            },
            {
              "text": "Tell that to people who think Bangladesh is blessed and rich with resources.",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "Source?",
          "votes": "2",
          "replies": [
            {
              "text": "trust him bro",
              "votes": "4",
              "replies": []
            },
            {
              "text": "",
              "votes": "-3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Don’t recall when was the last time BD had a recession. Unfortunately it may be a tough pill to swallow but a recession is needed to bring down inflation.",
      "votes": "-2",
      "replies": [
        {
          "text": "Are you actually retarded? A recession to fix inflation? That’s like burning your houses down to bring down house prices. Bangladesh needs smart policies, not economic collapse.",
          "votes": "6",
          "replies": []
        }
      ]
    }
  ],
  "id": 182
}