{
  "url": "https://www.reddit.com/r/bangladesh/comments/1i4dax3/interim_govt_not_taking_action_following_white/",
  "hash": "f3196653c3b0825dad2c64a603577df9",
  "scraped_at": "2025-12-08T15:47:06.871073",
  "title": "Interim govt not taking action following white paper: Economists | The Daily Star",
  "description": null,
  "votes": "15",
  "comments": [
    {
      "text": "No strategy has been proposed for individuals with tax identification numbers (TINs) who fail to pay taxes.\nInterim gov needs to crack down on these types of scumbags first, lots of rich corrupt people/businesses probably takes advantage of this",
      "votes": "4",
      "replies": [
        {
          "text": "Bank forced our peon/office assistant to get a tin number for opening an account. He gets a salary of 11k. Would he need to pay tax as well?",
          "votes": "1",
          "replies": [
            {
              "text": "Yes?",
              "votes": "1",
              "replies": []
            },
            {
              "text": "It's a misconception that having a TIN number means you have to pay tax. Tax is calculated based on brackets. Your office assistant won't have to pay any tax since their yearly income seems well below the minimum threshold for taxes. He might need to file tax returns though.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Ami bhai aye sorkar chai nai, BAL der hataya amon sorkar chaisilam jara onek proactive hobe. Tader jonnoi Aye BAL er neta and magi khuni hasina er ato besi barse.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "\"BuT bUt AfSoS lEaGuE 15 bOcHoR DhOrE oNeK dUrNiTi kOrSe Ar YuSuF sHoRkArKe ArO sHoMoY dItE hObE.\"",
      "votes": "3",
      "replies": [
        {
          "text": "Had to ss 😭😭😂",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "They only take useless actions",
      "votes": "3",
      "replies": []
    },
    {
      "text": "No surprises there. It will be news if the interim government takes action. Not regarding white paper, but virtually anything.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 186
}