{
  "url": "https://www.reddit.com/r/bangladesh/comments/1hyp9zk/%E0%A7%A9%E0%A7%A6_%E0%A6%9F%E0%A6%95%E0%A6%B0_%E0%A6%97%E0%A6%AF%E0%A6%B8_%E0%A7%AD%E0%A7%AB_%E0%A6%9F%E0%A6%95%E0%A7%9F_%E0%A6%AC%E0%A6%95%E0%A6%B0_%E0%A6%95%E0%A6%B0%E0%A6%A4_%E0%A6%9A%E0%A7%9F_%E0%A6%AA%E0%A6%9F%E0%A6%B0%E0%A6%AC%E0%A6%B2/",
  "hash": "60b7279ad2fc08815309782bf21a272c",
  "scraped_at": "2025-12-08T15:48:42.243329",
  "title": "৩০ টাকার গ্যাস ৭৫ টাকায় বিক্রি করতে চায় পেট্রোবাংলা",
  "description": "৩০ টাকার গ্যাস ৭৫ টাকায় বিক্রি করতে চায় পেট্রোবাংলা। এ নিয়ে উদ্বিগ্ন শিল্পোদ্যোক্তারা। তাদের মতে, এই মুহুর্তে গ্যাসের দাম বাড়ালে গভীর সংকটের মুখোমুখি হবে শিল্প খাত। অন্তর্বর্তী সরকারকে এমন সিদ্ধান্ত থেকে দূরে থাকার পরামর্শ বিশেষজ্ঞদের\nবর্তমানে ব্যবহৃত গ্যাসের ছয় ভাগের একভাগ যায় শিল্পখাতে। অন্যদিকে, সরবরাহের প্রায় ২৫ শতাংশই হয়ে পড়েছে আমদানিনির্ভর। বছরখানেক ধরেই যা কিনতে হচ্ছে প্রতি ইউনিট গড়ে ৭৫ টাকায়। মূলত, এই দামের পুরোটাই নতুন শিল্পের ওপর চাপাতে চায় পেট্রোবাংলা। বিশ্লেষকরা মনে করছেন, সংকটের এই সময়ে, এমন সিদ্ধান্তে প্রতিযোগিতা সক্ষমতা হারাবেন উদ্যোক্তারা।\nবর্তমানে চাহিদার তুলনায় গ্যাস সরবরাহে ঘাটতি প্রায় ১৩০ কোটি ঘনফুট।\nReferences link:\nhttps://www.channel24bd.tv/economy/article/247730/৩০-টাকার-গ্যাস-৭৫-টাকা-করতে-চায়-পেট্রোবাংলা-উদ্বিগ্ন-শিল্পোদ্যোক্তারা",
  "votes": "10",
  "comments": [
    {
      "text": "The governmennt is most likely doing that because it is one of the conditions pf getting that IMF loan.",
      "votes": "3",
      "replies": [
        {
          "text": "নতুন কিছু বলেন, ভাই। আমাগো পিছনে লাথি না দিয়ে কিছু করেন। যেমন ধরেন সুদখোরের ব্যাংক ব্যালান্স সিজ করেন। হারজিত কত টাকা মারলো, তা বাইরে আনেন। পুরানো ডাকাতের টাকা দেশে আনেন। ভাই… আমরা ক্লান্ত।\nইউনূস। ইউনূস। আমাগো তো একদম সম্পূর্ণ বোল্ড আউট করে দিলো।\nদেশ বনাম সমন্বয়ক/ইউনূস/রাজাকার আর কতদিন?",
          "votes": "3",
          "replies": [
            {
              "text": "Ho vai Sarjis pura desh khali kore felse. Sheikh Hasina onek valo. IMF er loan o nise Yunus. China te 5 billion vikkha chaisilo shetao Yunus. S Alam, Summit, Beximco re dia bank sector 1500000+ Koti takar loan default o korse Yunus. Benjir, Saifuddin, Matiur ra hazar kotir o beshi tk marar helper o silo Yunus. 2023 e gas er dam baraya supply dey nai Yunus. She 2024 er shurute dui dofa electricityr dma o baraisilo.\n15 bosor hasinar ta shojjo korse, Yunus er ta ontoto 1 bosor shojjo koren.",
              "votes": "2",
              "replies": []
            },
            {
              "text": "আমাদের এই এলএনজি এর উপর আমাদের এই নির্ভরতার জন্য দায়ী কে? ইউনূস? আপনার প্রিয় আওয়ামী লীগ সরকার যে জ্বালানি খাত সামিট মাফিয়াদের হাতে বিক্রি করে দিয়ে পালায় গেলগা এর হিসাব আপনি চুকাবেন না তো কে চুকাবে। আইএমএফ এর লোন কি ইউনূস নিছে? বাল সরকার জানতো না শর্ত কি? এখন আইছেন ঘ্যান ঘ্যাণ করতে।",
              "votes": "2",
              "replies": []
            },
            {
              "text": "It is said that the IMF loan is a medicine that is worse than the disease. Ask yourself who decided to take this medicine and who is responsible for this disease.",
              "votes": "1",
              "replies": []
            },
            {
              "text": "",
              "votes": "-1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "all credit goes muffin muhammad yunus",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": [
        {
          "text": "",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 192
}