{
  "url": "https://www.reddit.com/r/bangladesh/comments/1hxg48q/%E0%A6%9D%E0%A6%AA_%E0%A6%AC%E0%A6%9D_%E0%A6%95%E0%A6%AA_%E0%A6%AE%E0%A6%B0%E0%A6%9B%E0%A6%A8_%E0%A6%AC%E0%A6%AF%E0%A6%AC%E0%A6%B8%E0%A7%9F%E0%A6%B0/",
  "hash": "2d4b6f6777a6855629381a07574a2b58",
  "scraped_at": "2025-12-08T15:49:14.479121",
  "title": "ঝোপ বুঝে কোপ মারছেন ব্যবসায়ীরা",
  "description": "বিস্তারিত নিউজ\nদেশের বাজারে আবারও বাড়ছে সয়াবিন তেলের দাম। গত এক সপ্তাহ ধরে দাম বেড়েই চলেছে। মুদি দোকানিরা বলছেন, তারা সরবরাহকারী প্রতিষ্ঠানগুলো থেকে পর্যাপ্ত তেল পাচ্ছেন না। এ দিকে, খুচরা বাজারে সরবরাহ ঘাটতির প্রেক্ষাপটে সয়াবিন ও পাম তেল শোধনাগার প্রতিষ্ঠানগুলো সরকারের কাছে দাম পর্যালোচনার প্রস্তাব দিয়েছে। এর আগে সর্বশেষ গত ৯ ডিসেম্বর ভোজ্যতেলের দাম বাড়ানো হয়।\nবাণিজ্য মন্ত্রণালয়ের আওতাধীন ট্রেডিং করপোরেশন অব বাংলাদেশের (টিসিবি) তথ্য বলছে, গত এক সপ্তাহে বোতলজাত সয়াবিন তেলের দাম প্রতি লিটারে ৪৬ শতাংশ বেড়েছে।\nএক লিটার বোতলের পাম তেলের দাম বেড়েছে শূন্য দশমিক ৩১ শতাংশ।\nগতকাল বুধবার বোতলজাত সয়াবিন তেল বিক্রি হয়েছে ১৭৩ থেকে ১৭৫ টাকায়। এক সপ্তাহ আগে ছিল ১৬৮ টাকা। প্রতি লিটার পাম তেল বিক্রি হয়েছে ১৬২ টাকায়। এক সপ্তাহ আগে ছিল ১৫৯ টাকা।\nগত ৬ জানুয়ারি বিশ্ববাজারের সঙ্গে সামঞ্জস্য রেখে সয়াবিন ও পাম তেলের দাম সমন্বয়ের জন্য বাণিজ্য মন্ত্রণালয়কে অনুরোধ করে বাংলাদেশ ভেজিটেবল অয়েল রিফাইনার্স অ্যান্ড বনস্পতি ম্যানুফ্যাকচারার্স অ্যাসোসিয়েশন।\nগত মাসে বাণিজ্য মন্ত্রণালয়ের সঙ্গে বৈঠকের সিদ্ধান্ত অনুযায়ী ভোজ্যতেলের দাম সমন্বয়ের প্রস্তাব জমা দেওয়া হয়েছে বলেও সংগঠনটির পক্ষ থেকে জানানো হয়।\nবিশ্ববাজারে অপরিশোধিত সয়াবিন ও পাম তেলের দাম বিশ্লেষণ করে অভ্যন্তরীণ বাজারে দাম সমন্বয় করা প্রয়োজন বলে চিঠিতে উল্লেখ করা হয়েছে।",
  "votes": "13",
  "comments": [
    {
      "text": "সোসালিস্ট দের উচিৎ প্রতিটী জেলায় একটা করে চেইন সুপারমারকেট খোলা, যেমন কার্ল মার্ক্স জায়ান্ট শপ। যেখানে কম দামে তেল পাওয়া যাবে। যেমন অন্য দোকানে যদি ১০০ টাকায় পাওয়া যায়, কার্ল মার্ক্স জায়ান্ট শপে পাওয়া যাবে ৮০ টাকায়। মানুষ তখন একটু হেটে হলেও কার্ল মার্ক্স জায়ান্ট শপে গিয়ে বাজার করবে, আর যাদের মেদ বেশি পয়সা ওয়ালা তারা ১০০ টাকাতেই পাশের মুদির দোকান থেকে কিনে নিবে। কিন্তু বাংলাদেশের গরীব সোসালিস্ট রা কি পারবে এমন জায়ান্ট শপ খুলতে?",
      "votes": "1",
      "replies": [
        {
          "text": "আমার মনে হয় এর বদলে সরকারি ট্রাকে করে কম দামে পণ্য বিক্রির একটা সিস্টেম চালু আছে। সরকারকে বাদ দিয়ে বামেরা এসব করতে পারবে সহজে তাও শিওর না।",
          "votes": "3",
          "replies": []
        },
        {
          "text": "TCB ke ekta super shop chain hishebe establish korte hobe. desher Proti ti bazar ey TCB er ekta outlet thakbe. TCB desher 20% khaddo ponno procure kore sell korbe. TCB hobe bazar er Price Maker jar selling price er uppor bhitti kore private seller ra er ash pasher damei jinish bikri korbe.\nsubsidy diye Product procurement price er niche bikri korle private retailer ra loss korbe aar er fole supply kome jabe aar market failure hobe. Tai khaddo ponno guli subsidize na kore procurement cost er theke ekta moderate 25% profit ey bikri korte hobe. Tahole private seller ra ekta satisfactory profit earn korte parbe abar otirikto laabh er ashay daam hu hu kore barabeo na as it will more than the market price set by TCB.\nShorkari bhabe arbitrarily daam nirdharon kore othobo chotto porishore subsidized good bikri korar theke eirokom একটা comprehensive market based system will be more sustainable and effective to keep inflation low and food prices affordable. But ke jaane bus malik ra jeibhabe BRTC ke shob route ey cholte deina, sheibhabe paikari bebshayi rao TCB ke er scope barate dibena.",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "হায়রে বাংলাদেশ",
      "votes": "1",
      "replies": []
    },
    {
      "text": "সয়াবিন আমদানি কমিয়ে দেশের সরিষা উৎপাদন বাড়ানো দরকার। আমাদের দাদা-দাদীরা সরিষার তেল খেয়ে মেখেও এতো অসুস্থ হতো না অথচ এমন এক জুজুর ভয় দেখাইলো এখন সয়াবিন খেয়ে ঘরে ঘরে হৃদরোগ আর স্থুলতা। এর পেছনে আবার বিলিয়ন ডলারের ফার্মা ইন্ডাস্ট্রি।",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 194
}