{
  "url": "https://www.reddit.com/r/bangladesh/comments/1hx7ap3/%E0%A6%B8%E0%A6%B8%E0%A6%A4%E0%A7%9F_%E0%A6%97%E0%A6%B0%E0%A6%B0_%E0%A6%AE%E0%A6%B8_%E0%A6%B0%E0%A6%AA%E0%A6%A4%E0%A6%A8_%E0%A6%95%E0%A6%B0%E0%A6%A4_%E0%A6%9A%E0%A7%9F%E0%A6%9B%E0%A6%B2_%E0%A6%AC%E0%A6%B0%E0%A6%9C%E0%A6%B2_%E0%A6%A8_%E0%A6%86%E0%A6%B8%E0%A6%B0_%E0%A6%95%E0%A6%B0%E0%A6%A3_%E0%A6%9C%E0%A6%A8%E0%A6%B2%E0%A6%A8/",
  "hash": "d1caa0d3a0a4b8e57fdf99b3f7ea1e71",
  "scraped_at": "2025-12-08T15:49:31.666492",
  "title": "সস্তায় গরুর মাংস রপ্তানি করতে চেয়েছিল ব্রাজিল, না আসার কারণ জানালেন রাষ্ট্রদূত",
  "description": null,
  "votes": "17",
  "comments": [
    {
      "text": "দেশি বাটপারদের আপত্তিতেই এসব হচ্ছে। ভালোই। এগিয়ে যাও।",
      "votes": "9",
      "replies": []
    },
    {
      "text": "পার্শ্ববর্তী একটি দেশের রপ্তানী বাজার ও খোটা বাজারে ভাটা পরত, এই কারনেই হয়নি। নাহলে কোথায় গরুর মাংস বেচত, আর কাদের কাংগাল বলে খোটা দিত।",
      "votes": "9",
      "replies": [
        {
          "text": "বাংলাদেশে নন-মুসলিম দেশগুলো থেকে গরুর মাংস কেনায় আওয়ামী লীগ নিষেধাজ্ঞা দিয়েছিল হেফাজতে ইসলামের কারণে https://www.thedailystar.net/business/news/govt-wont-allow-import-beef-3478396",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "How is it cheap?\nSelling cost + other costs (which this educated brazllian fails to mention) more than current market price !!!\nIn a free market, irrespective of who is in power, profit will drive towards the cheapest production.\nIn this case, due to distance and transportation costs, it isn’t cheap.",
      "votes": "4",
      "replies": [
        {
          "text": "Shipping cost by sea is most often negligible.",
          "votes": "4",
          "replies": [
            {
              "text": "It’s not only shipping. And it’s not negligible especially coming from South America. If it was, our geeedy Bangla assholes would have bought way more things from there.\nDon’t get me started on Foot and Mouth disease (though I doubt it will do anything to already dumb people like us), use of antibiotics and hormones, long distance transportation would have to be done carefully cause things like harmful bacteria would sneak in , standards? (Halal??), chemical contamination (pesticides etc),\nDude… it is not easy peasey to change especially for such a “non-corrupt” country like Bangladesh",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "bro really believes in the free market 🤣",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "besh onek islamist rao etar against e bolchilo tokhon. As brazil beef halal hobe kina eta niye genjam hocchilo",
      "votes": "3",
      "replies": []
    },
    {
      "text": "So basically bad bureaucracy is reason why they can't get certificates and couldn't sell beefs. Damn",
      "votes": "3",
      "replies": [
        {
          "text": "bureaucratic hiccup = ghoosh dey nai",
          "votes": "5",
          "replies": []
        }
      ]
    }
  ],
  "id": 195
}