{
  "url": "https://www.reddit.com/r/bangladesh/comments/1huvja2/bangladeshs_economy_slows_sharply_to_181_in/",
  "hash": "53e40629de62adfb0d31b8dee890f5d4",
  "scraped_at": "2025-12-08T15:50:04.769304",
  "title": "Bangladesh’s economy slows sharply to 1.81% in turbulent first quarter | The Daily Star",
  "description": null,
  "votes": "43",
  "comments": [
    {
      "text": "First quarter is July-Sep so its completely understandable. Its the Q-2 data that will be more important.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Export up 18%, Remit up 22%, Import down 8%\nWe are on the right track. After a year it will all settle. Just like the price of food products.",
      "votes": "20",
      "replies": [
        {
          "text": "Economic activity diye GDP hoy. Amount of goods and services that the country produces. Not the amount of cash. If industries are closing and less investment are happening. If for security situation, people are buying, eating out,etc less. Economy will shrink.",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "Yes first quarter of 3 months involve July to September - the first half was just mass murder by BAL, internet shutoff and their cronies like S Alam taking rest of their money out with remittance blockade. I am surprised that we had some gdp improvement in that quarter.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "We must hold elections quick",
      "votes": "4",
      "replies": [
        {
          "text": "I agree but it just sucks because of how much was promised to us with reforms and all that! Some has been made, sure, but this government isn't powerful enough and they cannot continue too long, otherwise, our economy will shit the bed, and that would be worse than not having any reform. :sigh:",
          "votes": "13",
          "replies": [
            {
              "text": "pretty much every economic indicator is doing well except inflation which is also said to decrease in a few months.",
              "votes": "3",
              "replies": []
            },
            {
              "text": "Can you elaborate? \"our economy will shit the bed\". My notion is that the government handled the economy far better. Though I have some observations but I dont think we will not face much due to internal reason.",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "play stupid games. win stupid prizes.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "ফেইক ৬% এর থেকে সলিড ২%ও অনেক ভালো! অর্থনৈতিক সুশাসন প্রতিষ্ঠিত হলে দেশি-বিদেশি ইনভেস্টমেন্ট এমনিতেই বেড়ে যাবে!",
      "votes": "2",
      "replies": [
        {
          "text": "if gdp could be cooked like that then every country would have reported double digit gdp growth.\nBrother, don't dwell on denials. Perhaps, our economy may eventually recover but claiming AL bribed WB and IMF to report 6% growth is ridiculous",
          "votes": "17",
          "replies": [
            {
              "text": "Funny talks! তৃতীয় বিশ্বের দেশগুলোতে জিডিপি ইনফ্লেটেড করাটা নতুন কিছু না! গত একযুগ ধরে ইনফ্লেটেড এক্সপোর্ট-ইমপোর্ট, ইনফ্লেটেড প্রাইভেট ইনভেস্টমেন্ট, ডিফ্লেটেড ইনফ্লেশনকে ব্যবহার করে জিডিপি বাড়ায়া দেখানোর অপচেষ্টা হ‌ইছে! ফলে ইনফ্লেশন নিয়ন্ত্রণের জন্য কার্যকরী তেমন কোন পদক্ষেপ নেয়া হয় নাই! আন্তর্জাতিক রেকর্ড করার মতো বৈদেশিক মুদ্রা পাচার করা হ‌ইছে অথচ এর কোন প্রভাব অর্থনীতিতে পড়বে না এটা শুধু BALর লুটেরাদের পক্ষেই চিন্তা করা সম্ভব!",
              "votes": "0",
              "replies": []
            },
            {
              "text": "WO WO WO Are you saying BAL GDP was real??\nI will mention a few words to give you some clue, you can do some research and math, in case you have some brain left.\nBangladesh Population: Total number of Mobile SIM card\nBangladesh's total Export Number for the year 2022-23 (Clue 1 lac cror)\nBangladesh's total Govt Revenue Number (again Clue 1 lac cror)\nBangladesh's total foreign reserve?\n....",
              "votes": "-3",
              "replies": []
            }
          ]
        },
        {
          "text": "Age ki ashto investment? Na karon Bangladesh geographically ekta pocha desh poribesh noshto beshi jonoshonkha kewo thakte chaina shot holewo kewo investment korte chaina kinto ekhon usar nojor porce ei nojor ta use korte hobe ar 6 percentage fake chilona tahole imf bank fake shob kisu bole",
          "votes": "7",
          "replies": [
            {
              "text": "ইনভেস্টমেন্ট সব সময়ই আসতো, কিন্তু কম, এর কারণ ক্ষমতাসীন ও তাদের মাফিয়া গোষ্ঠী! কঠিন সব সমস্যা থাকলেও উপর সমাধানের চেষ্টা করলে সমস্যাগুলো কমে আসার কথা!\nআন্তর্জাতিক সংস্থাগুলো মূলত পরিসংখ্যান ব্যুরোর তথ্যের উপর নির্ভরশীল, সো তাদের পক্ষেও প্রবৃদ্ধির প্রকৃত অবস্থা জানানোর সুযোগ তেমন নাই! বছরের পর বছর ইনফ্লেটেড দেখানোর ফলে জীবন যাত্রার সাথে প্রবৃদ্ধির তেমন কোন মিল পাওয়া যাচ্ছিল না দেখেই আরো কয়েক বছর আগে থেকেই দেশি-বিদেশি সংস্থা গুলো পরিসংখ্যান ব্যুরোর তথ্যের ব্যপারে সন্দেহ প্রকাশ করে আসছে!",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "1.81% bhaiya. Economy te 0.19% onek matter kore",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "From 6.4% to merely 2% - good",
      "votes": "-1",
      "replies": [
        {
          "text": "Misreported 6.4% btw. Awami League was cooking the numbers.",
          "votes": "-4",
          "replies": [
            {
              "text": "And World Bank, Transparency International was also 'সৈরাচারের দোসর' too",
              "votes": "13",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "-16",
      "replies": [
        {
          "text": "\"elected\"",
          "votes": "11",
          "replies": []
        },
        {
          "text": "What's up with BAL dalals and calling Hasina govt \"elected\"?",
          "votes": "4",
          "replies": []
        },
        {
          "text": "I’d hardly call it “ elected “ but yes new government is most definitely a puppet.",
          "votes": "2",
          "replies": []
        },
        {
          "text": "Who cares! India bad. Normal bangladeshi brain is more into creating an imaginary war with india than anything now. They are so into Yunus euphoria that they don't see he is more interested in radicalizing the society than fixing economy.",
          "votes": "-4",
          "replies": []
        },
        {
          "text": "",
          "votes": "-8",
          "replies": []
        }
      ]
    }
  ],
  "id": 197
}