{
  "url": "https://www.reddit.com/r/bangladesh/comments/1hsgydb/the_number_of_banks_operating_in_bangladeshs/",
  "hash": "7559be5d5076d2c5e79ab206ecdc10c7",
  "scraped_at": "2025-12-08T15:51:12.409055",
  "title": "The Number of Banks operating in Bangladesh's Banking sector must be reduced",
  "description": "the current oversaturated banking industry with 61 small and illiquid banks engaging in an unhealthy competition for deposits need to be consolidated and there number needs to be reduced to 8-10 big strong banks.currently the total amount of deposits in the whole banking sector is is around 1,700,000 crore taka. Most private banks on average have deposits worth around 50000 crore taka. There small sizes make them very vulnerable and they have to bow to the wishes of big business houses who sometimes have more assets than the banks themselves. A single big borrower defaulting on their liabilities can bankrupt the bank. Hence the borrowers leverage the desperate situation of these small banks to reschedule their loans or write off interest payments and it is a big contributing factor to the default culture of the country.\nUnder the new consolidation plan, the smallest of banks should have atleast 150000 crore taka worth of deposits. This will allow the banks to achieve economies of scale. Because of the lack of much competion and huge deposit and asset base, they don't need to scrap for deposits which will lead to a decrease in deposit rates and consequently the lending rates, resulting in an increase in investment expenditure in the economy. Their large size would allow them to finance bigger investment projects and reduce the need of business to take loans from multiple banks, often with the same collateral which makes the liquidation process difficult incase of bankruptcy. The banks can use their size and scope to force the big business houses and borrowers to be more prudent with their finances and be disciplined with payments.\nADB report which proposes consolidation of banking industry among other reforms to reduce NPLs in Bangladesh:",
  "votes": "3",
  "comments": [
    {
      "text": "Bangladeshi Minister Jahangir Alam Chowdhury said\n\"Bangladesh is a Muslim majority country. So, whether it is police or Govt jobs, Muslims will get priority\"\nNew Govt order passed restricts the appointment of Hindus to the police dept, from constables to higher ranks.\nMore than 1,500 Hindu applicants for the posts have been rejected.\n100 Hindu officers dismissed as per Times of India Report",
      "votes": "0",
      "replies": []
    }
  ],
  "id": 201
}