{
  "url": "https://www.reddit.com/r/bangladesh/comments/1hsf0jx/thailand_sees_growing_influx_of_patients_from/",
  "hash": "1d3852c4aa808792369378f05e2e8019",
  "scraped_at": "2025-12-08T15:51:27.910140",
  "title": "Thailand sees growing influx of patients from Bangladesh | The Daily Star",
  "description": null,
  "votes": "43",
  "comments": [
    {
      "text": "If they can lower the prices of ticket, medical bills and hotels. They will get millions of Bangladesh customers. We want to avoid India if we can",
      "votes": "22",
      "replies": [
        {
          "text": "Plane ticket prices could surely be cheaper if the Thai low cost carriers expanded more in BD. For some reason they never performed that well in the BD market, and now the cheapest fares are still Biman or US-Bangla, which are still expensive. Airlines like Lion Air, Thai AirAsia, Nok Air, or even Malaysian AirAsia, BatikAir, etc can offer really competitive fares on many routes but in BD they're still relatively expensive or nonexistent. Of course, all of this comes with the catch that there won't be meal service, extra baggage, etc.. but that's how low cost carriers are, and those tickets can get wayyyy cheaper than full service airlines like Biman or Thai Airways.\nHotels are super cheap in Thailand though. Makes Dhaka look really expensive tbh.",
          "votes": "3",
          "replies": [
            {
              "text": "Finally, someone who knows what hes talking about",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "",
          "votes": "-12",
          "replies": [
            {
              "text": "Oh look an honourable guest from indiaspeaks and no it’s not blind hatred against india why wouldn’t our people choose better alternatives given the circumstances??",
              "votes": "16",
              "replies": []
            },
            {
              "text": "Thiland is better anyways",
              "votes": "11",
              "replies": []
            },
            {
              "text": "Why don't you Indians understand. We are just not that into you",
              "votes": "8",
              "replies": []
            },
            {
              "text": "government incentivization exists mate.",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "They get millions of travelers from West. Why would they lower anything for us",
          "votes": "0",
          "replies": [
            {
              "text": "Extra customers and profits wouldn't hurt them. If they are smart, they can take advantage of India visa ban",
              "votes": "6",
              "replies": []
            }
          ]
        },
        {
          "text": "",
          "votes": "-10",
          "replies": [
            {
              "text": "There are thai muslims too",
              "votes": "8",
              "replies": []
            },
            {
              "text": "bro these indian fucktards will pull their hindu-muslim crap into anything.\ntake ur communal bs and fuck off right back to ur little ego chamber in whichever corner of the internet it is. and rant about hindu-muslim all day as much as u want no one will bother u.",
              "votes": "7",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Ain't no one gonna talk about how Daily Star literally depicted Thailand as Laos lmao",
      "votes": "3",
      "replies": []
    }
  ],
  "id": 202
}