{
  "url": "https://www.reddit.com/r/bangladesh/comments/1hsdaml/why_did_bangladeshi_taka_go_down_in_value_on_new/",
  "hash": "dcfb39ec9b8f3556b05cb51c7ddf0be8",
  "scraped_at": "2025-12-08T15:51:45.858670",
  "title": "Why did Bangladeshi Taka go down in value on new years?",
  "description": "",
  "votes": "12",
  "comments": [
    {
      "text": "Some people may say inflation, but I've been secretly burning 2Tk and 5Tk notes and I think the govt is finally up to me!",
      "votes": "15",
      "replies": [
        {
          "text": "😂",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Our central bank recently raised the rates, that's why.",
      "votes": "5",
      "replies": [
        {
          "text": "If interest rates are increased, isnt demand of taka going to increase?",
          "votes": "4",
          "replies": [
            {
              "text": "Raised the base rate for USD exchange rate calculation.\nThey increased local call money rate too but that is different.",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "Interest rate is increased as a reaction to currency depreciation. General Economics wisdom is that, if the rates are increased, treasury bonds will become more attractive to foreign investors and this foreign investors will buy takas in the forex market to invest in these bonds. An increase in demand for taka will appreciate the value of the taka. Hence why interest rates are increased to halt currency depreciation",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "when are we going to compete with the pakistani rupees on who can devalue more to thei currencies?",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "-11",
      "replies": []
    },
    {
      "text": "Maybe one of the main reasons is political issue",
      "votes": "1",
      "replies": []
    },
    {
      "text": "The goal of currencies is to depreciate and dilute the purchasing power of the masses. This is what happens when currencies are not backed by something intangible ie gold.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 203
}