{
  "url": "https://www.reddit.com/r/bangladesh/comments/1hrmvha/bangladeshs_fy24_gdp_300b_not_459b_city_bank/",
  "hash": "356b18b9342063365b82b6f4d5b22405",
  "scraped_at": "2025-12-08T15:52:03.303497",
  "title": "Bangladesh’s FY24 GDP $300b, not $459b: City Bank Capital",
  "description": "Souce: https://www.tbsnews.net/economy/bangladeshs-fy24-gdp-300b-not-459b-city-bank-capital-1032751",
  "votes": "10",
  "comments": [
    {
      "text": "This is clear exaggeration as Bangladesh is said to still be on track to graduate from low-income status by the international community. It's very likely we flubbed the numbers a bit though, but unlikely that any country can get away with a nearly 50% lower GDP actual vs what they report to the international community, especially when getting loans and credit ratings.",
      "votes": "9",
      "replies": [
        {
          "text": "city bank er nijer agenda ase, nothing surprising. Dont pay any heeds to them. Real GDP is definitely above 400 Billion. Or else ato higher standard of life thakto na amader compared to nations like Pakistan",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "সিটি ব্যাংকের রিপোর্টকে বেশি আমলে নেয়ার কিছু নাই, they have their own measurements and agendas! কিন্তু জিডিপি নিয়া যে ভুয়ামি গত দেড় যুগ ধরে চলতেছে সেটাও বন্ধ করে সঠিক তথ্য উপাত্তের ভিত্তিতে হিসেব করা দরকার যাতে নীতিমালাগুলো কার্যকর হয়!",
      "votes": "6",
      "replies": []
    },
    {
      "text": "The truth is showing, the truth hidden by the previous govt. /s",
      "votes": "2",
      "replies": [
        {
          "text": "Tbh, they likely exaggerated a sure bit of it, I guess lying has become a natural habit in this country, regardless of which side. Although the truth is easier to discover now, we better not get ahead of ourselves and put our hearts into anything at this moment.",
          "votes": "8",
          "replies": [
            {
              "text": "Tbh, they likely exaggerated a sure bit of it, I guess lying has become a natural habit in this country, regardless of which side. Although the truth is easier to discover now, we better not get ahead of ourselves and put our hearts into anything at this moment.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Where are the tbs news haters? This is real journalism with proper reporting and facts.\nOn a serious note, News like this should not surprise anyone. Better to know the truth now and accept the facts.\nDoes it also mean Pakistan is ahead of us in terms of GDP?",
      "votes": "1",
      "replies": [
        {
          "text": "How do you believe pakistan they are lier and fasist also pakistan is poorer than us they don't go through a revolution so they have many secret so they could be under 300 bilion",
          "votes": "10",
          "replies": [
            {
              "text": null,
              "votes": "7",
              "replies": []
            },
            {
              "text": "যদি পাকিস্তানের জিডিপি আমাদের চেয়ে বেশি হয়, তার মানে এই দাড়ায় যে পাকিস্থানের সাথে বন্ধুত্ব করতে কোনো অসুবিধা নেই! এই দেশে এখনো পাকিস্তানপন্থী মানুষ বড় সমস্যা, যেহেতু যে অল্প কয়েকজন ভারতপন্থী ক্ষমতায় ছিল তারা এখন দেশে নেই। কিন্তু বড় কেউই ইসলামিস্ট/পাকিস্খানিপন্থীদের বিরুদ্ধে বলতে ভয় পায়। যতক্ষণ পর্যন্ত এই শিক্ষিত মানুষদের অর্থনৈতিক অবস্থা মোটামোটি ভালো, দেশ পাকিস্তানের মতো ভিখারি হলেও সমস্যা নেই। তবে মাঝে মাঝে আওয়ামী লীগ/হাসিনার (যাদের হাতে এখন ক্ষমতা নেই) সমালোচনা করে নিজের বড় নৈতিকতাবোধ/দেশপ্রেম দেখালে মন্দ হয় না 🤣!",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 204
}