{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ho1fod/%E0%A6%A8%E0%A6%A4%E0%A6%AF%E0%A6%AA%E0%A6%A3%E0%A6%AF%E0%A6%B0_%E0%A6%A6%E0%A6%AE_%E0%A6%AC%E0%A6%9B%E0%A6%B0_%E0%A6%9C%E0%A7%9C_%E0%A6%B8%E0%A6%A8%E0%A6%A1%E0%A6%95%E0%A6%9F%E0%A6%B0_%E0%A6%A8%E0%A6%B0%E0%A6%9C%E0%A6%AF/",
  "hash": "1645f1dbe233bc4892441e9172a1418a",
  "scraped_at": "2025-12-08T15:52:38.758784",
  "title": "নিত্যপণ্যের দামে বছর জুড়ে সিন্ডিকেটের নৈরাজ্য",
  "description": "ক্ষতির মুখে পড়ে অনেক খামার বন্ধ হয়ে যায়, অন্যদিকে বাজারে ফার্মের মুরগি ও ডিম সরবরাহে বড় ঘাটতি তৈরি হয়। এর প্রভাব পড়ে ডিম-মুরগির দামে।\nএই বছরের পুরো সময়েই প্রতি কেজি ব্রয়লার মুরগির দাম ১৮০-২১০ টাকার মধ্যে ওঠানামা করেছে। বর্তমানে বাজারে ২১০ টাকা কেজি ব্রয়লার মুরগি বিক্রি হয়েছে। ডিমের দামও বেশ কয়েক মাস ধরে চড়া ছিল। গত সেপ্টেম্বর মাসের দিকে এক ডজন ডিমের দাম ১৯০ টাকায় ওঠে।\nবছরের শেষদিকে এসে বাজারে বোতলজাত সয়াবিন তেলের সংকট তৈরি হয়। ভোজ্য তেল কোম্পানিগুলোর দাবির প্রেক্ষাপটে সয়াবিন তেলের দাম লিটারে ৮ টাকা বাড়ানো হয়। তবে দাম বাড়ানোর পরও সয়াবিন তেলের সরবরাহ এখনো স্বাভাবিক হয়নি।\nচালের দামও বেড়েছে কয়েক দফায়। সরকারি সংস্থা ট্রেডিং করপোরেশন অব বাংলাদেশের (টিসিবি) তথ্য অনুসারে, এক বছর আগের তুলনায় খুচরা পর্যায়ে সরু ও মাঝারি চালের দাম ১৩-১৪ শতাংশ এবং মোটা চালের দাম ৭ শতাংশ বেড়েছে।\nচলতি বছর লম্বা সময় ধরে উচ্চমূল্যে স্থির ছিল আলু ও পিয়াজের দাম। পণ্য দু’টির উৎপাদন ও মজুত পর্যাপ্ত থাকলেও মধ্যস্বত্বভোগীদের কারণে দাম কমেনি। অক্টোবর মাসে দাম বেড়ে ৮০ টাকায় পৌঁছায় আলুর কেজি। এখন কিছুটা কমে এসেছে। আগের বছরগুলোয় মৌসুমে প্রতি কেজি আলু ১৮-২০ টাকায় ও এরপর ২২-৩০ টাকায় বিক্রি হতো।\nঅন্যদিকে পিয়াজের মৌসুম এবার শুরুই হয়েছিল উচ্চ দামে। গত ফেব্রুয়ারিতে নতুন পিয়াজ ৮০-১০০ টাকা কেজি বিক্রি হয়েছে। এপ্রিলে দাম কিছুটা কমে আবার বেড়ে যায়। নভেম্বরে প্রতি কেজি পিয়াজের দাম ১৫০ টাকা ছাড়িয়ে যায়। অতীতে মৌসুমের শুরুতে দেশি পিয়াজের কেজি ৪০ টাকার নিচে থাকতো।\nসারা বছর সবজির দামও মানুষকে ভুগিয়েছে। গত সেপ্টেম্বর-অক্টোবর মাসে সবজির দাম অনেকটা সাধারণ ক্রেতাদের নাগালের বাইরে চলে যায়। তখন প্রতি কেজি কাঁচা মরিচ ৩০০-৩৫০ টাকা, বেগুন ১২০-১৮০ টাকা; ঢ্যাঁড়স, পটোল, ধুন্দল ও চিচিঙ্গা ৮০-১০০ টাকা; কাঁকরোল, করলা ও বরবটি ১২০-১৪০ টাকায় বিক্রি হয়। সবজির এমন উচ্চ দামে চরম ভোগান্তিতে পড়েন নিম্ন ও সীমিত আয়ের মানুষ। নিত্যপণ্যের দাম নিয়ন্ত্রণ ও সরবরাহ পরিস্থিতি ঠিক করতে সরকার বেশকিছু পদক্ষেপ নেয়। এরমধ্যে বেশির ভাগ পদক্ষেপ নেয় অন্তর্বর্তী সরকার। গত অক্টোবরে চাল আমদানিতে বিদ্যমান তিন ধরনের শুল্ক কমানো হয়। এভাবে সেপ্টেম্বরে আলু আমদানিতে ২৫ শতাংশ শুল্ক কমিয়ে ১৫ শতাংশ ও বিদ্যমান ৩ শতাংশ নিয়ন্ত্রণমূলক শুল্ক সম্পূর্ণ প্রত্যাহার করা হয়। অক্টোবরে ডিম আমদানিতে শুল্কহার ২৫ শতাংশ থেকে কমিয়ে ৫ শতাংশ করা হয়। পাশাপাশি অপরিশোধিত ও পরিশোধিত চিনির ওপর বিদ্যমান নিয়ন্ত্রণমূলক শুল্ক কমিয়ে ১৫ শতাংশ করা হয়েছে। ভোজ্য তেল আমদানিতেও বিদ্যমান মূল্য সংযোজন কর (মূসক) কমিয়ে ৫ শতাংশ করা হয়। আর নভেম্বরে পিয়াজ আমদানিতে শুল্ককর সম্পূর্ণ প্রত্যাহার করা হয়। এর পাশাপাশি টিসিবিসহ কয়েকটি সংস্থার মাধ্যমে খোলাবাজারে সাশ্রয়ী মূল্যে বিভিন্ন পণ্য বিক্রি শুরু করে সরকার।",
  "votes": "4",
  "comments": [
    {
      "text": "সরকার যে দ্রুত আর ড্রাস্টিক পদক্ষেপ নিয়েছিল এখন তার প্রভাব দেখা যাচ্ছে! এটাও পরিস্কার যে বিগত সরকার গুলো, বিশেষত BALর সময় যে দ্রুত আর ড্রাস্টিক পদক্ষেপ না নেয়াতে পাবলিককে এত সমস্যায় পড়তে হ‌ইছিলো!",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 206
}