{
  "url": "https://www.reddit.com/r/bangladesh/comments/1hn784r/vietnam_may_surpass_bangladesh_in_garment_export/",
  "hash": "93f5ae5a6ed85c4e778b35dad4c51853",
  "scraped_at": "2025-12-08T15:52:54.212223",
  "title": "Vietnam may surpass Bangladesh in garment export: report | The Daily Star",
  "description": null,
  "votes": "47",
  "comments": [
    {
      "text": "We are in a trap, where our only money makers are and have been cheap overseas labour and garments for decades now. We lost the money made from that to corruption and capital flight, did not invest to diversify into specialised industries and now we’re in a slump. The consequences will be felt now, you cannot run on cheap labour forever y’know. Every bubble eventually bursts after a few decades.",
      "votes": "22",
      "replies": [
        {
          "text": "Low Intelligence Bangladeshi can't bulid technological and advance industry islam and culture prevent this",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Not just this sector, they also have better cities and transport despite gaining independence later.",
      "votes": "18",
      "replies": [
        {
          "text": "And much higher FDI, their economy is much more diversified, more developed infrastructure, as well as higher gdp per capita, despite being invaded by the Americans and having a civil war for 20 years (not underplaying 1971, we did suffer a lot too).",
          "votes": "11",
          "replies": [
            {
              "text": "After the Vietnam War, we also participated in the third Indochina war: occupying Cambodia for 10 years, fighting China in border and sea wars, and secret war in Laos against the Hmong people until 2000.\nEmbargoes from the US were only lifted in 1995 and the economy began to rebound only in 2010.",
              "votes": "7",
              "replies": []
            },
            {
              "text": "Largely due to culture. South East Asia and East Asia take pride in their surroundings and appearances. Thats why even poorer places like Cambodia have much cleaner streets and organised neighbourhoods than India and Bangladesh. South Asians do not have a conception of “public space”. Cleanliness does not extend outside ones household. Education is about rote learning and getting certificates not about producing stuff. Thats why Vietnam makes things and Bangladesh is a one trick pony in garments. India is an outsourcing hub for IT but does not manufacture either. Thats why South Asia has failed, we lack the culture for industrialisation and planned urbanisation.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "We need to move away from garments asap Depending on garments for 80% of exports says all a about our weak economy and we only export to 10-15 countries of which most of them are European  After 2027 tariffs will imposed and then we can't place our products competitively and it will be a matter of time before some other country will take our spot\nIt is high time we should invest on energy and communication infrastructure as well as medical infrastructure so that our money doesn't go abroad",
      "votes": "14",
      "replies": []
    },
    {
      "text": "The garments sector in Bangladesh is built on exploitation of cheap labor and lack of regulation and is mostly run by corrupt and ruthless businessmen, many of whom has fled after the fall of BAL regime. There is no innovation or technological growth happening to maintain the lead so it is bound to fall behind eventually.",
      "votes": "17",
      "replies": [
        {
          "text": "There really is no Innovation in this sector the one that has the best pricing will win cause you don't need rocket science to produce good quality clothing",
          "votes": "8",
          "replies": [
            {
              "text": "There absolutely is room for innovation. Many countries are starting to automate tasks that is done manually. There are new materials, woving and knitting methods being developed. There is almost no R&D in the industry in our country, and many factories don't even have the latest machines which are more accurate and efficient.",
              "votes": "6",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "It was bound to happen. People have been saying it for years. Next up, a war in the middle east, visa bans - voila, we are trapped in la la land",
      "votes": "3",
      "replies": []
    },
    {
      "text": "this competition between vietnam and bangladesh has been going on for years now. sometimes its bd at 2nd, sometimes its vietnam. usually its always bd but vietname sometimes see surges in production, overtake bd for a few months, and then go back to 3rd again.",
      "votes": "6",
      "replies": [
        {
          "text": "It is important that Vietnam is more diverse in export products, not dependent on just one product.\nWith political instability from Bangladesh, orders will have to be spread evenly to other markets.",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "Can't help but admire the Vietnamese for their resilience. They've had a longer, bloodier history than us and still outrank us.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "নাইস দেট ইস এক্সেক্টলি ওযাট ইস রিকোয়ার্ড👏🏼। কিছু অংশ ভিয়েতনাম এবং কিছু ভারতে যাবে যা নুনুদেশের বৃহত্তম রপ্তানি কমাতে যথেষ্ট হবে।\nsource - https://www.bb.org.bd/econdata/bop/exp_rcpt_merchandise.php\nএইবার নুনুস এর নোবেল বিক্রী করে খাও আর জে -১০ সি কিনার জন্য আইএমএফ আছে তাই চাপ নাই। ওয়েলকাম টু ক্লাব অফ পাকিস্তান দুজনে মিলে এবার ভিক্ষা করবে ইন্সটানাল্লা।\nইফ ইওর পুটকি ইস বার্নিং দেন যু ক্যান দাউন ভােট ভাইযা আমি পানি দিমু। ১ দাউন ভােট = ১ লিটার পানি",
      "votes": "1",
      "replies": [
        {
          "text": "Bhai… Onek gula upvote dite chai. I am not fully into the news of Bangladesh but I don’t remember hearing anything specific to improve the economy of Bangladesh. Ki ek indiar piche laiga ache. Koi India space explore kore ar era still ওয়াজ kore kemne india Bangladesh ke bonnar pani dia bhasaia felche.",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 207
}