{
  "url": "https://www.reddit.com/r/bangladesh/comments/1higtqk/how_can_bangladesh_recover_her_economy_and/",
  "hash": "4c24c18ef1435a845c0062bd99eb25bf",
  "scraped_at": "2025-12-08T15:53:27.789772",
  "title": "How can Bangladesh recover her economy and currency value?",
  "description": "As of now I've heard that 1$ = 126 taka. I remember whennI was little 1$ used to be 70-72 taka. How and why did our currency lost it's value so gradually over just a few years?\nHow can we get back to the previous value? And how does many first World countries have weak currency compared to dollar but their economy functions quite well? ( example : Japan, South korea, China). Even some emerging countries like Vietnam, Philippines have weak currency compared to dollar. Will dollar to taka value remain like this or there is any chance we can recover the gap between Dollar and Taka.\nI no nothing about how inflation and currency value works, so if someone is kind enough to explain me in simple words, I'll be grateful. TIA.",
  "votes": "29",
  "comments": [
    {
      "text": "increasing export\ndecreasing import\nincreasing foreign investment\nincreasing forex reserve\nincreasing remittance\ndecreasing debt",
      "votes": "19",
      "replies": [
        {
          "text": "All these are happening thankfully\nincreasing export >> Nov 15% YoY\ndecreasing import >> Nov -8% YoY\nincreasing forex reserve >> No progress\nincreasing remittance >> Nov 15% YoY\ndecreasing debt >> -5B",
          "votes": "9",
          "replies": [
            {
              "text": "MashaAllah, you guys are blessed with a government that seems to care. Coming from Pakistan, it makes me happy to see Bangladesh thrive. I also hope and pray we also learn from Bangladesh and strive to do better",
              "votes": "6",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "It will never go back to the old rate, it never does. Besides, it might be beneficial if the taka gets slightly devalued, but it should be at a much slower pace. For example, remittances have jumped, and the depreciation of the taka is a factor.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Weak currency is actually better for high exporting countries. So the only way to recover would be to increase exports and decrease imports. Increasing foreign investments will also work",
      "votes": "6",
      "replies": [
        {
          "text": "Bangladesh is not a high exporting country if you compare import vs export",
          "votes": "3",
          "replies": [
            {
              "text": "That should change",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "আমাদের টাকাকে শক্তিশালী করতে হবে না। মানুষের যে আয় তা বাড়লে এর নেগেটিভ প্রভাব কেটে যাবে। বিগত দুই বছরে ৮৪ থেকে ১১৫-১১৬ তে নিয়ে গিয়েছিল। এখন ১১৯ এ আছে।",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Artificially TKr value beshi rakha silo. Eta jodi gradually goto 6-7 bosore baraito tahole ei pressure porto na.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Bangladesh has asked Nobel laureate Muhammad Yunus to lead economic changes, but it appears he is more interested in turning the country into the next chapter in the Muslim Brotherhood's playbook.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Why the fuck are you copying response from chatgpt? Don't you think the op would do it himself if he preferred.",
      "votes": "5",
      "replies": [
        {
          "text": "Why the fuck are you copying response from chatgpt? Don't you think the op would do it himself if he preferred.",
          "votes": "5",
          "replies": [
            {
              "text": "Because that's a perfectly detailed and appropriate response to the questions. Sometimes people need to put some effort into researching the topic rather than directly asking here. Nevermind, deleted it.",
              "votes": "4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I think it is time we ditch \"dollar\" and shift to \"yuan\"",
      "votes": "1",
      "replies": []
    },
    {
      "text": "The Bangladesh government can issue a 150,000 crore taka local currency treasury bond which only foreign investors can invest in. The foreign investors would buy taka in exchange of dollars which will increase the value of the taka and our foreign reserves. The bonds must be indexed to the exchange rate of the taka. interest payments would rise equivalent to the dollar value of lost interest payment incase of depreciation of the taka. As there is no exchange rate risks, meaning there is no chance of the return of investment declining in dollar terms, more foreign investors would be willing to invest in those bonds and they'd be less likely to withdraw funds in case of a currency depreciation. Sovereign wealth funds and public pension funds should be given priority when selling the bonds as these types of entities usually don't speculate and rather focus on long term investments and they are less likely to withdraw funds.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "We actually benefit from our currency being low. It attracts more exports and foreign investment. For the currency to increase in value, we would have to export products/services for a higher price but the thing is textiles isn't an industry that is highly skilled and naturally means higher costs. Its not like pharmaceuticals or IT.\nWe need to diversify the economy very quickly if we want Bangladesh to not be left behind.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "ডলারের সাথে এক্সচেঞ্জ রেট এর উপর কোনোকিছু নির্ভর করেনা। পাউন্ড, কুয়েতি দিনার সহ বেশ কিছু মুদ্রা আছে যেগুলো ডলারের চেয়ে বেশি দামি। কিন্তু ওই দেশগুলোর অর্থনীতি তো আমেরিকার চেয়ে ভালো নয়।\nবাংলাদেশের হাজারটা সমস্যা রয়েছে। মুদ্রা পাচার বন্ধ করতে হবে, শিক্ষাদীক্ষা জ্ঞান বিজ্ঞানে এগিয়ে যেতে হবে। বাংলাদেশে বিশ্ববিদ্যালয়গুলোতে এখনো ফিজিক্স ক্লাসে বিগ ব্যাং থিওরি পড়াতে গেলে শিক্ষকরা ভয় পান। বায়োলজি ক্ল্যাস অথবা মেডিকেল ক্লাসে বিবর্তন পড়াতে শিক্ষকরা ভয় পান।\nফতোয়াবাজি, ধর্ম নিয়ে বাড়াবাড়ি এসব বন্ধ করতে হবে। সমাজের সব মানুষের (সংখ্যালঘু, সমকামী, নাস্তিক) নিরাপদ জীবন যাপন নিশ্চিত করতে হবে। পশ্চিমা বিশ্বের সমাজের মতো সমাজ আপনি চাবেন না কিন্তু তাদের অর্থনীতির মত অর্থনীতি চাবেন এটা তো হতে পারে না।",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Bangladesh's currency devaluation has more to do with the US central bank than our own deeds. Basically when the Western deposit rates went up to 5%+, foreigners started depositing cash in their own jurisdiction than spend it on risky investments in developing nations. The funds got cut, government was forced to stop subsidising oil and gas like they have been for ages now and kaboom",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 209
}