{
  "url": "https://www.reddit.com/r/bangladesh/comments/1orssbd/%E0%A7%A9%E0%A7%AB%E0%A7%A9_%E0%A6%95%E0%A6%B0%E0%A6%96%E0%A6%A8_%E0%A6%AC%E0%A6%A8%E0%A6%A7_%E0%A6%AC%E0%A6%95%E0%A6%B0_%E0%A6%B8%E0%A7%9F_%E0%A6%B2%E0%A6%96_%E0%A6%B6%E0%A6%B0%E0%A6%AE%E0%A6%95_%E0%A6%AC%E0%A6%9C%E0%A6%8F%E0%A6%AE%E0%A6%87%E0%A6%8F%E0%A6%B0_%E0%A6%A4%E0%A6%A5%E0%A6%AF/",
  "hash": "a568d3752055dbeebf1e41d86caf231e",
  "scraped_at": "2025-12-08T15:02:04.333239",
  "title": "৩৫৩ কারখানা বন্ধ, বেকার সোয়া লাখ শ্রমিক: বিজিএমইএ'র তথ্য",
  "description": null,
  "votes": "4",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "তো কি হয়েছে? জানেন না নন কমপ্লায়েন্স কারখানা বন্ধ হওয়াই ভালো?",
      "votes": "13",
      "replies": [
        {
          "text": "এটা যাস্ট নিউজরে ভাই। কোনো মন্তব্য না। মন্তব্য বিজেএমইকে দিন।",
          "votes": "2",
          "replies": [
            {
              "text": "Sarcasm brother. CA's press secretary said Non-compliant factories being shut down is not harmful.",
              "votes": "8",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "মনে হচ্ছে সবসময় বাংলাদেশকে ততটুকই উন্নত রাখা হবে যতটুকু উন্নত করলে নিরবিচ্ছিন্ন গার্মেন্টস শ্রমিক পাওয়ার নিশ্চয়তা থাকে। দেশের বেশি উন্নয়ন করলে গার্মেন্টসে কাজ করার লোক পাওয়া যাবে না।",
      "votes": "6",
      "replies": [
        {
          "text": "গার্মেন্টস থেকে আস্তে আস্তে অন্য কোথাও শিফট করতে হবে। সেখানে চাকরির ব্যবস্থা করাটা যদিও একটু সমস্যার। কাপড় বানানোর দক্ষতা আগে থেকেই এদেশের মেয়েদের ভেতর আছে। তাই গার্মেন্টস আছে।",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "দেশে পরিকল্পিত ভাবে গৃহযুদ্ধ বাধাতে চাইছে গুপ্ত বাহীনি। পরে বলবে আমরা সৎ, আমাদের ভোট দাও। আমরা সাধু",
      "votes": "1",
      "replies": []
    },
    {
      "text": "ডাহা মিথ্যে",
      "votes": "-4",
      "replies": []
    },
    {
      "text": "ওয়েস্টার্ন ওয়ার্ল্ডে রিসেশন চলতেছে, তাই লোকজন খুব বেশি জামাকাপড় কিনছে না। যেহেতু ওখানে বিক্রি কম তাই এখানে অর্ডার কম। তাছাড়া চায়না ডিপেন্ডেন্সি’ থেকে শিক্ষা নিয়ে রিটেইলারগুলো সাপ্লাই চেইন ডাইভারসিফাই করছে এবং কম্বোডিয়া-নাইজেরিয়া-ভিয়েতনাম এসব দেশে আগের তুলনায় বেশি অর্ডার প্লেস করছে।",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 21
}