{
  "url": "https://www.reddit.com/r/bangladesh/comments/1hidtkv/world_bank_approves_116bn_for_three_bangladesh/",
  "hash": "1125cf80b66d155f50a9a3c05cbfaed9",
  "scraped_at": "2025-12-08T15:53:46.928023",
  "title": "World Bank approves $1.16bn for three Bangladesh projects | The Daily Star",
  "description": null,
  "votes": "28",
  "comments": [
    {
      "text": "Yay more debt trap 🥹",
      "votes": "15",
      "replies": []
    },
    {
      "text": "I'm kinda skeptic about these programs and whether they would inevitably do any good or not. Anyone with a better understanding of these programs, their desired outcome and current situation of BD in those aforementioned sectors of QoL kindly explain it to me please?",
      "votes": "7",
      "replies": [
        {
          "text": "",
          "votes": "-6",
          "replies": [
            {
              "text": "Apni amar point tai dhorte paren nai. Ami public discourse er jonne open naki na er bepare akbaro proshno korsi?\nAmar question holo adou ei project gula BD r jonne (from an economic standpoint) akhn newar dorkar chilo kina. Stuff like green energy projects aren't something we can afford to improve on with this economy. We have other crucial sectors to reform and develop. In this situation, should we really take on more and more debts, (one of the very reasons that got the previous govt deposed), more so on projects like pollution and green energy?\nThe reason again that I'm being more skeptic is that WB has a notoriety of being the US's tool for imposing western corporate agenda and economic opportunities in the third world, once emerging countries like Iraq, Ecuador, Venezuela, Chile, Congo, Kenya,,, and many many more. They put billions in funds to projects that were eventually outsourced back to their same western pal companies that mostly reaped the benefits. Not to mention funding America alligned politicians, staging coups, and destabilizing the status qou for the worse\nEven conspiracy aside, I really do not think we should invest any further on economically inessential projects at this point. That's why I'm asking if somebody has a better knowledge of what these projects are specifically supposed to do, and whether or not can we do without them for the moment.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "As new regulations and standards for environmental management come into play, some small businesses that fail to adapt may face closures. While the projects aim to promote green practices, there is always a risk that environmental considerations may be sidelined in favor of rapid development.",
      "votes": "2",
      "replies": [
        {
          "text": "Fokir desh gula ke fokir banay rakhbe ar nijeder dhoni kore rakhbe",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "If we keep being bottom boys to neoliberal institutions like the world bank and IMF, we are not getting out of poverty. We'll just keep repeating many more July upheavals in the future.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 210
}