{
  "url": "https://www.reddit.com/r/bangladesh/comments/1hg8myn/my_proposals_for_financial_sector_reforms_in/",
  "hash": "9ebb0e3a215444cbf8d66e0106d7bead",
  "scraped_at": "2025-12-08T15:54:38.760297",
  "title": "My Proposals For Financial sector reforms in Bangladesh",
  "description": "the current oversaturated banking industry with 61 small and illiquid banks engaging in an unhealthy competition for deposits need to be consolidated and there number needs to be reduced to 8-10 big strong banks.currently the total amount of deposits in the whole banking sector is is around 1,700,000 crore taka. Most private banks on average have deposits worth around 50000 crore taka. There small sizes make them very vulnerable and they have to bow to the wishes of big business houses who sometimes have more assets than the banks themselves. A single big borrower defaulting on their liabilities can bankrupt the bank. Hence the borrowers leverage the desperate situation of these small banks to reschedule their loans or write off interest payments and it is a big contributing factor to the default culture of the country. Under the new consolidation plan, the smallest of banks should have atleast 150000 crore taka worth of deposits. This will allow the banks to achieve economies of scale. Because of the lack of much competion and huge deposit and asset base, they don't need to scrap for deposits which will to decrease the deposit rates and consequently the lending rates, resulting in an increase in investment expenditure in the economy. Their large size would allow them to finance bigger investment projects and reduce the need of business to take loans from multiple banks, often with the same collateral which banks the liquidation process difficult incase of bankruptcy. The banks can use their size and scope to force the big business houses and borrowers to be more prudent with their finances and be disciplined with payments.\nconglomerates involved in other businesses need to be barred from owning banks and financial institutions to stop insider lending. The government should encourage foreign banks, asset management corporations and private equity firms, who have the knowledge of the best practices of the global banking industry, to invest and acquire controlling stakes in domestic banks which will modernise the banking practices of domestic banks through transfer of knowledge and the detachment of foreign investors from any conflict of interest with local borrowers means they will be strict with lending practices and force the borrowers to be more financially prudent and reduce the likelihood of default. foreign banks, who generally have better quality services and better lending practices, needs to be encouraged to increase their market share and expand operations which will increase the quality of banking services across the whole sector due to better competion.",
  "votes": "2",
  "comments": [],
  "id": 213
}