{
  "url": "https://www.reddit.com/r/bangladesh/comments/1hfq8vr/how_to_invest_in_nyse_and_nasdaq_from_bangladesh/",
  "hash": "50b56b2828a672b22b0de2b3720504da",
  "scraped_at": "2025-12-08T15:54:54.301977",
  "title": "How to invest in NYSE and Nasdaq from Bangladesh?",
  "description": "I am a Bangladeshi citizen with no family/friends in the USA. I have never been in the USA and don't plan on visiting in the near future if ever.\nI have a bank account in Bangladesh and a dual currency enabled here in Bangladesh. I just joined the workforce a year ago and saved up some money. I will be investing some of it in DSE and CSE. But given the volatile situation of our SE, I wanted to invest some of it in US market. Specially S&P 500. I'll be consistently saving and investing money in this fund.\nI am asking the kind people of reddit how can I do it? How do I invest in US index funds?",
  "votes": "2",
  "comments": [
    {
      "text": "Following........",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Does interactive brokerage work in Bangladesh?",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Happy to help , feel free to DM me.",
      "votes": "-1",
      "replies": []
    },
    {
      "text": "I want to know also how can we do this ?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I believe there's stock broker companies here in Bangladesh that you can contact and see if they can help you invest in the NYSE and Nasdaq. Also, there are international banks like HSBC, Standard Chartered, Citibank, and at least from HSBC, I do know that they help you do investments. Not clear if it is Bangladesh only or also American.",
      "votes": "1",
      "replies": [
        {
          "text": "It is a very small amount that I'll invest. Like a couple of hundred dollars. Will they help me still?",
          "votes": "1",
          "replies": [
            {
              "text": "Should be no problem. I don’t know much about it I’ll admit so do check yourself.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 214
}