{
  "url": "https://www.reddit.com/r/bangladesh/comments/1h7ylgg/dissecting_the_biases_in_methodology_is_the_white/",
  "hash": "7a887a48db40858e1cf5bab44f83e7e9",
  "scraped_at": "2025-12-08T15:55:41.793300",
  "title": "Dissecting the Biases in Methodology: Is the White Paper Credible?",
  "description": "Furthermore, the report references the ‘Middle-Income Trap’, a legitimate concern for Bangladesh. At the same time, experts such as Dr Bhattacharya maintain the previous government’s position by reiterating that all relevant indicators suggest Bangladesh is on track to graduate from the LDC category by 2026. This aligns with his previous statement published in the 2018 book Bangladesh’s Graduation from the Least Developed Countries Group, in which he states, “Bangladesh might be one of the first countries in the group to fulfil all the three criteria at the time of its graduation.”[4]",
  "votes": "8",
  "comments": [
    {
      "text": "I dissected their bias against nuclear energy:\nOn page 158, their assertion that the Rooppur NPP will cost $12.65 billion is incorrect. The final cost will be established upon project completion. The Annual Report of the Economic Relations Division published in October states that Russia has so far disbursed $7.3 billion. We will only repay the amount we spend with interest, not $11.385 billion, said Russian Embassy in Dhaka. They also said the Rooppur NPP is overpriced by comparing cost to India that has a domestic nuclear industry and skilled workforce but the research paper titled \"Projected Electricity Cost in International Nuclear Power Market\" and other publicly available data says otherwise. They also made other minor errors.\nOn page 155, the paper criticizes reliance on imported fossil fuels but calls nuclear a misadventure on page 158, despite Rooppur NPP needing only 70 tons of fuel every 12-18 months. It suggests Rooppur's funds could have gone to coal, gas, and solar, though coal and gas would require more imports which they criticised the Hasina government for.\nOn page 157, it is suggested that the integration of nuclear energy is a big reason battery storage is required. However, the reality is that nuclear power can maintain constant output and adjust it according to demand. That's why it technically does not require help from batteries. The fact is intermittent sources of energy like wind and solar relies more on batteries, gas or oil for grid stability because they are intermittent.",
      "votes": "8",
      "replies": [
        {
          "text": "Roopur was a russian project.",
          "votes": "-2",
          "replies": [
            {
              "text": null,
              "votes": "4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I don't think Bangladesh can graduate on time anymore. All indexes are going downward.",
      "votes": "3",
      "replies": [
        {
          "text": "Which ones? November: Import down 5%, Export up 15%, Remit up 15%. What indicators are you talking about?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "November: Export increased 15%, Import decreased 6%, Remit increased 15%. Just that alone should tell you what was going on. Give it time. They will find all the scams and stop it one by one.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Remindme! 3 days",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 217
}