{
  "url": "https://www.reddit.com/r/bangladesh/comments/1orilud/%E0%A6%B8%E0%A6%B0%E0%A6%95%E0%A6%B0_%E0%A6%B8%E0%A6%AB%E0%A6%B0_vs_%E0%A6%AC%E0%A6%A8%E0%A6%AF%E0%A6%97_%E0%A6%B9%E0%A6%B0%E0%A6%B8/",
  "hash": "6d2432b385e37195d22fc384a925dd8d",
  "scraped_at": "2025-12-08T15:02:21.598242",
  "title": "📉'সরকারি সফর' VS 'বিনিয়োগ হ্রাস'",
  "description": "Bangladesh Bank data says net foreign direct investment (FDI) actually went up 19.13% in FY2024–25. Well… most of that “growth” came from one big  payment from Japan Tobacco (Netherlands office) for Akij’s tobacco business acquisition. Basically, an old deal finally got paid up, which made the Dutch numbers skyrocket over 1,800%.\n২০২৩–২৪ ও ২০২৪–২৫ অর্থবছরের নিট এফডিআই প্রবাহের প্রধান দেশ (কোটি ডলার):",
  "votes": "90620",
  "comments": [
    {
      "text": "Mr Ashik is someone who you want for higher mid position in your 'company'. You gave him the position of Chairman of BIDA with the equivalence of a minister! Highest position of Investment Development authority of the country. That's absurd and stupidity of highest possible scale. I dont blame Ashik. He was put in a chair that was way beyond his maturity level. Bangladesh is not 50B GDP economy country anymore.It was 450B in 2024. I guess the interim really failed to analyze our economy. Only good appointments were Bangladesh Bank Governor and Finance adviser. Without these two we were doomed.",
      "votes": null,
      "replies": []
    },
    {
      "text": "I like ashik but its disappointed to see him making such misleading reports, he is comparing us to war torn countries and countries like sri lanka which already has a very small export earning, already many factories have shut down the political climate is bad, infrastructure sucks, its a miracle that anyone would invest here not vietnam, Malaysia, thailand or even cambodia",
      "votes": null,
      "replies": []
    },
    {
      "text": "Main Source:\nসরকারি সফরের বেশির ভাগ দেশ থেকে বিনিয়োগ কমেছে ---বণিক বার্তা\nHow real is 19% FDI growth in FY25 after July Uprising? ---TBS",
      "votes": null,
      "replies": []
    },
    {
      "text": "You can't calculate investment like that yesr by year hence why you weird spike like those tobacco investment spikes. Also large scale investment take long time to take fruition.",
      "votes": null,
      "replies": []
    }
  ],
  "id": 22
}