{
  "url": "https://www.reddit.com/r/bangladesh/comments/1h2ms7b/should_bangladesh_join_asean/",
  "hash": "59ef15a366eb28ec5b4a6ed2a3dbcf01",
  "scraped_at": "2025-12-08T15:57:23.879845",
  "title": "Should Bangladesh join Asean?",
  "description": null,
  "votes": "6",
  "comments": [
    {
      "text": "It has a lot of Benefits. But will Bangladesh be taken in ASEAN in all this unrest?",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Hahahaha. Thr qustion us not 'should', it is 'how'.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Our only ASEAN neighbor, Myanmar, is in a civil war, plus we will most likely not be accepted as we’re very different from most Southeast Asian countries and closer to South Asia in everything.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "How could it possibly hurt to join and why haven’t they done this already?",
      "votes": "1",
      "replies": [
        {
          "text": "Bangladesh is not part of south east Asian culture. Even India has a better chance because of its northeast population and culture.",
          "votes": "4",
          "replies": []
        },
        {
          "text": "We haven't joined ASEAN yet because our past political leadership lacked the foresightedness to understand that, as novel as the idea behind SAARC has been based on shared history and cultural proximity of the member countries, it would gonna be non-functional because of the narcissism and hegemonic attitude of one big country. Even attempts at creating sub-regional forums have faltered. If our political leadership took the cues and considered whom our economic and political interests are better served by aligning with, we would have been a member of ASEAN and other trade blocks like RCEP by now.",
          "votes": "2",
          "replies": []
        },
        {
          "text": "possibly the same reason why Morocco wasn't allowed to join EU?",
          "votes": "2",
          "replies": []
        }
      ]
    }
  ],
  "id": 223
}