{
  "url": "https://www.reddit.com/r/bangladesh/comments/1gvz1ll/russia_wants_to_keep_loan_repayment_money_in_its/",
  "hash": "44a1bec8ea5919270c9380fad40f4adb",
  "scraped_at": "2025-12-08T15:57:40.457237",
  "title": "Russia wants to keep loan repayment money in its custody",
  "description": "Source: https://en.prothomalo.com/business/local/ywd5x39pqw\n\"Russia is exerting pressure on Bangladesh to open a branch of a Russian bank in Dhaka in order to send the loan installment money from the Rooppur Nuclear Power Plant project to the home country or at least keep it in their custody.\"\n\"Since banks in Russia face sanctions and are forced out of the SWIFT system following the Russia-Ukraine war, Dhaka can no longer send the loan repayment money from the Rooppur Nuclear Power Plant project to Moscow.\"\nMy take: If we don't pay this loan money and 10% of the project cost, there is a possibility that Russia would not extend the term limit of the $11.38 billion export credit by two years as requested by the interim government. The reason the government wants this extension is because the project is facing delays because of Covid and Ukraine war. As of August 2024, Bangladesh has used $7.33 billion out of $11.38 billion export credit which is going to expire on Dec 31 2024.\nWhat's the problem? If the project isn't finished, the Rooppur NPP won't be able to produce electricity, which is necessary to cover the loans from Russia and Bangladesh. As a result, Bangladesh will have to pay the expenses from its own funds. The repayment period for the export credit which is covering the cost of Engineering, Procurement and Construction (EPC) contract will start in March 2027.\nThe $630 million loan that we are unable to repay is for preparatory phase activities, not for the EPC contract.",
  "votes": "14",
  "comments": [
    {
      "text": "Why can't they conduct business via a Chinese or Indian bank?",
      "votes": "6",
      "replies": [
        {
          "text": "They requested that we deposit the money into a Chinese bank, but that bank was under sanctions. I'm not sure about the Indian banks, though.",
          "votes": "1",
          "replies": [
            {
              "text": "Yeah, sanctioned banks are a no go.",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "There was an understanding BD would use Quan to repay. But US EU does not want any type of repayment at all. Our economy is coupled with EU US economy. Which is why this issue is not resolved.",
          "votes": "1",
          "replies": [
            {
              "text": "The US and EU are urging others to avoid doing business with Russia, yet they seem to have no issues engaging in such business themselves.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Its crazy to think that the loan could be covered with Mr. Saifuzzaman Chowdhury's stolen money.\nhttps://www.reddit.com/r/Documentaries/comments/1fk4y6x/the_ministers_millions_2024_how_a_bangladeshi/",
      "votes": "2",
      "replies": [
        {
          "text": "It certainly is.",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 224
}