{
  "url": "https://www.reddit.com/r/bangladesh/comments/1gu9noc/moodys_cuts_bangladesh_further_into_junk_on/",
  "hash": "c62e34ae0643b2f56b96a39afe3d3900",
  "scraped_at": "2025-12-08T15:57:57.118089",
  "title": "Moody’s Cuts Bangladesh Further Into Junk on Political Risks",
  "description": null,
  "votes": "15",
  "comments": [
    {
      "text": "The graph shows that the sharpest declines in BD reserves came under Hasina from summer of 2022 to summer of 2023",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Lol!\nThese are the same agencies that gave AAA rating to dogshit bonds causing the 2008 financial collapse",
      "votes": "9",
      "replies": [
        {
          "text": "They are but still our cost of foreign funds totally depends on our country ratings. So go figure",
          "votes": "9",
          "replies": []
        },
        {
          "text": "And predicting of the collapsing of China.",
          "votes": "-1",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "3",
      "replies": []
    },
    {
      "text": "What does this mean",
      "votes": "1",
      "replies": [
        {
          "text": "The rating cut highlights the economic challenges a fledgling interim government, led by Nobel prize winner Muhammad Yunus, faces as the nation grapples with dwindling foreign exchange reserves and lost business amid the recent political upheaval. Fitch Ratings also downgraded Bangladesh’s sovereign rating in May, underscoring the need for the nation to shore up its forex stockpile, even after securing a $4.7 billion bailout from the International Monetary Fund last year.\nForeign-exchange reserves stood at $19.8 billion as of October 2024, covering more than three months of imports, down from $21.7 billion in June 2024.\nWhile economic activity has largely normalized under the interim government, lapses in law and order have hurt domestic demand and weighed on activity in the ready-made garment sector, Moody’s said, lowering its growth projection for the fiscal year through June 2025 to 4.5% from 6.3% earlier.",
          "votes": "2",
          "replies": [
            {
              "text": "Oh thanks. Were fked up",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "-7",
      "replies": [
        {
          "text": "HasinaMagi3.0 te kub vali silo?",
          "votes": "-1",
          "replies": []
        },
        {
          "text": "areh vai peace prize toh paise ar ki lage amader \\s",
          "votes": "-4",
          "replies": [
            {
              "text": "Shanti r shanti",
              "votes": "-2",
              "replies": []
            }
          ]
        },
        {
          "text": "I would love to see some stats on people lynched for speaking against Yunus\n(I know you dont have any)",
          "votes": "-3",
          "replies": []
        },
        {
          "text": "Previously, speaking against India got you lynched, maybe you prefer that system as your loyalties lie towards them?",
          "votes": "-3",
          "replies": []
        }
      ]
    },
    {
      "text": "It would be interesting to see who the country analyst at Moodys for Bangladesh is\nIf an Indian, then it explains it, Indians cannot tolerate any Bangladesh without BAL leading it",
      "votes": "-3",
      "replies": []
    }
  ],
  "id": 225
}