{
  "url": "https://www.reddit.com/r/bangladesh/comments/1gq8doq/yunus_for_creation_of_south_asian_grid_to_share/",
  "hash": "d32f94d07c1aeba705fe35ed9ff9dce4",
  "scraped_at": "2025-12-08T15:59:01.892702",
  "title": "Yunus for creation of South Asian grid to share Nepal, Bhutan's hydroelectricity",
  "description": "https://www.dhakatribune.com/bangladesh/power-energy/365025/prof-yunus-bangladesh-india-nepal-bhutan\nMy take: If Bangladesh relies heavily on imported hydroelectricity from Nepal and Bhutan, it would give India even more leverage over us as the electricity would need to transit through India.",
  "votes": "51",
  "comments": [
    {
      "text": "Dr. Yunus needs to get out of the `clean energy` mindset. He will lose popularity rapidly. We are poor. We need to burn natural gas to make electricity. Get China involved and build 5 (8 * 330 MW) natural gas powerplant. Stop the ideas inside BD with quick rental power plants.",
      "votes": "6",
      "replies": [
        {
          "text": "We will run out of natural gas in the early 2030s if no major discovery is made. The fact is that in this century, Bhola was our largest discovery, and all the other ones in this century were quite small. So, betting on natural gas is not the best idea since our discoveries since independence have been tiny. To give you some basis for comparison, we have discovered about 30 tcf of gas so far. That's less than what the US consumes in a single year, which was approximately 32 tcf last year.\nHis problem is that his vision is 100% renewables, which is a very unrealistic goal. He wants to bet heavily on solar energy, which is going to make electricity very expensive in our country. The problem is not that solar is not cheap. It is somewhat cheap, but the issue is that solar is intermittent and requires heavy investment in grid infrastructure because of its intermittency. It also requires a lot of transmission lines and substations to make it work.\nBangladeshis love solar and wind, but they are about to find out the hidden costs associated with them very soon. I think I heard the energy advisor say that he wants to bet on energy storage as well. Wait until we all find out how expensive all this is. If an energy and land-scarce country like ours want to keep electricity cheap and ensure that we maintain some degree of energy independence, we need to utilize our coal mines instead of closing them. We must invest in nuclear, which have high capital costs but low electricity costs, and invest in solar in a way that does not make it expensive. If more natural gas is discovered, then we should use it for power plants as well even if it increases our emissions. Because the fact is emission concern is not going to stop any country from burning more coal and gas. I mean it hasn't stopped anyone so far.",
          "votes": "7",
          "replies": [
            {
              "text": "We can import gas",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Disappointing !… he should instead advocate for freedom and sustainability … we need to generate our own electricity by any means necessary .. this is a very critical issue… why aren’t ppl emphasizing on this i can’t comprehend",
      "votes": "2",
      "replies": []
    },
    {
      "text": "He went to the COP 29 summit, that's why in order to uplift his global image, he needed to show the world he is doing something good for the environment . But in fact, the agreement to import 40 megawatts of hydropower from Nepal was finalized during Hasina's tenure! Also, the plan to import hydropower from Bhutan was also done during Hasina's tenure. When the Rooppur 3200 MW nuclear power plant will start its operation from next year, he will also take credit for that. He only eats the fruits of others planted trees and looks great in front of the world and nothing else!",
      "votes": "1",
      "replies": [
        {
          "text": "What do you think he should do stop the agreement of nepal Bhutan and rooppur just because it was \"during hasina's regime\"???",
          "votes": "0",
          "replies": [
            {
              "text": "He shouldn't stop any agreement, he should only stop taking credits and give at least some credits to the previous regime.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "We don't need to depend significantly on imports, as we have viable alternatives. We can build our own power plants to produce clean energy, generate jobs, and strive for energy independence.\nYou seem like someone who believes US was behind the coup in August to remove Sheikh Hasina. However, the reality is that the US is currently prioritizing its relationship with India, which it considers crucial for countering China's influence in the region. As a result, the US is largely allowing India to pursue its own policies without much interference. What I'm trying to convey is that, at this moment, Bangladesh isn't a primary focus for the US. Let me ask you this: how often have you heard a US leader mention Bangladesh? The answer is hardly ever. So, please consider that for a moment before drawing your conclusions.",
      "votes": "1",
      "replies": [
        {
          "text": "We don't need to depend significantly on imports, as we have viable alternatives. We can build our own power plants to produce clean energy, generate jobs, and strive for energy independence.\nYou seem like someone who believes US was behind the coup in August to remove Sheikh Hasina. However, the reality is that the US is currently prioritizing its relationship with India, which it considers crucial for countering China's influence in the region. As a result, the US is largely allowing India to pursue its own policies without much interference. What I'm trying to convey is that, at this moment, Bangladesh isn't a primary focus for the US. Let me ask you this: how often have you heard a US leader mention Bangladesh? The answer is hardly ever. So, please consider that for a moment before drawing your conclusions.",
          "votes": "11",
          "replies": []
        }
      ]
    }
  ],
  "id": 229
}