{
  "url": "https://www.reddit.com/r/bangladesh/comments/1goj2st/changing_threads_bangladeshs_setback_fuels_indias/",
  "hash": "00dd47a70cdfebe7a078b2e9416ff737",
  "scraped_at": "2025-12-08T15:59:18.526020",
  "title": "Changing threads: Bangladesh’s setback fuels India’s RMG surge",
  "description": null,
  "votes": "18",
  "comments": [
    {
      "text": "Kalke porlam order ager theke beshi kore ashtese. Ajke dekhay order nai. Kalke bollo october e YoY 20% export increase hoise ajke bole mara khaitese.",
      "votes": "12",
      "replies": [
        {
          "text": "20% increase compared to what? Last month?\nIf the orders decrease by 30% and increase by 20%, then the overall decrease is 10%.",
          "votes": "1",
          "replies": [
            {
              "text": "YoY = Year on Year.",
              "votes": "4",
              "replies": []
            }
          ]
        },
        {
          "text": "August september order had pushed back maybe, so october increased.",
          "votes": "1",
          "replies": [
            {
              "text": "Everything is over sensationalized.",
              "votes": "6",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Bangladesh is fundamentally screwed atp",
      "votes": "3",
      "replies": [
        {
          "text": "And the real disaster is yet to come.",
          "votes": "6",
          "replies": [
            {
              "text": null,
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "-8",
      "replies": [
        {
          "text": "It is not this govt, it already happened with the andolon. This govt is trying it's best to return to what it was",
          "votes": "10",
          "replies": [
            {
              "text": "The private sector will not grow with the current interest rate, and the government plans to increase it even more. And without the private sector, there is no economy to save. BB governor changes his tone daily, there is no consistent message from the administration regarding their policies.\nThe governor single handedly destroyed all the Banks under S Alam by saying he would not support them. S Alam is already in Singapore with all the money, you can sell all his mortgaged assets, but by saying that he won't be helping the banks, he destroyed public confidence in them, now there is no deposit coming to those banks.Now he changed his tune, but the damage is already done. And the sufferer would be the normal depositors.\nThe stock market is devastated, commodity market is out of control, tourism business is reeling in the hill tracts.\nThey should go after the people who stole, not the businesses, otherwise things will be dire.",
              "votes": "5",
              "replies": []
            },
            {
              "text": "Govt is looking to see if they can line their own pockets.",
              "votes": "0",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "এগুলো বাজে রিপোর্ট। রফতানি বেড়েছে মাসে ৪০০ কোটি। আরও বাড়তে থাকবে। রফতানি বেড়েছে, রেমিটেন্স বেড়েছে, রিজার্ভ বাড়ছে।",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 230
}