{
  "url": "https://www.reddit.com/r/bangladesh/comments/1gii9a0/bangladesh_just_ignored_india_reroutes_global/",
  "hash": "8effa7c03e2f0bc84710a79933cbaee1",
  "scraped_at": "2025-12-08T16:00:23.126178",
  "title": "Bangladesh just ignored India, reroutes global textile exports through Maldives",
  "description": "Bangladesh, the world's second-largest garment producer, has opted to bypass India and ship its textiles to global markets through the Maldives, hurting the cargo revenue prospects of India's airports and ports amid strained bilateral ties, reports Mint.\nThe Indian business newspaper, citing three people aware of the development, reports that Bangladesh was rerouting its textile exports to the Maldives by sea and then dispatching cargoes by air to its global customers, including H&M and Zara.\n\"Previously, Bangladeshi goods were shipped through Indian airports, but now they are rerouting shipments from other locations,\" Deepak Tiwari, managing director of MSC Agency (India) Pvt Ltd, told Mint over the phone.\n\"This shift means India's airports and ports lose revenue previously earned from handling these cargoes,\" he said.",
  "votes": "254",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I dont understand why we have to go through others?? Bangladesh to India and Bangladesh to Maldives are such small distance and a unnecessary intermediaries for logistic reason? Why we dont have/build better facilities for ourselves?",
      "votes": "58",
      "replies": [
        {
          "text": "doesn’t have the capacity to handle everything… needs to upgrade the ports",
          "votes": "28",
          "replies": [
            {
              "text": "This is key 100% - capacity is everything in the exports business",
              "votes": "14",
              "replies": []
            },
            {
              "text": "This is airplane cargo. There was some news recently of Biman’s very high rates for freight. It is cheaper to send it to a nearby country and use another carrier to fly it away from there I guess. For some items ships take too long",
              "votes": "5",
              "replies": []
            }
          ]
        },
        {
          "text": "No deep sea ports",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "Of course this isn't a revenge or has to do with any public's personal feelings. It's business. Rerouting was necessary so they did it. I doubt it would happen if BAL was in power though.",
      "votes": "55",
      "replies": []
    },
    {
      "text": "This article is misleading! Firstly this is talking bout AIR Cargo hub port and Dubai is the largest AIR Cargo hub for us. Delhi Airport was second and now our cargo is getting diverted via Male, KL and HK mostly.",
      "votes": "17",
      "replies": []
    },
    {
      "text": "Source: https://www.thedailystar.net/business/economy/news/bangladesh-skips-india-reroutes-global-textile-exports-through-maldives-3743021",
      "votes": "10",
      "replies": []
    },
    {
      "text": "That's not cheaper, especially air shipments from Delhi, even cheaper than Dhaka. I think it's pure populist propaganda bs, which will make india increase tariffs on raw materials of textile and kick Bangladesh out of business.",
      "votes": "17",
      "replies": [
        {
          "text": "Yeah. In fact, Indian RMG manufacturers had been complaining about Bangladesh RMG flooding Delhi airports for several years now. I wouldn't be surprised if New Delhi changed a regulation to make it more difficult to transship through that airport.",
          "votes": "6",
          "replies": [
            {
              "text": "This government is rushing to bring famine as fast as they could so that all advisers and their companies ( read NGO) could get max foreign fund and Bangladesh could never graduate the ldc.",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "5",
      "replies": []
    },
    {
      "text": "the fact is bangladesh is not getting orders like few months before... if then we got 100 orders daily, now we are getting like 55-60 orders per day.... so what the fuck doing with indian or maldives when we are not getting goods orders?",
      "votes": "5",
      "replies": []
    },
    {
      "text": "",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Good, that way you can pay electricity bills to Adani before that gets cut off 😂 This whole situation reminds me of when I see a chihuahua barking at a Great Dane.\nWonder what will happen once India stops exporting cotton to your ‘textile’ industry and prefers to sell it to others. You all are dumb as a doorknob guys, seriously.\nI don’t know how much OP keeps in touch with world news. Does he know Maldives is in India camp again more or less?",
      "votes": "1",
      "replies": [
        {
          "text": "Indian detected",
          "votes": "4",
          "replies": []
        },
        {
          "text": "Typical uneducated take by a citizen of super power 2020",
          "votes": "4",
          "replies": []
        },
        {
          "text": "Adani has already stopped barking after the BD govt said they would not budge to blackmailing. Adani issued a press release saying they haven’t issued any payment ultimatum. Their hard talk via Indian media didn’t work.",
          "votes": "5",
          "replies": [
            {
              "text": "",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "we paid back 90 mil last month which is double of what we paid the month before. adani is clearly just trying to put unnecessary pressure on the interim govt even though its getting the money it asked for",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "The US government started an India boycott, so they’re preparing a backup route in case that boycott escalates.",
      "votes": "-4",
      "replies": [
        {
          "text": "US govt wont do shit. They need India for China",
          "votes": "13",
          "replies": [
            {
              "text": "But they also got pressed by India buying Russian oil, so there’s that, although you might be right if Trump wins",
              "votes": "8",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "-17",
      "replies": []
    },
    {
      "text": null,
      "votes": null,
      "replies": []
    }
  ],
  "id": 234
}