{
  "url": "https://www.reddit.com/r/bangladesh/comments/1gdx9cs/local_printing_press_to_publish_new_books_kicking/",
  "hash": "a0dab826e869f04d40424ec7be783ad9",
  "scraped_at": "2025-12-08T16:02:33.365234",
  "title": "Local printing press to publish new books, kicking out Indian company",
  "description": "The National Curriculum and Textbook Board (NCTB) is working to revise and distribute textbooks based on the 2012 curriculum. Some of the work had initially been assigned to Indian companies. However, following criticism, they were removed, and the responsibility of printing textbooks was handed over to local printing presses.\nOn Monday (October 28), NCTB Chairman Professor AKM Riazul Hasan confirmed this information to The Daily Campus. He said, \"Indian companies were assigned 18 slots for printing textbooks, but those have now been canceled. After canceling their contracts, we reissued a tender notification, and all the work was awarded to local companies.\"\nHe further added that the NCTB is working to revise next year’s textbooks based on the 2012 curriculum. Books for grades one and two have already been sent to the presses, and books for other grades will be sent gradually. \"We hope to complete all the work by December,\" he said.\n\"We are doing our best to ensure that students receive the revised textbooks by January. Printing companies involved in this process have been instructed to deliver the new books by December 31,\" he added.",
  "votes": "110",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "ছিঃ ছিঃ এ কি করছেন? আগেই ভালো ছিলো। দাদা রা এই কারণেই ত আমাদের আজ জঙ্গী বলছেন। 🤪🤪🤪",
      "votes": "11",
      "replies": []
    },
    {
      "text": "For decades we had been publishing our own school and college textbooks without any hitch. Why was this job given to an Indian press in the first place?",
      "votes": "14",
      "replies": [
        {
          "text": "Comparative advantage - they can make those books relatively more cheaply, and it frees up Bangladeshi resources towards other production.\nIndia produces many times more books (even in Bengali).\nEconomies of scale result in cheaper books in Bangladesh, and an ability to invest any remaining cash into areas Bangladesh has an comparative advantage (textiles, jute).\nPeople totally forget that trade is beneficial, even with India.",
          "votes": "-3",
          "replies": [
            {
              "text": "Bangladesh is not nepal or srilanka Bangladesh has economies of scale and Bangladesh needs the capacity. Instead of building capacity they decided to starve one of the pillar industries for our cultural and intellectual development. This is a crime to the level of treason.",
              "votes": "7",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Would be nice to know the names of the local companies",
      "votes": "11",
      "replies": [
        {
          "text": "i suppose if you ask for it they are bound to publish it under right to information act...if the info isn't already public",
          "votes": "10",
          "replies": []
        }
      ]
    },
    {
      "text": "Source: https://thedailycampus.com/education-ministry/158050/",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Desh will become Afghanistan if this happens guys! beware! This is so wrong and terroristic you guys will understand in 5 years!!1!",
      "votes": "1",
      "replies": [
        {
          "text": "indian press really helped with keeping religious extremism outside and lgbt more importantly secular topics inside. but since they're not in the picture who knows what extremist ideas the mollah's will smuggle inside the children's books.",
          "votes": "-1",
          "replies": [
            {
              "text": "0/10 worst ragebait ever composed",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "Supporting local businesses instead of foreign ones will turn our country to Afghanistan???? So be it ig",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "অতীতে ভারতীয় ব্যবসায়ীরা টেন্ডারের অবাস্তব সর্বনিম্ন মূল্য প্রস্তাবের মাধ্যমে কাজ বাগিয়ে সেই কাজ মোটা লাভ রেখে দেশীয় ব্যবসায়ীদের কাছে বিক্রি করতো। ভারতীয়দের অতিরিক্ত লাভ, কাঁচামালের মূল্য বৃদ্ধি আর দেশীয় ব্যবসায়ীদের লোভের ফলাফল হতো নির্ধারিত সময়ের বাইরে নিম্ন মানের বই উৎপাদন। এর কারণে প্রতি বছর শিক্ষাবর্ষ শুরু হবার দুই তিন মাস পেরিয়ে গেলেও অনেক শিক্ষার্থী সময় মতো বই পেতোনা, পেলেও পেতো নিম্ন মানের বই।\nভারতীয় ব্যবসায়ীদের হঠালেও মনে হয়না দেশীয় ব্যবসায়ীদের লোভ হঠানো যাবে। তাই খুব বেশি আশাবাদী হতে পারছিনা।",
      "votes": "0",
      "replies": []
    }
  ],
  "id": 242
}