{
  "url": "https://www.reddit.com/r/bangladesh/comments/1g2nw84/cabbage_now_costs_tk_70_will_your_next_salad/",
  "hash": "c1cd39101aa8cdb3c820bc506df3699b",
  "scraped_at": "2025-12-08T16:03:10.067321",
  "title": "Cabbage now costs Tk 70?! Will your next salad require a bank loan?",
  "description": "https://www.thedailystar.net/life-living/news/cabbage-now-costs-tk-70-will-your-next-salad-require-bank-loan-3726616",
  "votes": "43",
  "comments": [
    {
      "text": "Small loan you say!",
      "votes": "18",
      "replies": []
    },
    {
      "text": "I went grocery shopping yesterday, and nobody actually knows the reason behind this sudden price hike.",
      "votes": "22",
      "replies": [
        {
          "text": "Bonna. Shop owners all say bonna",
          "votes": "15",
          "replies": []
        },
        {
          "text": "2 major back to back floods. first feni and now sherpur",
          "votes": "13",
          "replies": []
        },
        {
          "text": "the flood and lack of imports",
          "votes": "11",
          "replies": [
            {
              "text": "The price would be the same with or without floods. in the pre winter market vegetables price has always been very high for the past few years.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Loan? Thank God we have a lender running the country",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Bullshit",
      "votes": "6",
      "replies": [
        {
          "text": "Bullshit",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "বাজারে কোন কারসাজি হচ্ছে কিনা সেটা যেমন খতিয়ে দেখা দরকার তেমনি ১৬ বছর ধরে দিনে দুপুরে চলা লুটপাটের পর এরকম বন্যা পরিস্থিতির শিকার হতে হলো তখন তো ধৈর্য্য ধরতেই হবে। BALর পতনের একটা বড় কারণ ছিলো হরিলুটের শিকার হওয়া অর্থনীতি!",
      "votes": "3",
      "replies": [
        {
          "text": "সরকার কঠোর হলে বাজার ব্যবস্থা নিয়ন্ত্রণে ১ সপ্তাহের বেশি লাগার কথা না। চাঁদাবাজ, সিন্ডিকেট, দালাল সব আগের মতই আছে। নাই শুধু BAL। নিরপেক্ষ সরকারের অধীনে বাজারের যদি এই অবস্থা হয় পক্ষীয় সরকার ক্ষমতায় বসলে কি হবে সেটা একবার ভাবেন। ১৫ বছরের দোহাই দিয়ে আর কত!",
          "votes": "5",
          "replies": [
            {
              "text": "কেউই এই অবস্থা প্রত্যাশা করে না, কিন্তু বাস্তবতা উপেক্ষা করার সুযোগ কোথায়?! BAL কোথায় নাই? পুলিশ থেকে প্রশাসন, আর্মি সব কিছুই BALএ ভরপুর! তত্ত্বাবধায়ক সরকার ঠিক কি পরিস্থিতিতে আছে তা বাইরে বুঝা মুশকিল, অন্তত এখনো পর্যন্ত BALর ভূমিকায় নামে নাই এতটুকু বলা যায়! পুলিশ কিংবা প্রশাসনের যারা সরকারি সিদ্ধান্ত বাস্তবায়নে প্রত্যক্ষ বা পরোক্ষভাবে বাধা দিবে বা দিচ্ছে তাদের বিরুদ্ধে কঠোর ব্যবস্থা নেয়া দরকার!",
              "votes": "-3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Lol the main thing is the country is free. So everyone should rejoice. So what eggs are 200tk for a dozen. My cousin just told me. This is exactly what the people of bangladesh wanted.",
      "votes": "1",
      "replies": [
        {
          "text": "Wouldnt let a bitch who killed more than 600 people dictate me.",
          "votes": "4",
          "replies": [
            {
              "text": "That's perfectly fine. Just smile when you are buying your expensive groceries.",
              "votes": "-2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "So after the syndicate broke up, the sellers are still selling vegetables at high prices to profit off us. They're using various reasons like flood etc, but they are still paying the same amount of money to the farmers they used to pay in the past and ramping up the prices.\nHonestly, I don't even know why people can't better themselves.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "কষ্টের কথা মানুষ অশিক্ষিত ১৬ বছর কষ্ট করে একটা বন্যার পরে দাম বারসে তাই আন্দোলন মাড়ায় এত জ্যাম এর মাঝে।সরকার এর কি এত চুলকায় যে ইচ্ছা করে দাম বাড়ায় দিবে জখন আওয়ামীরা শুজুক খুজতেসে সমালোচনা করার।",
      "votes": "0",
      "replies": [
        {
          "text": "ভাই কোন সরকারই ইচ্ছা করে দাম বাড়ায় না। সরকার দাম নিয়ন্ত্রণ করতে পারে না বলে দাম বাড়ে। এই নিয়ন্ত্রণ করতে না পারাটাই সরকারের ব্যর্থতা যার দায় সরকারকেই নিতে হয়। সে যে সরকারই ক্ষমতায় থাকুক।",
          "votes": "11",
          "replies": []
        }
      ]
    },
    {
      "text": "This isn’t the season for cabbage. Why would you expect vegetables that are out of the season to be cheap? Rather you should ask why in season vegetables are expensive.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "-9",
      "replies": []
    },
    {
      "text": "Government should open the border and start importing. Only way to punish BAL syndicate.",
      "votes": "-3",
      "replies": []
    },
    {
      "text": "",
      "votes": "-7",
      "replies": []
    }
  ],
  "id": 244
}