{
  "url": "https://www.reddit.com/r/bangladesh/comments/1fy60kb/hasinas_tyrannical_regime_in_numbers/",
  "hash": "440da6f320e8e84859570183d8dc0879",
  "scraped_at": "2025-12-08T16:04:01.414919",
  "title": "Hasina's tyrannical regime in numbers.",
  "description": null,
  "votes": "395",
  "comments": [
    {
      "text": "She is actually scarier than she seems",
      "votes": "14",
      "replies": []
    },
    {
      "text": "Wow. It's hard to believe it's r/bangladesh",
      "votes": "57",
      "replies": [
        {
          "text": "Yeah! I rechecked the sub 🤣",
          "votes": "22",
          "replies": [
            {
              "text": "Which other sub does this?",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Meanwhile Parents Uncles Aunts Say, \"These poor people are lazy, don't want to work. Look there are many jobs, They are getting more many than us... Yet they still choose to live in streets and want money, dont want to do a work...\" 🙄🙄🙄🙄🙄",
      "votes": "54",
      "replies": [
        {
          "text": "This is how they deal with guilt and do not feel accountable.",
          "votes": "12",
          "replies": []
        },
        {
          "text": "হ্যা খালাম্মা গ্রুপ থেকে একই অভিযোগ কাজের বুয়া পায় না। যখন জিজ্ঞাসা করি বেতন কত দিবেন বলে মাসে তিন হাজার। খালাম্মা গ্রুপ সেই লেভেলের স্বার্থপর।",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "You forgot she is also a fascist and capitalist Indian puppet regime.😅",
      "votes": "46",
      "replies": []
    },
    {
      "text": "wipe whole boast mighty juggle squeal one insurance marble steer\nThis post was mass deleted and anonymized with Redact",
      "votes": "21",
      "replies": []
    },
    {
      "text": "এই subreddit এর ইন্ডিয়ান আর দালাল গুলি কই ?",
      "votes": "20",
      "replies": [
        {
          "text": "beshirvag r/Dhaka te shift korse",
          "votes": "8",
          "replies": []
        }
      ]
    },
    {
      "text": "Historic Article.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "The Daily Star has posted the original article.\nPlease give it a read when you have the time: https://www.facebook.com/DailyStarNews/posts/871366111811336",
      "votes": "39",
      "replies": []
    },
    {
      "text": "kire r/bangladesh er post eta? im still rechecking",
      "votes": "22",
      "replies": []
    },
    {
      "text": "",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Finally some pretty infographic",
      "votes": "12",
      "replies": []
    },
    {
      "text": "It's a total Disaster. Also, she almost sold our country. Though she has successfully crippled the economy.",
      "votes": "17",
      "replies": []
    },
    {
      "text": "Thank you OP.",
      "votes": "20",
      "replies": []
    },
    {
      "text": "Yall this is just capitalism",
      "votes": "13",
      "replies": [
        {
          "text": "Capitalism only works properly in free markets. Do you not see how 4–5 companies dominate every sector and set their own prices?",
          "votes": "15",
          "replies": [
            {
              "text": "The main critic of capitalism it stops being free. There isn't a reset button, it'll end with a monopoly",
              "votes": "5",
              "replies": []
            },
            {
              "text": "Capitalism only works with the exploitation of the labour of workers by the capital owning class, and it only works with infinite unsustainable growing of profits, that is to say never",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "-13",
      "replies": [
        {
          "text": "Ah yes classic gas lighting technique is ba k by the supporter of mass murderer regime",
          "votes": "12",
          "replies": []
        }
      ]
    },
    {
      "text": "The country is going more right wing/religious, so I expected the quality of our newspaper articles and everything going worse too but this is Facebook type peak comedy 🤣 by our media. Is this what media fought for to blame everything on Hasina/Bal just like Hasina did to BNP-jamat 🤣? (they have realised what type of newspaper article sells, tho). Downvote me and pat each other's backs in the comments and you will need more articles like these for your little therapy sessions, I guess.\nEDIT: I am almost sure that one day Prothom Alo/Daily Star will write about how good Sharia Law is or Islamic economic system but will claim Jamat forced them to write and some stupid liberals will continue to blindly support everything Prohom Alo/Daily Star writes.",
      "votes": "-3",
      "replies": []
    },
    {
      "text": "",
      "votes": "-25",
      "replies": [
        {
          "text": "Oh she is a saint as she does the tahajjud praying",
          "votes": "16",
          "replies": []
        },
        {
          "text": "হাসিনা পুত্র এবং কন্যা যে বিলিয়নেয়ার এতে কোন সন্দেহ আছে। দুই লাখ দিয়ে ট্রাম্পের লবিস্ট নিয়োগ দিল। একটা উদাহরন দেই, হাসিনার মেয়ে পুতুলের ডিভোর্সের সময় তার শশুরবাড়ীর উপর হাসিনা বিলা ছিল। সেই কারণ হাসিনার প্রশাষন পুতুলের চাচা শশুরের নামে দুই হাজার কোটি টাকা পাচারের মামলা করেছে। একবার চিন্তা করেন যদি তারা চাচা শশুর দুই হাজার কোটি টাকা মেরে নেয় তাহলে তারা নিজেরা কত মেরেছে।",
          "votes": "8",
          "replies": []
        },
        {
          "text": "Classic excuse of “Amma Jane Na” and “Take Vhul Bujhano Hoy”",
          "votes": "33",
          "replies": []
        },
        {
          "text": "Have you been living abroad for a long time ? Genuine question.\nHaving said that, at the top level nothing happened without her consent, that is how it was before 5th August.\nLook how many of her close associates made over 100m through corruption. Do you think she didn't know ? If she didn't, then that makes her a poor leader, unfit for office. And, if she did, well let's say she has a big bank account.\nThink for yourself which one is more likely.",
          "votes": "22",
          "replies": []
        },
        {
          "text": "None of it could be done without her approval. Whatever her party did went through her and she is accountable.",
          "votes": "12",
          "replies": []
        },
        {
          "text": "Salman f Rahman said that S Alam used to give a percentage of every money he made. In the name of \"digital Bangladesh\" his son scammed people using governments name. You will find thousands of report regarding that even during hasinas reign but they didnt directly mention jays name. So I think you are blind regarding this issues or forced yourself not to see.",
          "votes": "12",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-29",
      "replies": [
        {
          "text": "Whould you be kind enough to elaborate?",
          "votes": "29",
          "replies": []
        }
      ]
    }
  ],
  "id": 247
}