{
  "url": "https://www.reddit.com/r/bangladesh/comments/1fws9bl/rooppur_nuclear_power_plant_cost_compared_to/",
  "hash": "881ca1f9bcf4a67a01e18757db17da92",
  "scraped_at": "2025-12-08T16:04:39.738494",
  "title": "Rooppur Nuclear Power Plant Cost Compared to Other Nuclear Plants",
  "description": "Since the Rooppur Nuclear Power Plant Project started, many Bangladeshi experts have raised concerns about its high costs, pointing out that similar plants in other countries are often constructed for around half the price. The new governor of Bangladesh Bank even suggested in 2021, when he worked at CGS, that a project like this should cost around $3 billion. However, it seems like these experts focus their comparisons on countries with a domestic nuclear industry and experienced workforce, often ignoring those without such resources.\nUpdated figure",
  "votes": "25",
  "comments": [
    {
      "text": "This is the problem with direct peer comparisons, the details make a huge difference. You'll even find recent plants in the US which cost close to 2x of Rooppur Plant.\nIf the 2nd plant cost similar to the first one, then I'd be more concerned TBH. The first one will have a lot of external infrastructure costs involved which the future ones will not have to bear in entirety.",
      "votes": "16",
      "replies": [
        {
          "text": "You are right. The two AP-1000 units at the Vogtle Nuclear Power Plant, which began operations last year, were constructed at a cost of $36 billion.\nI think if the second plant ever gets built, it would end up costing about $1 billion to $2 billion less if Govt goes with an open tender for the vendor. But I don’t expect the cost to drop by half since we’ll still be relying on foreign companies for construction and commissioning, unlike India and China.",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "Picture: Original Content",
      "votes": "4",
      "replies": []
    },
    {
      "text": "People who want to criticize RNPP project are doing it from a wrong angle. While certain level of economic problems was certainly the case (and from personal experience i can say that logistics alone is a pure nightmare, driving the costs ever further), this is not the main issue of this project. What is that issue, however, is the fact that, according to the terms of contract, russians are going to leave 1 year after the plant becomes operational. Completely. Meaning, BAEC will be left alone to operate the plant.\nNow, look around. Look at the streets, look in the news. At Islamic radicals, rising to power. At extremely uneducated population. At the decades of spectacular mismanagement on every governmental level.\nBangladesh can’t even sort out their waste management, with streets drowning in trash and refuse. Do you really believe it can manage the nuclear power plant? Personally, i won’t stick around to find out.",
      "votes": "0",
      "replies": [
        {
          "text": "Nuclear waste from a nuclear power plant is not disposed of like regular waste. Once the spent fuel cools down sufficiently, it will be placed in dry casks designed to provide radiation shielding and impact resistance. These casks will then be transported to Russia for reprocessing, where plutonium and uranium will be separated for further use in nuclear reactors. The rest of the waste will be sent for final disposal.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "There are some topic where you should fully depend on experts. NPP is surly comes in top 3.\nOn some general things,\nDid we have n open international tender where big companies can compete?\nDid we form a committee with Bangladeshi born experts, : Note: yes we have professionals working on NPP in many counties\nDid we do public discourse?\nNow a little technical\nDo you know geology affects 20-30% of the cost?\nDo you know source of cooling water will have large impact given in summer we will face shortage?\nDo you know civil work could have been done by local engineering farm?\nDo you know we have not employed our engineers even after training them?\nstop wasting time",
      "votes": "0",
      "replies": [
        {
          "text": "No, the government did not float an open tender.\nNo, there was no such committee.\nNo, there was none.\nI know that geology affects the cost. For example, the seismic design had to be improved compared to the reference plant in Novovoronezh.\nBecause of the cooling towers, the water needed will be 2.6 m³/sec, which is a lot less than the 266 m³/sec flow rate during the dry season. So there wont be any problems associated with water shortage.\nWho told you that local engineering firms were not involved?\nWe sent some students for BSC degrees and others for MSC degrees on scholarships. Those who pursued higher studies didn't receive training to operate the plant, as it wasn't part of their program. After returning from Russia, they took an exam administered by NPCBL. Those who passed secured jobs, while those who didn't were not hired.\nThanks for looking out for me.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Come on now, it's like having a 1.5ton AC in a 10×10 ft dorm room.",
      "votes": "-4",
      "replies": [
        {
          "text": "I dont think that's a good comparison. While a 1.5 ton AC maybe excessive for a small room, a big nuclear power plant in a small amount of area is a good use of area in Bangladesh as it can produce most amount of energy with the least amount of land.",
          "votes": "10",
          "replies": [
            {
              "text": "",
              "votes": "-8",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "This is about purchasing the core. Pakistan is a good comparison point. Existence of Pak nuclear industry won't make much of a difference. I would attribute the difference between Pak and BD to corruption.",
      "votes": "-1",
      "replies": [
        {
          "text": "It's not only about purchasing the core. It is also about the costs associated with Engineering, Procurement, Construction, and Commissioning for the entire power plant.\nPakistan is neither a newcomer country nor building the same design.",
          "votes": "1",
          "replies": [
            {
              "text": "পাকিস্তানের ইঞ্জিনিয়ারিং এতই ভাল যে এক এক core এ প্রায় দুই বিলিয়ন ডলার বাচিয়ে দিতে পারে তাহলে পাকিস্তানকে তারা যে ব্যর্থ রাষ্ট্র বলত তা চরম মিথ্যা।",
              "votes": "0",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "পোস্টে পরিস্কার কিছু আসে নাই, এক্সপার্টদের আনএক্সপার্ট ভাবারও কিছু আসে নাই! ভারতের বিশেষজ্ঞ থাকাতে খরচের একটা ইনসিগনিফিকেন্ট ফ্র্যাকশন কমার কথা, কারণ টেকনোলজি আসছে রাশিয়া থেকে! শুধু এই বিষয় বর্ধিত খরচের পুরোটা নিতে পারে না! আর বিগ টিকিটের প্রজেক্টে বড় দুনম্বরি থেকে নিজেদের দূরে রাখবে অন্তত এমন কোন দল BAL না! এছাড়াও প্রজেক্টটা নেয়ার সময় আন্তর্জাতিক রাজনীতিকে আমলে নেয়া হয় নাই এটা পরিষ্কার!",
      "votes": "-1",
      "replies": [
        {
          "text": "You can read the research paper I linked and learn more about why there is a difference in cost by yourself.\nInternational politics was definitely a factor. A clear sign of that is Bangladesh chose a Russian design instead of a Chinese one. If Bangladesh had gone with China's offer, it would have ruffled some feathers in New Delhi.",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 249
}