{
  "url": "https://www.reddit.com/r/bangladesh/comments/1on8kg5/only_798_billion_borrowed_from_russia_for_rooppur/",
  "hash": "2f0d119be95d59798b198bec5b8dca98",
  "scraped_at": "2025-12-08T15:03:25.309781",
  "title": "Only $7.98 Billion Borrowed from Russia for Rooppur Nuclear Power Plant Construction as of June 30, 2025",
  "description": "Many people in Bangladesh believe the total cost of the Rooppur Nuclear Power Plant is $12.65 billion, with $11.38 billion or 90 percent already borrowed from Russia. However, this is inaccurate.\nBy the end of the fiscal year 2024-2025, only $7.98 billion of the $11.38 billion in export credit has been borrowed from Russia for the construction of the Rooppur Nuclear Power Plant, as detailed in the Annual Report 2024-2025 from the Economic Relations Division. Given that both reactors are over 90 percent complete, I highly doubt the total construction (EPC to be accurate) cost would exceed $10.5 billion.\nSource: https://erd.portal.gov.bd/sites/default/files/files/erd.portal.gov.bd/page/140d8a52_cc5e_46e2_aa87_687b38564bed/%E0%A6%AA%E0%A7%8D%E0%A6%B0%E0%A6%A4%E0%A6%BF%E0%A6%AC%E0%A7%87%E0%A6%A6%E0%A6%A8%20%E0%A6%AA%E0%A6%BF%E0%A6%A1%E0%A6%BF%E0%A6%8F%E0%A6%AB.pdf\nPage 40 of ERD's Annual Report",
  "votes": "90620",
  "comments": [
    {
      "text": "",
      "votes": null,
      "replies": []
    },
    {
      "text": "Sorry, but do explain to the ignorant me, but how would knowing how much we borrowed from Russia tell us how much the plant cost? Unless you are saying we are making the plan entirely or even largely on the loan money?",
      "votes": null,
      "replies": [
        {
          "text": "Total estimated cost of the project is $12.65 billion, and Russia has said that it is willing to finance up to 90% of this cost, which is $11.38 billion. So if we know how much we have borrowed from Russia until now, we can roughly estimate how much it would cost in the end as they are going to provide most of the loan. Now do you understand?",
          "votes": null,
          "replies": [
            {
              "text": "Yes thank you i glossed over the 90% of the cost part.",
              "votes": null,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Bangladesh has seen a remarkable shift in infra over the past 30-40 years. We were at time of independence significantly poorer than most African countries. Everyone shits on our governments across political parties but compared to our actual peer countries, we have done remarkably well",
      "votes": null,
      "replies": []
    },
    {
      "text": "this is good, if Bangladesh develops its own power faster it will really help us in 10-20 years",
      "votes": null,
      "replies": []
    },
    {
      "text": "So you are saying Russia is doing this for free? no profit for them?",
      "votes": null,
      "replies": [
        {
          "text": "When did I say that? I suggest you read my post again.",
          "votes": null,
          "replies": [
            {
              "text": "I suggest you to think deep you will have many answers.",
              "votes": null,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Costs is not paid in real time. There may be billions which were not yet invoiced, or were invoiced, but not yet approved by Bangladesh authorities, or were approved but not yet paid.\nThe project is expected to cost $17 billion per reports last year.",
      "votes": "1",
      "replies": [
        {
          "text": "This is from the official report released by the Ministry of Finance. The Planning Commission also publishes reports that include expenditure figures for each fiscal year from FY19-20. I encourage you to have a look at those, rather than relying solely on claims made by newspapers and so-called \"experts.\" You can also read Russian Embassy's press release from last year to get an idea about the cost.",
          "votes": "1",
          "replies": [
            {
              "text": "No one has claimed the project will finish under budget. The second unit wont even start until at least 2027. It will be surprising if even Unit 1 starts before 2027. So there are many years of cost past June 24.\nBut believe what you will.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "It’s not yet completed though is it? I doubt the second unit is 90% complete. And even if the reactors are complete many supporting technology and equipment are needed. I hope there's no cutting corners for cost 🥲",
      "votes": null,
      "replies": []
    }
  ],
  "id": 26
}