{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oixh0s/what_explains_the_crash_in_2023_which_bangladesh/",
  "hash": "676a15a3f5f0b2cdbccbcadf0a001457",
  "scraped_at": "2025-12-08T15:05:33.762121",
  "title": "What explains the crash in 2023 , which Bangladesh didn’t even face during the pandemic ?",
  "description": "Also Was India poorer than Bangladesh for a FULL 4 YEARS ?\nhttps://data.worldbank.org/indicator/NY.GDP.PCAP.CD?locations=BD-IN",
  "votes": "31",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Yup, India was below in GDP than Bangladesh. The whole AAP YT gang celebrated that like Eid.",
      "votes": "20",
      "replies": [
        {
          "text": "",
          "votes": "-18",
          "replies": [
            {
              "text": "That was the data of the World Bank. Not any Gov.",
              "votes": "21",
              "replies": []
            },
            {
              "text": "Read the report again. They looked at only one variable. 'Economic output per MW electricity consumption.' This is no proper way of estimating GDP of an entire nation",
              "votes": "4",
              "replies": []
            }
          ]
        },
        {
          "text": "Who",
          "votes": "1",
          "replies": [
            {
              "text": "Every one of them",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "India faced a \" Twin trap - Low Income Trap, Demand Trap\" during 2023. Rising inequality, slow formal job creation and lower consumer demand, especially among lower income groups. Due to Ukraine war, soaring energy and commodity prices hit India as a major importer, leading to inflation and higher input costs. The private sector lost confidence amidst global uncertainty lead to stalling GDP per capita growth despite government spending efforts. As a result, India's per capita GDP fell below Bangladesh's in 2023, reaching around $2,480, while Bangladesh managed $2,551.\nIn contrast, Bangladesh showed notable macroeconomic resilience during that period. Yes, there was pressure on reserves and inflation, but the robust performance of the RMG (ready made garments) sector and steady remittance inflows helped Bangladesh absorb external shocks more effectively than India.\nYeah , for several years, Bangladesh's GDP per capita was higher than India's. But \"poorer\" is a complex term, economic growth and development depend on broader criteria, not just one macroeconomic indicator. That's why it's always important to look at the full spectrum of development, beyond GDP numbers alone.",
      "votes": "13",
      "replies": [
        {
          "text": "Wtf is this ai slop ??",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Some reports claim that Bangladesh had been misreporting the national reserve and GDP per capita for several years post 2015, as reports concerning vast amounts of money laundering also start around that time. Our dollar reserve, for example, hit an all-time high at 48 billion in 2021, but for some reason fell to 24 billion or exactly half just three years later. There are hints of the demon's government making use of foreign loans to inflate the national reserve numbers, likely to sell the narrative of progress and strong economic development under their governance.\nAs for what caused this apparent sudden drop in reserves, It's likely a combination of several factors. Bangladesh was struggling to pay foreign companies for it's gas and coal imports in 2023, and the Dollar basically disappeared from the free market overnight. This was right after the then-government had just celebrated their success in navigating through covid without suffering significant economic disruption. Severe government incompetency and complacency also started to show up in many places, likely due to some bad actors getting ahead of themselves with their corruption.\nThere is sufficient evidence to indicate several tens of billions of Dollars have been laundered over the demon's 15-year regime; the last time our reserves had been this low was before 2016, assuming that data is reliable at all, meaning we haven't really progressed much in the global economy over the last 10 years.\nIn light of this sharp decline in reserves, price of the Dollar (which itself has seen severe inflation in recent years) against BDT rose by a staggering 40-45%, leading to unprecedented levels of inflation and price hikes in the nations' 54 year history. Thus the average person became poorer by a significant margin overnight. I was a student studying abroad at the time, and I directly felt the consequences of this event. My expenses (in taka) went up by 50% for no apparent reason and receiving money via international wire transfer became increasingly challenging.\nIt's unthinkable how far we've been set back by such incredible levels of corruption. By all accounts our GDP per capita should be way, way higher than India right now, yet here we are. Our national output doesn't align with our wealth and quality of life.",
      "votes": "6",
      "replies": [
        {
          "text": "",
          "votes": "2",
          "replies": []
        },
        {
          "text": "You are absolutely right.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "And I belive electricity not the right thing to compare as it punishes those who are sustainable.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Their GDP contracted during Covid",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 34
}