{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ogkw2g/ohhh_nooo_how_will_they_blame_hindus_now/",
  "hash": "3bff04ae260beea9e820c5a88f50fc2b",
  "scraped_at": "2025-12-08T15:07:41.908922",
  "title": "Ohhh nooo how will they blame hindus now 😢",
  "description": null,
  "votes": "73",
  "comments": [
    {
      "text": "Another distraction from Quasemi running desi epsteins island",
      "votes": "47",
      "replies": [
        {
          "text": "Exactly.",
          "votes": "13",
          "replies": []
        },
        {
          "text": "More info on that please.",
          "votes": "3",
          "replies": [
            {
              "text": "He's part of an org called Ideal Marriage Bureau who have been exposed as supplier of woman to rich people to bang then divorce. He himself is a proud pedophile.",
              "votes": "11",
              "replies": []
            }
          ]
        },
        {
          "text": "Have you heard him saying he wants to marry off his daughter to his father in law? His family tree is weirder than Game of thrones & dark combined.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Dudes face look like he's bout to drop a black metal album 🤘",
      "votes": "53",
      "replies": [
        {
          "text": "These morons are trying hard to destroy our peaceful country. And also they hate any form of music, including black metal",
          "votes": "16",
          "replies": []
        }
      ]
    },
    {
      "text": "r/ConservativeBangla right now😢",
      "votes": "34",
      "replies": [
        {
          "text": "https://www.reddit.com/r/ConservativeBangla/comments/1ofmji6/চঠ_দয়_ভরতর_পকষ_কথ_বলত_বলত_ইসকন_কথ_ন_শনয়_হতয_চষট/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button\nhttps://www.reddit.com/r/ConservativeBangla/comments/1oe46dr/ইমমক_গম_কর_শকল_বধ_ভরত_পচরর_চষট/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button\nLOLLL",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "Not even arab states banned iskon ! But the jamati-type organizations are banned in central Asia, Egypt, uae and Saudi 🤡",
      "votes": "45",
      "replies": [
        {
          "text": "Afghanistan banned Moududi!!! lmaoo",
          "votes": "33",
          "replies": []
        },
        {
          "text": "Bhai, Moududi is banned in Afghanistan. Even Jamaat is radical to f'in Talibans.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Inb4 we have the same group of people who glaze police all day now call their beloved child killers \"ISCKON\" 🥰",
      "votes": "15",
      "replies": []
    },
    {
      "text": null,
      "votes": "15",
      "replies": []
    },
    {
      "text": "Listen in Bangladesh a popular Muslim tv personality got killed at his home by Muslims who belong to other school of faith then how you don't doubt Muslim group of different school when a hujur gets abducted?\nP.s. I'm not hating on Islam. I try to follow Allah's path according to my caliber. So don't take my comment as hate. It's a fact. Muslims are bigger enemy of fellow Muslims in bd.",
      "votes": "11",
      "replies": [
        {
          "text": "There are two possibilities. Either he is saying the truth, or he is lying. In either case, it is unacceptable to use this as an excuse to target all Hindus in general. Just like how it is unacceptable to target all Muslims due to Muslim extremists.\nNow that being said, there is plenty of reasons to doubt he is saying the truth. Just listen to what he says here and read the narrative. He is just an ordinary imam, why should someone target him like this? It sounds awfully convenient to incite a communal riot, isn't it?\nমুহিবুল্লাহ মিয়াজী আরও বলেন, ১১ মাস ধরে তাঁকে বেনামি চিঠি দিয়ে হুমকি দেওয়া হচ্ছিল। এসব চিঠিতে তাঁকে অখণ্ড ভারত ও ইসকনের পক্ষে কথা বলতে বলা হয়। বাংলাদেশের ধর্মভিত্তিক দলগুলো ও বিএনপি-এনসিপির বিরুদ্ধে কথা বলতে বলা হয়। সর্বশেষ গত ২১ অক্টোবরের চিঠিতে তাঁকে কোরআন, ইসলাম, আল্লাহ শব্দ বলতে নিষেধ করাসহ বিভিন্ন বিষয়ে কথা বলা হয় বলে তিনি দাবি করেন।\nNote that even if he is telling the truth, it is very likely his abductors only care about creating chaos and anarchy to serve their purpose and nothing else.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "বলসিলাম, ভ্যাসলিন পকেটে রাখতে। 😜",
      "votes": "5",
      "replies": []
    },
    {
      "text": "What is the fuck \"including ISKON\" mean?",
      "votes": "5",
      "replies": [
        {
          "text": "Bangu Chagus are calling for Hindu genocide because they thoght ISCKON did this.\nBig heartbreak of Bangu Chagus.",
          "votes": "18",
          "replies": []
        }
      ]
    },
    {
      "text": "Haha, well said 👏👏",
      "votes": "8",
      "replies": [
        {
          "text": "Haha, well said 👏👏",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "The newspaper should be sued for an intentional misleading headline!",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Who the hell is gonna abduct a hogor? 😆",
      "votes": "2",
      "replies": []
    },
    {
      "text": "People are so god damn stupid in Bangladesh. Its clear how little people have read or traveled if they think Krishnas -- eg Iskon -- is some kind of threat group. You bloody fools let the Jamaat and the other fundos run rampant, and now they are gonna spend the next ten years undoing everything the BNP try to accomplish.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "They will find a way",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Mr.গফুর নাটক 2.0 😂",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Oh no, they have to create a new reason to blame now 😬",
      "votes": "1",
      "replies": []
    },
    {
      "text": "It's not misleading. It fits perfectly when you consider there is a massive disinformation campaign using ISKCON to target Hindus. Firstly, you can't do that even if ISKCON is behind this incident. And secondly, as you mentioned, the case isn't solved yet. So why jump to conclusions and blame ISKCON and Hindus? This post wouldn't exist without the hate campaign.",
      "votes": "6",
      "replies": [
        {
          "text": "It's not misleading. It fits perfectly when you consider there is a massive disinformation campaign using ISKCON to target Hindus. Firstly, you can't do that even if ISKCON is behind this incident. And secondly, as you mentioned, the case isn't solved yet. So why jump to conclusions and blame ISKCON and Hindus? This post wouldn't exist without the hate campaign.",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "Can people just hate rapists period instead of hating rapists only if it benefits their religious animosity??",
      "votes": "1",
      "replies": []
    },
    {
      "text": "what about the threats he was receiving after talking about hindutva love traps?",
      "votes": "1",
      "replies": []
    },
    {
      "text": null,
      "votes": "0",
      "replies": []
    }
  ],
  "id": 42
}