{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ogcnwi/dhaka_metro_costs_5_times_indias_jica_review/",
  "hash": "b4696cb46dc8aba912a3fe56a92fb47e",
  "scraped_at": "2025-12-08T15:08:02.724161",
  "title": "Dhaka Metro costs 5 times India's: Jica review sought to cut millions",
  "description": null,
  "votes": "69",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I'd be so pissed if they use this as an excuse to cut back on the full plan. Dhaka metro is one of the few good things to have ever happened to this fuckass city and I really hope they can finish it",
      "votes": "26",
      "replies": [
        {
          "text": "MRT-4 is unlikely to happen cause railway authority is planning on covering the same path with less cost. MRT-6 is almost finished, MRT-1/5north depo is almost done so that’s definitely happening. That leaves MRT-5 south and MRT-2.\nIt’s up to the next govm really if they wanna continue expanding the metro but I think it’s really necessary and 6 lines aren’t enough. It should cover the greater Dhaka as well. It will for sure boost productivity in nearby regions.",
          "votes": "8",
          "replies": [
            {
              "text": "I feel like politically speaking they should continue the project. Otherwise people will complain about MRT being unfinished and people will have second thoughts about the previous bloody government.",
              "votes": "6",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Dhaka metro is import heavy, Japanese standard and foreign build first time project while Patna metro is a domestically built standardized system using local cheaper work force.\nAlso Dhaka metro is highly elevated due to densely populated zones in the city. Patna metro is not that highly elevated. Due to Covid 19 Dhaka metro project time was extended too.\nChatgpt",
      "votes": "16",
      "replies": [
        {
          "text": "Can I just add that it gets significantly cheaper after you built a few . The first ones are always expensive",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Classic case of context-stripped benchmarking by treating a rail line as a noodle and the city as an empty bowl. Its like comparing the cost of building a station in gulshan with a shed in rajshahi. Consider Dhaka's unique cityscapes which they had to compensate, relocate, negotiate with multiparty, weave through flyovers and congested roads. And patna is a suburban city, not like dhaka with unique engineering complexities and costly safety compliances by jica. Its not only costly but also labor intensive. Their contract is older than ours with lower usd rate as well. This project deserves better than a lazy math.",
      "votes": "10",
      "replies": []
    },
    {
      "text": "corruption, scale of dhaka's city, urban mess of dhaka's city and overpopulation are to blame",
      "votes": "22",
      "replies": [
        {
          "text": "You need to read the article, reels addict",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "we people have only one weapons to overcome all issue. and this is education.",
      "votes": "12",
      "replies": [
        {
          "text": "how about decentralization?",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "Source: https://www.tbsnews.net/bangladesh/transport/dhaka-metro-costs-5-times-indias-jica-review-sought-cut-millions-1269236",
      "votes": "3",
      "replies": []
    },
    {
      "text": "No No\nPlease dont talk about it\nMetro rail is funded by mother of humanity shek hasina\nThe citizen didnt gave any money here",
      "votes": "1",
      "replies": []
    },
    {
      "text": "It would have been better and definitely much cheaper if we got China to build the metro. Japan has less experience building metros and things will inevitably be way more expensive.Still they havnt opened up terminal 3...",
      "votes": "-2",
      "replies": []
    },
    {
      "text": "",
      "votes": "-7",
      "replies": [
        {
          "text": "If we compare to Pakistan, everything looks great because Pakistan is roughly 1/2 as rich as us and their corruption is way higher than Bangladesh's could ever dream of being. Asif Ali Zardari makes the corruption of Bangladeshi politicans look like nothing; there's a broader reason for all our faults, Bangladesh has grown at 5%+ for effectively every year since 1991 whilst Pakistan has very rarely hit that mark.",
          "votes": "4",
          "replies": [
            {
              "text": "You basically say Pakistan's economy is so bad that it isn't even comparable. That's kind of right. So, why would you consider a \"good country\" as an enemy? Yes, boarded conflict is common among countries throughout the world even Pak has conflict with Afghanistan and Iran!",
              "votes": "4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Who cares? The big question is ROI and ROIC, even if more expensive than Patna (not their capital btw, like Dhaka is for us), the retunr on investment and invested capital is still amply high enough. The reason isn't corruption here, it's even more simple; higher elevation + imported goods vs domestically made + higher labour costs (Dhaka as a city has higher wages than Patna by multiples).",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Patna as a comparison really ? Imported vs locally manufactured parts difference ? Everything is Bangladesh is more expensive that some of these Indian cities !",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 43
}