{
  "url": "https://www.reddit.com/r/bangladesh/comments/1o3066w/a_crisis_in_plain_sight_child_marriage_and/",
  "hash": "d1705a77f66f03824bb6e420a742fb97",
  "scraped_at": "2025-12-08T15:12:22.569636",
  "title": "A crisis in plain sight: Child marriage and violence stalk RMG sector in Bangladesh",
  "description": null,
  "votes": "81",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Still no use, the gramin bangus are more rigid.",
      "votes": "11",
      "replies": [
        {
          "text": "Still no use, the gramin bangus are more rigid.",
          "votes": "11",
          "replies": []
        },
        {
          "text": "শহুরে সিগমা বয় রা তো ভাবে এসব ইসলাম পরিপন্থী কাজ। বালেগ হলেই বিবাহ দিতে হবে। বিভিন্ন খবরের কমেন্ট সেকশন দেখলেই বুঝা যায়",
          "votes": "2",
          "replies": []
        },
        {
          "text": "That does nothing Those restarts will still do that shit unless we do some serious stuff",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "রগের মায়া ত্যাগ করিয়াছেন বুঝিতে পারি!",
      "votes": "14",
      "replies": [
        {
          "text": "রগের মায়া ত্যাগ করিয়াছেন বুঝিতে পারি!",
          "votes": "10",
          "replies": []
        }
      ]
    },
    {
      "text": "https://www.tbsnews.net/thoughts/crisis-plain-sight-child-marriage-and-violence-stalk-rmg-sector-bangladesh-1257146",
      "votes": "3",
      "replies": []
    },
    {
      "text": "I love how every other day, every year, there's some news articles on child marriage of young girls.  And they blame all kinds of funny reasons like lack of education, climate change etc.\nIt has nothing to do with climate change or lack of education. They just don't value girl children. Both the girls' families and the men who marry them. But people don't like the truth, they just like to dance around the truth.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Slowly and steadily the country of Bangladesh will become like Afghanistan and Yemen congratulations to all those who protested against hasina this all your doing..praying for the safety of woman and specially the minority",
      "votes": "6",
      "replies": [
        {
          "text": "The first line of the article says that the research took place from August 2022 to December 2024. Who was the prime minister for most of that time? Weaponizing cultural issues that we must work to solve just to spread your political propaganda is not helping anyone, it does the exact opposite.",
          "votes": "3",
          "replies": []
        },
        {
          "text": "Why is it the protesters' fault? Let the election happen in February and then talk. Do you think Hasina always needs to be in power to do this or that? Hasina has become a history. Now, point fingers at those who are sitting in the chair of responsibility and the parents too, to change this situation.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "we have to overcome it very soon",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "-3",
      "replies": [
        {
          "text": "That’s a complete lie. Child marriages and prostitution(sex trafficking) were still happening under Hasina rule.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-24",
      "replies": []
    },
    {
      "text": "Let me tell you, early marriage is really widespread in bd and both parties are responsible for it. So bad that when I went to my nana bari the relatives and neighbours asked me why I still haven't married and if I have a problem or so moreover I am just under 23.. I mean it's that bad.. every girl and boy is either in an engagement relationship or married.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": [
        {
          "text": "what riot?",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 59
}