{
  "url": "https://www.reddit.com/r/bangladesh/comments/1mam6rp/join_as_cofounder/",
  "hash": "828ce2ad7a733fa0023d0091225cb139",
  "scraped_at": "2025-12-08T15:21:33.799003",
  "title": "Join as Co-founder",
  "description": "Hey guys, I'm looking for a co-founder to build an AI Services Agency out of Bangladesh. Looking for a tech nerd and sales/business.\nAbout my previous experience: I've been a founder for the last 5 years, my last startup was a Platform for Freelancers/Agencies where they could hire engineers. We built it and took it to $$k on revenue in less than 4 months w/ profitability. We closed later because we realized there are not enough quality engineers. Bad unit economics.\nNow I'm looking for people who want to build something, here's what I'm looking for:\nTech: I already have my ex co-founder who used to handle tech, I'm seeking another guy who knows about AI and building AI more than anyone.\nBusiness: Talk w/ Clients, get clients, hiring, CX expanding etc. basically the CEO.\nI'm looking for people who're still in University or less. If you're someone from IUB, NSU, AIUB, BRAC that's way better. You've to be damn obsessed w/ the business btw and have to work full-time.\nI'll handle the financials, all back-office work, and you can use my previous experiences as well. Equity will be split equally between all the guys.\ndm me if you're interested.",
  "votes": "4",
  "comments": [
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "\"to build something\" you have the product/ service plan ready right.",
      "votes": "1",
      "replies": [
        {
          "text": "Yep. Been in this space for a long time.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Interested. Can you please dm me?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Can you elaborate on the AI service agency idea?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "AI service agency lol",
      "votes": "1",
      "replies": []
    },
    {
      "text": "what's the product?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "hello\nI'm interested in your AI service\nI'm not a tech guy ( I do understand tech, just not a dev )\nI'm more interested in business discussions, client management, and the business structure. ( got 1.5 years of experience in this)\nI can fill the 2nd role you mentioned. dm",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Currently working on a open source based cybersecurity solution with AI based detection and response. Buzz me if you are interested.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 93
}