{
  "url": "https://www.reddit.com/r/bangladesh/comments/1mai6vw/%E0%A6%8F%E0%A6%95%E0%A6%A8%E0%A6%95_%E0%A6%85%E0%A6%A8%E0%A6%AE%E0%A6%A6%E0%A6%A8_%E0%A6%AA%E0%A7%9F%E0%A6%A8_%E0%A6%9C%E0%A6%B2%E0%A6%87_%E0%A6%AB%E0%A6%B2%E0%A6%AF%E0%A6%9F_%E0%A6%AA%E0%A6%B0%E0%A6%95%E0%A6%B2%E0%A6%AA/",
  "hash": "9d70e995caf1a56ca09c614a1d3fb783",
  "scraped_at": "2025-12-08T15:21:51.714960",
  "title": "একনেকে অনুমোদন পায়নি জুলাই ফ্ল্যাট প্রকল্প",
  "description": "অর্থবছরের প্রথম একনেক সভায় উত্থাপন করা ১৪টি প্রকল্পের মধ্যে ১২টি প্রকল্পের অনুমোদন দিয়েছে একনেক সভা। প্রকল্পগুলো বাস্তবায়নে খরচ হবে ৮ হাজার ১৪৯ কোটি ৩৮ লাখ টাকা। এর মধ্যে সরকারি অর্থায়ন ৮ হাজার ৫৮ কোটি ৭৭ লাখ টাকা, বৈদেশিক ঋণ ১৪৩ কোটি ৩৩ লাখ টাকা এবং সংস্থার নিজস্ব অর্থায়ন ৫২ কোটি ৭২ লাখ টাকা।\nঅনুমোদিত প্রকল্পগুলোর মধ্যে রয়েছে চট্রগ্রাম উন্নয়ন কর্তৃপক্ষের কর্ণফুলী নদীর তীর বরাবর কালুরঘাট সেতু হতে চাক্তাই খাল পর্যন্ত সড়ক নির্মাণ (২য় সংশোধিত ৪র্থ বার বৃদ্ধি) প্রকল্প, স্বরাষ্ট্র মন্ত্রণালয়ের দেশের গুরুত্বপূর্ণ স্থানে ২০টি (১২টি নতুন ও ০৮টি ফায়ার স্টেশন পুনঃনির্মাণ) ফায়ার সার্ভিস ও সিভিল ডিফেন্স ষ্টেশন স্থাপন এবং বাংলাদেশ কোস্ট গার্ডের জন্য লজিস্টিকস ও ফ্রিট মেইনটেন্যান্স ফ্যাসিলিটিস গড়ে তোলা (প্রস্তাবিত ২য় সংশোধিত)।\nস্থানীয় সরকার বিভাগ ও পল্লী উন্নয়ন ও সমবায় মন্ত্রণালয়ের ‘গ্রামীণ স্যানিটেশন প্রকল্প’এবং ‘বহদ্দারহাট বাড়াইপাড়া হতে কর্ণফুলী নদী পর্যন্ত খাল খনন’ (৩য় সংশোধিন)। রেলপথ মন্ত্রণালয়ের ‘বাংলাদেশ রেলওয়ে পূর্বাঞ্চলের রেলপথ রক্ষণাবেক্ষণ ও পুনর্বাসন, প্রতিরক্ষা মন্ত্রণালয়ের ‘মিরপুর সেনানিবাসে ডিএসসিএসসি’র অফিসার্স মেস ও বিওকিউ নির্মাণ (১ম সংশোধিত)’ ‘শিক্ষা মন্ত্রণালয়ের ‘ঢাকা বিশ্ববিদ্যালয় অধিকতর উন্নয়ন’, মহিলা ও শিশু বিষয়ক মন্ত্রণালয়ের ‘উপজেলা পর্যায়ে মহিলাদের জন্য আয়বর্ধক (আইজিএ) প্রশিক্ষণ (২য় পর্যায়)’ প্রকল্প।\nসংস্কৃতি বিষয়ক মন্ত্রণালয়ের ‘বাংলাদেশ লোক ও কারুশিল্প ফাউন্ডেশনের জাদুঘর ভবন সম্প্রসারণ এবং অন্যান্য অবকাঠামো নির্মাণ (১ম সংশোধিত ৪র্থ বার বৃদ্ধি)’। কৃষি মন্ত্রণালয়ের কন্দাল ফসল গবেষণা জোরদারকরণ প্রকল্প। বিদ্যুৎ, জ্বালানি ও খনিজ সম্পদ মন্ত্রণালয়ের ০১টি প্রকল্প ‘স্মার্ট প্রি-পেমেন্ট মিটারিং প্রজেক্ট ইন ডিস্ট্রিবিউশন জোনস অফ বিপিডিবি (১ম সংশোধিত)’ প্রকল্প।",
  "votes": "90621",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "মিরপুরে ৭৬১ কোটি টাকা ব্যয়ে ১৩৫৫ বর্গফুট আয়তনের ৮০৪টি আবাসিক ফ্ল্যাট নির্মাণের এ প্রকল্পের ব্যয় প্রস্তাবে দুর্নীতির অভিযোগ নিয়ে সংবাদমাধ্যমে খবর প্রকাশিত হয়।",
      "votes": null,
      "replies": [
        {
          "text": "Choto lok r akta limit thake",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "কোনো এক প্রজন্ম জুলাই যোদ্ধাদের সুযোগ সুবিধা নিয়ে আন্দোলন করবে। ইতিহাসের বারবারই পুনরাবৃত্তি হয়। ইতিমধ্যে দৃষ্টি কটু বিভিন্ন সুযোগ সুবিধা তাদের দেয়া হচ্ছে যা সর্বোপরি জুলাই অভ্যুত্থানকে প্রশ্নবিদ্ধ করে।",
      "votes": "3",
      "replies": [
        {
          "text": "নিহতদের পরিবারকে ফ্ল্যাট দেয়ার বিষয়টি কিভাবে দেখেন। আর হ্যা কলেজের ভর্তিতে জুলাই কোটা থাকবে না। আপাতত কোনো এক্সামে এমন কোটা নেই।",
          "votes": "3",
          "replies": [
            {
              "text": "নির্ভর করে। কিসের উপর ভিত্তি করে ফ্ল্যাট দেয়া হবে। যদি অংশগ্রহণ হয় তাহলে এতোজনকে দেয়া অসম্ভব। আর জানা কথা যারা পাবে তারা নেতৃস্থানীয় হবে বা ভাইরাল মুখের আত্মীয় স্বজনরা পাবে। সে ক্ষেত্রেও প্রশ্নবিদ্ধ। দারিদ্র্য সীমার উপর দিলে মুক্তিযুদ্ধের পর থেকেই প্রাধান্য তালিকায় অন্যান্য অনেক দরিদ্র জনদের নাম আসবে। এই মুহূর্তে এগুলা প্রদান করা নির্বাচন প্রভাবিত করা এবং জনগণের সমর্থন আদায় ব্যাতিত অন্যকিছু বলে মনে হয় না",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 94
}