{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ph6g9a/%E0%A6%9C%E0%A6%AE%E0%A7%9F%E0%A6%A4%E0%A6%B0_%E0%A6%B9%E0%A7%9F_%E0%A6%9F%E0%A6%95_%E0%A6%B6_%E0%A6%95%E0%A6%AA%E0%A6%A8_%E0%A6%AC%E0%A6%AF%E0%A6%B0%E0%A6%B8%E0%A6%9F%E0%A6%B0_%E0%A6%B6%E0%A6%B9%E0%A6%B0%E0%A7%9F%E0%A6%B0_%E0%A6%95%E0%A6%AC%E0%A6%B0_%E0%A6%AA%E0%A6%95%E0%A6%B8%E0%A6%A4%E0%A6%A8%E0%A6%B0/",
  "hash": "4962922e6ee87845c81f797964ff6b52",
  "scraped_at": "2025-12-08T16:55:09.578104",
  "title": "জামায়াতের হয়ে টক শো কাঁপানো ব্যারিস্টার শাহরিয়ার কবির পাকিস্তানের আত্মসমর্পণের দলিলে যেখানে লেখা \"এবং বাংলাদেশের বাহিনী (and BANGLA DESH forces)\" ঠিক তার আগে রিডিং পড়া থামিয়ে দাবি করে বসলেন পাকিস্তান বাংলাদেশের কাছে আত্মসমর্পণ করে নি। জামায়াতের এই মেধাবী ব্যারিস্টারের এই ক্লিপে মেধাটা হলো ধোঁকা।",
  "description": null,
  "votes": "21",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "The Bangladesh forces were under the command of Jagjit Singh Arora. The surrender of Pakistan forces in Bangladesh was to Arora. The document was specific to military/armed force surrender, not West Pakistan's surrender of the land of East Pakistan or anything of that sort.\nThe surrender document of 16 December 1971 is widely available, yet there is no “handover document” in the same ceremonial sense for transferring civil authority to the Mujibnagar Government or Bangladesh or the armed forces of Bangladesh.\nBut India formally recognised Bangladesh as an independent state and the Mujibnagar Government as the provisional Government of Bangladesh, on 6 December 1971 (Indira Gandhi announced this through a declaration of recognition of some sort). So technically, there was never a necessity for such a handover document?\nThe United Nations then admitted Bangladesh as a member in September 1974.\nThat is so far my thoughts based on the data I have seen, but this lawyer dude is somehow very sure Bangladesh is not involved in that issue of surrender. I also don't know where he found the phrase \"joint\", and if this is like willful ignorance of some sort or does he genuinely believe what he is saying, and just was silent for the last 50 years or something?\nThis dude is very annoying, and I know that, but his choice of brain-rot narratives really throws me off, and I am here for some correction or reassurance. Can people shed some light on the matter?",
      "votes": "7",
      "replies": [
        {
          "text": "Of course he is doing it willingly..",
          "votes": "4",
          "replies": [
            {
              "text": "i wish i could be sure it was willful ignorance and not genuine belief from his side.",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "এর আগে খালেদ মহিউদ্দিনের টক শোতে এসে তৌহিদী জনতাকে উস্কে দিয়েছিল এই লোক। উনি ভালো করেই জানেন বাংলাদেশে কাউকে নাস্তিক ট্যাগ দেয়া মানে তার এক ধরনের মৃত্যু দন্ড ঘোষণা করে দেয়া। এই লোক জেনে শুনেই এই কাজগুলো করে। রেইজ বেট করে।",
          "votes": "1",
          "replies": [
            {
              "text": "ভাই কিছু মনে কইরেন না, আমার মনে হয় আপনি ড জাহেদ কে ভুল বুঝছেন। জাহেদ সার বুঝাইতে চাইসিলো যে শরিয়া আঈন অনুসারে, মুসলিম থেকে কাফির হইলে যারে মুর্তাদ বলে, সেই মুর্তাদের মৃত্যুদন্ড বিষয়ে শরিয়া আঈনে বিধি আছে।\nতো জাহেদ সার বুঝাইতে চাচ্ছিলো যে বাংলাদেশে তো অনেক এমন গোষ্ঠি আছে যারা বাংলাদেশের মাটিতে থেকেও শরিয়া আঈন পালন করে আর জাহেদ সার মুর্তাদ এই রূপ কোন ইশারা পেলে তারা তাদের মতো করে গুপ্ত কাজ করে নিবে।\nএটা মূলত বাংলাদেশে কাউএ নাস্তিক্ ট্যাগ দিলেই যে এক ধরনের মৃত্যুদন্ড ঘোষণা , ব্যাপার টা সম্ভবত ঐরকম না। এমনে কইলে বিষয় টা জেনারেলাইজ হইয়া যায়, যেহানে এই বিষয় আসলে অনেক স্পেসিফিক।",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "He likes joint and does jointa often.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "জামাত মানেই হাফ সত্য",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 1
}