{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oubwga/all_cases_against_al_will_be_withdrawn_we_dont/",
  "hash": "2cf17ffcea6ed56b02954463939559e4",
  "scraped_at": "2025-12-08T17:23:21.899165",
  "title": "All cases against AL will be withdrawn; we don't believe in politics of vengeance: Fakhrul",
  "description": null,
  "votes": "61",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Wow. The ruling class is ultimately one big club regardless of parties, isn’t it?",
      "votes": "45",
      "replies": [
        {
          "text": "It's not just a saying, it's reality. I happen to know a lot of the upper class in Bangladesh personally. It doesn't matter if BAL, BNP, or Jamaat win, the rich always win. And plenty of these guys are BAL today, BNP tomorrow, and whoever else they need to be in the future and the politicians of each party are the same. They aren't gonna say no to money regardless of who it comes from.",
          "votes": "21",
          "replies": []
        },
        {
          "text": "The ones who move the chess pieces are often good friends",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "ainnoway!!!! did BAL remove all the fake cases against Khaleda Jia or Jarek Tia??? no right?? this is not political vengeance, this is about justice. they should be at least prosecuted for July august violence",
      "votes": "30",
      "replies": [
        {
          "text": "political leaders don't need fake cases to be put on trial. Most political leaders will be hanged against true justice. Fakrul is clearly pretending to be awami sympathiser for votes but I am just saying Khleda and Tarek don't need fake cases to face trial.",
          "votes": "13",
          "replies": []
        },
        {
          "text": "Wow bro sprouting justice when multiple top world leaders have cases against them",
          "votes": "4",
          "replies": []
        },
        {
          "text": "Bro those cases weren't fake. Just because BAL was corrupt and shady doesn't mean BNP weren't either. You could throw most politicians in Bangladesh in jail for life using just real cases, no fake cases required. They are all criminals.",
          "votes": "6",
          "replies": []
        },
        {
          "text": "what fake cases, some of them had merit, now of course BAL is gone, so the kangaroo court dismissed them",
          "votes": "9",
          "replies": []
        }
      ]
    },
    {
      "text": "Kew dosh korle shasti pawa uchit, kew nirdhosh hole mukti pawa uchit. Make sure that happens.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Well, that should cement the NCP-Jamaat alliance...",
      "votes": "5",
      "replies": []
    },
    {
      "text": "bnp is saving themselves in some way and win election with awami league votes, since general public aren't really interested in bnp",
      "votes": "21",
      "replies": [
        {
          "text": "They are also saving themselves from retribution in 5 or 10 years when the BAL finds a way back.\nIts smart, and analogous to the post 71 spirit.",
          "votes": "3",
          "replies": []
        },
        {
          "text": "General public BNP er moddhe interested na hoile kar upore hobe? NCP? Moja pailam ei kotha shune 🤣",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "They are just making sure when their turn is over next, they won't have to face consequences for the inevitable corruption and worse. This is just putting money in the bank for the future.",
      "votes": "10",
      "replies": []
    },
    {
      "text": "NCP: 'Keep talking! '",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Yes yes, forget what the previous regime did, not just in July to August last year, but also over the past 15 years which involves disappearances, torture and murder of BNPs own party members. BNP really are their own enemies. Such a defeatist mentality.",
      "votes": "11",
      "replies": []
    },
    {
      "text": "Don’t believe the son of a RAZAKAR.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "In other words, all cases filed against them by the BNP and others will be withdrawn if they pay the \"correct\" amount.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Source: https://www.tbsnews.net/bangladesh/politics/all-cases-against-al-will-be-withdrawn-we-dont-believe-politics-vengeance",
      "votes": "2",
      "replies": []
    },
    {
      "text": "বিএনপির দায়িত্বে আসলে কে সেটা জানার খুব ইচ্ছা, এদের এক নেতার কথার সাথে অন্য নেতার কথার পুরা ১৮০ ডিগ্রী পল্টি যেটা আওয়ামী লীগ বা জামায়াতে নাই। এদিকে দলের মহাসচিব লীগকে মাপ করে দেয় ওদিকে ভাই ব্যবসায়ী অলিভ অয়েল নিয়ে বসছে\nhttps://www.ittefaq.com.bd/amp/761330/হাসিনাকে-ফাঁসিতে-না-ঝোলানো-পর্যন্ত-তার-নাম-মাথায়",
      "votes": "2",
      "replies": []
    },
    {
      "text": "International pressure",
      "votes": "2",
      "replies": []
    },
    {
      "text": "In other words, He is trying to mean BNP BAL bhai bhai",
      "votes": "0",
      "replies": []
    },
    {
      "text": "BNP BAL Saglami",
      "votes": "0",
      "replies": []
    },
    {
      "text": "অলি-আউলিয়ার দল।",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Watch his full speech please",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 101
}