{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ouag8v/jamaateislami_ameer_shafiqur_rahman_has_said/",
  "hash": "12f85f2dd495d8faefc8a9e0e9bcc42d",
  "scraped_at": "2025-12-08T17:23:41.334065",
  "title": "Jamaat-e-Islami Ameer Shafiqur Rahman has said there can be no national election without establishing the legal basis of the National July Charter. Meanwhile, BNP Secretary General Mirza Fakhrul Islam Alamgir has accused Jamaat of fearing elections and seeking to delay them through demands such as i",
  "description": null,
  "votes": "33",
  "comments": [
    {
      "text": "BNP will not rule the country well. But it's true that Jamaat is fearing the election. Even their heavyweight leaders can lose massively. It can be extremely humiliating for them.",
      "votes": "14",
      "replies": [
        {
          "text": "Sibir won tho",
          "votes": "2",
          "replies": [
            {
              "text": "National election will be harder to rig in favour of one party than say ducsu or juscsu",
              "votes": "4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "He knows that election means \"losing all power\" that \"never tasted before\" !",
      "votes": "6",
      "replies": []
    },
    {
      "text": "What even is the July Charter at this point? I rather have a democratically elected government mess around with the country's charter than a caretaker government we have now. Like now its just a powerful orgs dictating what should be in our constitution, who appointed them? No one.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Can anyone actually please tell me what is establishing the legal basis of July Charter and on what exactly there are asking for referendum?",
      "votes": "2",
      "replies": [
        {
          "text": "There may be no legal basis. Any Presidential Order or Ordinance issued must be approved at the next sitting of Parliament to remain valid. So if the next Parliament doesn’t approve the Presidential Order, the referendum technically becomes invalid.",
          "votes": "1",
          "replies": []
        },
        {
          "text": "Same question",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "১৯৫৪, ১৯৭০ -- কোন ইলেকশনে এদের পূর্বপুরুষরা বাঙ্গালীদের সাথে পারেনি। এদের নিজেদের দেশে, ১৯৪৭ এর পর থেকে এ পর্যন্ত কোন নির্বাচিত সরকার পুরো টাইম টিকতে পারেনি। সুতরাং এরা যে ইলেকশন চাইবেনা সেটা খুবই স্বাভাবিক",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Source: https://www.tbsnews.net/bangladesh/politics/jamaat-7-other-parties-hold-rally-demanding-implementation-july-charter-today\nhttps://www.tbsnews.net/bangladesh/politics/you-are-afraid-elections-because-you-know-it-would-end-your-existence-fakhrul",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 102
}