{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ou0yk7/%E0%A6%AD%E0%A6%B0%E0%A6%A4%E0%A7%9F_%E0%A6%B8%E0%A6%B0%E0%A6%95%E0%A6%B0_%E0%A6%8F%E0%A6%B0_%E0%A6%AA%E0%A6%B0%E0%A6%A4%E0%A6%AF%E0%A6%95%E0%A6%B7_%E0%A6%AA%E0%A6%B7%E0%A6%A0%E0%A6%AA%E0%A6%B7%E0%A6%95%E0%A6%A4%E0%A7%9F_%E0%A6%A8%E0%A6%89%E0%A6%9C_%E0%A6%AE%E0%A6%A1%E0%A7%9F%E0%A7%9F_%E0%A6%AC%E0%A6%95%E0%A6%A4%E0%A6%AC%E0%A6%AF_%E0%A6%A6%E0%A7%9F%E0%A6%9B%E0%A6%A8/",
  "hash": "8834fc02bee17580b1387232d4932d28",
  "scraped_at": "2025-12-08T17:24:13.586055",
  "title": "ভারতীয় সরকার এর প্রত্যক্ষ পৃষ্ঠপোষকতায় নিউজ মিডিয়ায় বক্তব্য দিয়েছেন চট্টগ্রামের পলাতক এমপি নওফেল, বক্তব্য ভুলে গেলে সাহায্য করেছেন উপস্থাপক",
  "description": null,
  "votes": "6",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Godi media",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Polai koi ki?\nUSA posting picture of mosque is definetly to appeasse the extremist of our country.\nAlso I still don't get the Clinton family connection to Yunus as a gotcha point, Like you mean to say the Clinton who are democrats, while democrats were in power couldnt keep that power, but they somehow manage to overthrow a foriegn country who supposedly hate them? Like man Yunus aint really a beacon of positivity, he has a lot of negative points, but creating a tin foil theory and repeating it a hundred times without thinking for more than 20 minutes hurts your movement even more.\nAlso these type of shit is increasing not with only politician but among common people too. People claim stuff (like for example the NGO who was given money used that to fund the revolution, claiming the money dissapeared) without any hint of proof. Are we as human society going backward? what happened to giving proof to claims? people nowadays just say shit and get angry when asked for proof.",
      "votes": "3",
      "replies": [
        {
          "text": "I dont know how all these justifies the killing of people. The journalist was borrowed by RAW for sure.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "সাধারন মানুষ কখনো ই আর ভারতের দাস দের পাত্তা দিবে না।",
      "votes": "1",
      "replies": [
        {
          "text": "দেখা যাক। ততটুকু ইন্টেলেকচুয়াল আইডিয়া নেই এদেশে এখনো।",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 104
}