{
  "url": "https://www.reddit.com/r/bangladesh/comments/1osnh04/fascism_will_be_permanently_abolished_under/",
  "hash": "0038c7b7778e1c239f066cc8c917eb3d",
  "scraped_at": "2025-12-08T17:27:15.007068",
  "title": "Fascism will be permanently abolished under Tarique Rahman's leadership: Mir Snigdho",
  "description": null,
  "votes": "49",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Get rid of Tariq and we can maybe believe that.",
      "votes": "52",
      "replies": []
    },
    {
      "text": "May his brother forgive him.",
      "votes": "46",
      "replies": [
        {
          "text": "Etai mugdho. You fell prey to his genjitsu.",
          "votes": "15",
          "replies": []
        }
      ]
    },
    {
      "text": "Bhai er lasher upor bebsha ar rajniti kora hocche. Capitalism wins again",
      "votes": "23",
      "replies": [
        {
          "text": "capitalism always wins. 🤑",
          "votes": "3",
          "replies": []
        },
        {
          "text": "",
          "votes": "-21",
          "replies": [
            {
              "text": "I just stated my opinion, and since ami bhera ba chagol na, i would say i (a person) decided what was moral in my opinion. If others have a different opinion that is also fine.",
              "votes": "9",
              "replies": []
            },
            {
              "text": "Giving illiterate the option to decide their fate and we all are doomed. That's how we got Hasina and now your thinking of starting that cycle again",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "সমস্যা কি জানেন আগের জেনারেশন এসব উউল্টাপাল্টা কথা বলে পার পাইতে পারত কারণ মিডিয়া এইভাবে ক্যাপচার করতে পারত না। কিন্তু জেনজির এইসব বেঈমান পার পাবে না। কারণ সবার আমলনামা জেনারেশন আলফা, বেটা, গামা, সিগমার কাছে থাকবে। জেনজি ইজ নট দ্যা লাস্ট জেনারেশন। 🙏 সব ইয়ংগার জেনারেশন ই তার আগের জেনারেশন থেকে কয়েক ধাপ দুর্ধর্ষ আর খ্যাপাটে হয়।",
      "votes": "6",
      "replies": []
    },
    {
      "text": "I guess the wrong brother died that day, what a shameless moton.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "I have never seen a guy profit over their brother's death like this, erkum shameless beta ar jibono dehki nai.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Mugdho ar snigdho ek e btw",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Dude is Gen-Z, but donno why he is using dialogues of his forefathers. So embarrassing. BNP what are you doing 😂",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Money say jump, cat says how high.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "https://www.tbsnews.net/bangladesh/politics/fascism-will-go-permanently-under-tarique-rahmans-leadership-mir-snigdho-1281336",
      "votes": "1",
      "replies": []
    },
    {
      "text": "🤡",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Mugdho's own father and extended family support the BNP in their locality. Snigdho also supports BNP from before; kids often inherit these tribalisms from their family. Do you think it would be a far stretch to think Mugdho also supported BNP? Or was atleast soft towards the party? Do you keyboard warriors think only apolitical people started the movement? Initially, the majority of people who risked their lives were anything but. BNP korlei kharap. The interim government made him the face of many events and organisations. He didn't do anything. he didn't go out to ask for attention. You incels would rather have him walk back into obscurity because it makes you feel better.",
      "votes": "1",
      "replies": [
        {
          "text": "স্নিগ্ধ ঢাকা ইউনিভার্সিটি এর না, এনসিপিতে বেশিদূর আগাইতে পারবেনা।",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-14",
      "replies": [
        {
          "text": "I agree with the last line only",
          "votes": "0",
          "replies": [
            {
              "text": "Why? Tell me the name of an antifascist party. Other than bnp",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Shame...",
      "votes": "0",
      "replies": []
    }
  ],
  "id": 115
}