{
  "url": "https://www.reddit.com/r/bangladesh/comments/1peuc1e/%E0%A6%9C%E0%A6%AE%E0%A6%A4%E0%A6%B0_%E0%A6%A6%E0%A6%AC%E0%A6%9A%E0%A6%B0%E0%A6%A4/",
  "hash": "561d9a76bcdae977e48f533f26882c4d",
  "scraped_at": "2025-12-08T16:58:10.219410",
  "title": "জামাতের দ্বিচারিতা",
  "description": "কয়দিন আগেই ডাকসুর মেয়েদের কতিপয় কুলাংগার অনলাইনে অনেক হেনস্তা করে। যার প্রেক্ষিতে ডাকসুর ভিপি সাদিক কায়েম মামলা দায়ের করে অনেক অনলাইন পেজের বিরুদ্ধে। কিন্তু মেয়েদের হেনস্তা করা অনলাইনে এটা শুরুই করেছে জামাতি বট এবং তাদের পৃষ্ঠপোষক দের মাধ্যমে। এই ইলিয়াস হোসেন, জামাতি সিম্পেথাইজার কয় দিন দিন পর পরই মেয়েদের হেনস্তা করে পোস্ট দেয় এবং জামাতিরা ভালোই বাহবা দেয় কমেন্ট বক্সে। তখন তারা ভুলে যায় এরাও মেয়ে। শাহবাগি ট্যাগ দেয়, বডি শেমিং করে। আসলে এদের স্বার্থের সাথে যারা নাই, তাদের নিয়ে বাজে মন্তব্য করতে ২ মিনিট সময় ও নেয় না। এই যে মুনাফেকি চরিত্র এদের। এরা সামনে দেশকে ধ্বংসের দিকে নিয়ে যাবে।",
  "votes": "27",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Nothing new. Elias is the dirtiest SoB I've seen. Here is another of his golden remarks.",
      "votes": "15",
      "replies": [
        {
          "text": "O journalist er moddhei pore na bt ki ek generation hoiche, er murid er ovab nai",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "Gold standard of Munafek.",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Acha ei elias Hossain beda te kothai kothai mohiladere slut shamed kore keno? Er telegram group e asi Ami (andoloner somoi dhuksilam) and oikhaneo jei mohilader dehkte partona tader slut shamed korto. Mane constructive criticism ki karo sex live na tule deya jaina?",
      "votes": "6",
      "replies": [
        {
          "text": "Constructive criticism parbe na bolei, era esob nia ashe",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "জামাত/শিবির কি জিনিস পাবলিক বুঝুক। নতুন জেনারেশন ভাবে এরা নিরিহ প্রাণী",
      "votes": "9",
      "replies": [
        {
          "text": "কারে ভোট দিমু ভাই",
          "votes": "3",
          "replies": [
            {
              "text": "এটাই সবচে মজার কোশ্চেন, কিন্তু আন্সার আমার কাছেও নাই।",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "জেনজির কাছে এরাই প্রিয় ভাই",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "যেই জিনিস আরও ১০ বছর পর শুরু করতে পারত মুনাফেকরা তা দেড় বছরেই শুরু করে দিছে। 🤣 হাসি পায়।",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 12
}