{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ordo3i/honest_question_%E0%A6%86%E0%A6%93%E0%A6%AF%E0%A6%AE%E0%A6%B2%E0%A6%97_%E0%A6%9B%E0%A6%A1_%E0%A6%AC%E0%A6%99%E0%A6%B2_%E0%A6%B8%E0%A6%B8%E0%A6%95%E0%A6%A4%E0%A6%B0_%E0%A6%AA%E0%A6%B7%E0%A6%9F%E0%A6%AA%E0%A6%B7%E0%A6%95_%E0%A6%86%E0%A6%A6%E0%A6%93_%E0%A6%95%E0%A6%A8/",
  "hash": "0b5c2f423da41a75c993a33ebb523377",
  "scraped_at": "2025-12-08T17:29:40.806469",
  "title": "Honest question - আওয়ামীলীগ ছাড়া বাঙালী সংস্কৃতির পৃষ্টপোষক আদৌও কোনো দল আছে ?",
  "description": "বর্তমানে জামাতি কুকুর গুলো বাংলার সংগীত ও সংস্কৃতির বিরুদ্ধে যুদ্ধ ঘোষনা করেছে ! তাদের বট বহিনী বাঙ্গালী সংস্কৃতিকে ভারতের দালালি বলে , সংগীত শিল্পীদের মাদকাসক্ত বলে প্রচার করছে । তাছাড়া ভারতের সাথে যুদ্ধ বাধাতে তারা মরিয়া।\nভবিষ্যতে কোন রাজনৈতিক দল একটু মোটামুটি আসন পেলে , এই দেশকে মরুভূমি হওয়া থেকে ঠেকাতে পারবে?\nবি দ্রঃ বি এন পি পারবেনা আমি জানি। তারা ইতিমধ্যে তালেবানি মোল্লাদের তেল মারা শুরু করে দিয়েছে !",
  "votes": "0",
  "comments": [
    {
      "text": "আমাদের নিম্নবিত্ত, মধ্যবিত্ত শ্রেণির মানুষের এত টাকা নাই যে তারা প্রাইভেট স্কুলে তাদের সন্তানদের পড়াবে। হাতে অপশন ২টা। সরকারি প্রাথমিক অথবা মাদ্রাসা। লীগের হাতে ১৬ বছর ক্ষমতা ছিল। প্রাথমিক বিদ্যালয়ের শিক্ষকদের নিয়োগ, প্রশিক্ষণ সব দিক দিয়ে যাচ্ছে তাই অবস্থা করে রাখছে। কিন্তু সঠিক পরিকল্পনার মাধ্যমে যদি এই প্রাথমিক বিদ্যালয় গুলোতে বিনিয়োগ করত জাতি আজকে সংস্কৃতিমণা একটা সমাজ পাইত। ১৬ বছরে আমাদের দেশকে লীগ এই সেক্টরে কি দিতে পারছে বলেন তো? সাম্প্রদায়িকতার বিষবাষ্প গড়ে ওঠার সুযোগ ত লীগ ই করে দিছে। নতুনকুড়ি বন্ধ ছিল এত বছর ধরে। সুস্থ সাংস্কৃতিক প্রতিযোগিতার কোন আয়োজন টা লীগ করছে? দেশীয় সংস্কৃতির বিকাশে কোন উদ্যোগটা সফল করছে বলেন। যেখানে পারছে উন্নয়ন প্রজেক্টের নামে টাকা মারছে, আর এই মাইরা দেয়া টাকার ১টা অংশ দান করছে বিভিন্ন হুজুরদের পিছে।লীগের শীর্ষ নেতৃত্ব একদম পচে দুর্গন্ধ ছড়াইছে। এদের অপকর্ম কে আদর্শ দিয়ে ঢাকতে যায়েন না।",
      "votes": "54",
      "replies": [
        {
          "text": "",
          "votes": "-10",
          "replies": [
            {
              "text": "নাই। কারণ লীগের বাইরে গিয়ে যাদের এইরকম ১টা দল করার সামর্থ্য ছিল বা আছে তারা বঙ্গবন্ধর প্রতি লয়্যাল কিংবা লীগের প্রতি লয়্যাল। তারা দরকার হলে রাজনীতিই করবে না কিন্তু নতুন দল করাটাকে চিন্তাও করতে পারেন না।এটা তাদের কাছে আত্মহত্যার শামিল।",
              "votes": "8",
              "replies": []
            }
          ]
        },
        {
          "text": "",
          "votes": "-6",
          "replies": [
            {
              "text": "বন্ধ আরও আগেই হইছিল। বাজেট শর্ট।কিন্তু নতুন ১টা ট্যালেন্ট হান্ট প্রোগ্রাম করতে বাধা কি ছিল? আলতু ফালতু প্রজেক্টে ত কম টাকা নষ্ট করে নাই। শিক্ষকতা পেশাটারেই ত ১টা অভিশাপ বানায়ে ফেলছে। শিক্ষকের অর্থনৈতিক ব্যবস্থার উন্নতি নাই, শিক্ষক নিয়োগে দুর্নীতি বন্ধ করা নাই কিন্তু আপনি ১টা শিক্ষানীতি বানায়ে সবার উপর প্রয়োগ করে দিলেন। কিভাবে সফল হবেন? ১৬ বছর গোজামিলের উপর ছিল শিক্ষা ব্যবস্থা। এরকম শিক্ষাব্যবস্থার ফলেই জেনজির এই অবস্থা। সাংস্কৃতিক ক্লাব গুলো সচল রাখতে পারলে আজকের এই দিন দেখা লাগত না। ইন্টেরিমের দোষ পরে ধরেন। এরা না এসে যদি ৬ আগস্ট জামাত বিএনপি মিলে নতুন সরকার গঠনের ঘোষণা দিয়ে বলত আগামী ১০ বছর এই জাতীয় সরকার দেশ চালাবে। কি করতে পারতেন? ইন্টেরিম আসছে বলেই এখনো আশা রাখতে পারতাছেন লীগ ফের ক্ষমতায় আসবে।",
              "votes": "4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "আওয়ামী লীগ কোনো পৃষ্ঠপোষক ছিলো না। ইন্ডিয়ান গান বাজনা শুনাইশে, আমরা ভাবসি ওইগুলা আমাদের কালচার। বাঙালির একমাত্র সংস্কৃতি হচ্ছে অন্যের পিছনে আঙ্গুল দিয়ে রাখা",
      "votes": "12",
      "replies": []
    },
    {
      "text": "আওয়ামী লীগ বাঙালী সংস্কৃতির পৃষ্ঠপোষক - এই বক্তব্যের সাথে মোটেই একমত না। তবে অন্য দলের সাথে তুলনা করলে আওয়ামী লীগকে মন্দের ভালো বলা যায়।",
      "votes": "23",
      "replies": [
        {
          "text": "",
          "votes": "-14",
          "replies": []
        }
      ]
    },
    {
      "text": "Only an absolute troll would think that you need AL to sustain our beautiful culture. If you think AL driven cultural drive is the only Bengali culture then please go educate yourself. If you don’t have the brain to do so then I’ll give you a lecture. Heck, just from reading the comments here - many others can too.",
      "votes": "8",
      "replies": []
    },
    {
      "text": null,
      "votes": "5",
      "replies": []
    },
    {
      "text": "দেশটা আসলে গভীর ক্রাইসিসে আছে। তা হল আইডেন্টিটি ক্রাইসিস। রাইট উইং এর উত্থান যে কতটা ভয়ংকর হয়, আগামী ১০ বছরে দেশের মানুষ হাড়ে হাড়ে টের পাবে।",
      "votes": "4",
      "replies": []
    },
    {
      "text": "যারা শিল্প, সাহিত্য, সংস্কৃতির সাথে আছে, তাদের বেশিরভাগই হয় কোন রাজনিতিতে নাই, আর থাকলে আওয়ামী লীগের সাথেই থাকে। কিছু গানের শিল্পী দেখা যায় বিএনপিতে। অভিনেতা, অভিনেত্রী, লেখক, সাহিত্যিক, শিক্ষক, সাংবাদিক মহলের প্রচুর লোক আছে যারা আওয়ামী লীগের ভাব ধারাতেই থাকে। যুব বয়সে অনেকে বাম ধারার রাজনীতিতে থাকে। এদের মধ্যে থিয়েটার, নাচ, গানের মানুষ বেশি।",
      "votes": "4",
      "replies": [
        {
          "text": "তার মানে শক্ত অবস্থান নেয়ার মত কেউ নাই ?",
          "votes": "-2",
          "replies": []
        }
      ]
    },
    {
      "text": "সংস্কৃতিকে দলীয় প্রোপাগান্ডা মেশিনে পরিনত করা, রাজনৈতিক ক্ষমতা ব্যাবহার করে সাংস্কৃতিক অঙনে প্রভাব বিস্তার করা, ভিন্নমতের শিল্পীদের ব্ল্যাকলিস্টেড করা, বই ব্যান করা, একদল পাপেট শিল্পী গ্যাং তৈরি করা যাদের কাজ ছিল লীগের প্রতিটা অন্যায়কে জাস্টিফাই করা, এমনকি জুলাই গনহত্যাও জাস্টিফাই করার চেস্টা করছে এই লীগের সাংস্কৃতির সেনাপতিরা। আওয়ামিলীগের ফ্যাসিবাদের সফটপাওয়ারে পরিনত করেছিল এই সংস্কৃতি আর শিল্পীদের। পরিনত হয়েছিল ফ্যাসিবাদের অন্যতম মূল স্তম্ভে।\nআফসোস, এখনো অনেকে মনে করে আওয়ামিলীগ বাংলা সংস্কৃতির পৃষ্টপোষক ছিল।",
      "votes": "4",
      "replies": [
        {
          "text": "Eishob bhashon diye labh ki? Can you tell me which politically significant party is not fascist? In the real meaning not bd sphere meaning.\nWhy did the others and other poltical ignore their duty to uphold the cultural front and resist the islamist narrative and instead are now dubbing bengali culture as indian.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "নাই! একটা ও নাই! বিএনপি যদি জিততে পারে ইলেকশন তাইলে হয়তো হতেও পারে! আর না জিতলে আর কোনো চান্স নাই!",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Couldn't agree more !",
      "votes": "2",
      "replies": [
        {
          "text": "Couldn't agree more !",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "the culture of a region or country often changes significantly due to the influence of religion. It's upto the majority if they want the cultural roots to trace back to its authenticity or change to accommodate religious rules",
      "votes": "1",
      "replies": []
    },
    {
      "text": "আওয়ামিলীগ কবে পৃষ্ঠপোষক ছিলো?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "-10",
      "replies": [
        {
          "text": "বস্তিবুকে যেয়ে গুজব ছড়া শিবিরের কুত্তা",
          "votes": "2",
          "replies": [
            {
              "text": "অই বট আইডি কিছুদিন পর দেখবেন নাই হইয়া যাইবো।",
              "votes": "0",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I don't think al was saving bangali culture",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "-2",
      "replies": []
    }
  ],
  "id": 124
}