{
  "url": "https://www.reddit.com/r/bangladesh/comments/1orbvc0/%E0%A6%9C%E0%A6%AE%E0%A6%A4_%E0%A6%87_%E0%A6%87%E0%A6%B8%E0%A6%B2%E0%A6%AE_%E0%A6%A8%E0%A6%AE%E0%A6%B0_%E0%A6%8F%E0%A6%87_%E0%A6%B8%E0%A6%97%E0%A6%A0%E0%A6%A8_%E0%A6%95_%E0%A6%B0%E0%A6%96_%E0%A6%A6%E0%A6%A1%E0%A6%93_%E0%A6%98%E0%A6%B0_%E0%A6%98%E0%A6%B0_%E0%A6%A6%E0%A6%B0%E0%A6%97_%E0%A6%97%E0%A6%A1_%E0%A6%A4%E0%A6%B2%E0%A6%93/",
  "hash": "6768cb9acad4a18a0b4e5f4c0ba1b0ac",
  "scraped_at": "2025-12-08T17:30:01.210239",
  "title": "জামাত ই ইসলাম নামের এই সংগঠন কে রুখে দাঁড়াও, ঘরে ঘরে দুর্গ গোড়ে তোলও",
  "description": "জামাত নেতা রা আবারও বাঙালি জাতি কে হুঙ্কার দিয়েছে; আবারও একবার চ্যালেঞ্জ ছুড়ে দিয়েছে এই নর পিশাচ এর দল; এই দল কে শুধু এইবার নিষিদ্ধ নয় উৎখাত করার সময় হয়েছে । প্রিয় দেশ 😭 আমার এই আমার মাতৃভূমি র সাথে বিশ্বাস ঘাতকতা করো না; প্রিয় দেশ এর মানুষেরা আমাদের বুকে পাড়া দিয়ে এই নিষিদ্ধ সংগঠন কে মাথা উঁচু করে দাঁড়াতে দিয়ো না । এরা তারাই যারা আমাদের মা বোন দের ধরে নিয়ে পাকিস্তান এর খোরাক বানিয়েছে, এরা তারাই যারা আমাদের বুদ্ধিজীবী দের হত্যা করেছে, এরা তারাই যারা আজও আমাদের বলে মুক্তিযুদ্ধ বলে কিছুই ছিলো না",
  "votes": "0",
  "comments": [
    {
      "text": "I was with you up until that জয় বঙ্গবন্ধু. বঙ্গবন্ধু is the first dictator of Free Bangladesh. His greed and power-hunger is the reason we never had a stable political situation. His corruption caused a famine killing hundreds of thousands. So বঙ্গবন্ধু is the biggest traitor of Free Bangladesh: Bangaldeshi people trusted him to be a just leader and in return he gave us death.\nIt is too late to ban জামায়াত unfortunately, it should have been done by our grandfather's generation. We can't repeat the same mistake with BAL: we need to learn from not banning Jamaat and ban BAL. Hopefully people will see through Jamaat's tricks and not forget the traitors Jamaat idolize.",
      "votes": "6",
      "replies": [
        {
          "text": "He was the biggest factor to make free Bangladesh",
          "votes": "-3",
          "replies": [
            {
              "text": "Which makes him the biggest disappointment and traitor as well in independent বাংলাদেশ history. He did not, and his family does not, own our beloved country, this is not a kingdom.\nHis actions after our independence show all his efforts for an independent Bangladesh was to have absolute power and control. Just like Jamaat helping in July protest. None of them did it out of the good will for common people as we can see clearly.\nIf we are to believe the first prime minister of Bangladesh (তাজউদ্দীন আহমেদ), you will see how after independence শেখ মুজিব cared only about power and control. There is a reason why common people celebrated শেখ মুজিব's death. The famous \"ভাত দে হারামজাদা, নইলে মানচিত্র খাবো\" was written due to মুজিব's corrupted regime starving the country.\nIt's how you end that makes your legacy, not your beginning, thus শেখ মুজিব's legacy is of a traitor.",
              "votes": "1",
              "replies": []
            },
            {
              "text": "vai ki saradin somaj boi poren?",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "চোর ডাকাত সন্ত্রাসী খুনী আওয়ামীলীগ চুপ থাক",
      "votes": "-2",
      "replies": [
        {
          "text": "আওয়ামীলীগ খারাপ সত্যি কিন্তু রাজাকার আরো জঘন্য খারাপ।",
          "votes": "6",
          "replies": [
            {
              "text": "\"রাজাকার\" শব্দটা \"July Revolution\" এর মাধ্যমে \"Hate Badge\" থেকে \"Proud Badge\" এ পরিণত হয়ে গেছে, সমস্ত revolution হইলো এই একটা শব্দ থেকে। এই শব্দটা এতই over use আর misuse হইছে যে, এইটা একদম হালকা হয়ে গেছে। আর এই revolution তো student রা একা করে নাই, দেশের সকল জনগণও \"রাজাকার\" দের support করছে। আসলে এটা বড়ই দুঃখের ব্যাপার যে, বর্তমানেও এটা ঘটে চলছে, যেটা varsity এর student union এ দেখা গেল। আবার মজার ব্যাপার হচ্ছে যারা এই \"রাজাকার\" দের বিরোধিতা করে তারাও মাঝে মাঝে ভুলক্রমে তাদের প্রশংসা করে ফেলে। হিসাব তো মিলে না। reference included.\nhttps://www.youtube.com/shorts/wP0dC82kYFU https://www.youtube.com/shorts/YFM2LlIVa8s https://www.youtube.com/watch?v=2Pj7Hgr7nf8",
              "votes": "-4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "purotai thik silo just last line ta pura post er lekha guloke ekshate cuddling pong kore dilo. 🤮🤮 Bal bot and Al bot egula diye lav nei. Bangladesh e Facebook er comment post response dekhe ei boter pise tk nosto kore lav nei. maximum user ra voter na. shob jaigai mather rajniti vhinno. mamdani ke dekhen mathe valo silo tai jitse. maanush vote deuar ager always vabbe r a eke to dekhu nai chinio na e ke koi thake? or r a eke to chini bar bar dekhsi er ager bar ei ei korse, omuker jonne onek kosto korse. or kaurei chini na ei markata chini ei dol chini ager term eita eita banaise.",
      "votes": "-1",
      "replies": []
    },
    {
      "text": "Keno islamic biplob dekhe jolche naki dada der 😂",
      "votes": "-4",
      "replies": [
        {
          "text": "ইসলামি বিপ্লব মানে??? ৯২% মুসলিম এর দেশে ইসলামি বিপ্লব হয় না। ওটা মুনাফেকি। যারা এটা বলে তারা মুনাফেক। আর যারা এটা বিশ্বাস করে, তারা ইসলাম পড়ে নাই, জানে না।",
          "votes": "6",
          "replies": [
            {
              "text": "What country had Islamic Revolution in history?",
              "votes": "0",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "😂😂😂😂😂😂",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Apni jamat islam ke rukhe dile aro far right party asbe. Oder theke jamat better . Prithibir shob desh e right wing ase . Apni durgo gorle hite biporit hobe .",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 125
}