{
  "url": "https://www.reddit.com/r/bangladesh/comments/1opfrdj/mamdani_winning_was_a_sign_of_democracy/",
  "hash": "9e0efed11bd9864b064b6e71de7bf665",
  "scraped_at": "2025-12-08T17:33:00.928959",
  "title": "Mamdani winning was a sign of democracy",
  "description": "It is so obvious people choose the policy instead of money , money never can buys u everything. It was people identity and self respect; it’s very clear that people from every aspect did their effort to get involved in to policy making , where at the contrast trump administration did against people and human rights .",
  "votes": "9",
  "comments": [
    {
      "text": "This is what the leftist and centre-leftists in bangladesh should be doing. Instead of sitting around and asking why society is rejecting them, they need to actually go out and beg for votes, rather than demanding it. They got way too used to with hasina being in power to ever bother listening to people.\nMamdani didn't just win based on frustration with the previous mayor. He won because of the work him and his team put into going I to neighborhoods and actually interacting with people.\nWhether he will actually implement half the things he's promised, that's a different story. But American cities wield considerable power when compared to their counterparts elsewhere sow ho knows? I see a strong similarity between him and my mayor, Olivia chow. Best of luck to him, he will need it, especially in a place with so many corporate and political elites like NYC.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Maybe bangu leftists should take a cue and start focusing campaigning on making the society livable for the lower 99% instead of rainbow politics",
      "votes": "3",
      "replies": [
        {
          "text": "Maybe you and your faith should stop trying to dictate how others live and actually show some respect for minorities. Then maybe, just maybe it could be possible. Mamdani was a minority after all. Let’s see you elect a minority mayor who stands up for everyone, not just the majority",
          "votes": "3",
          "replies": [
            {
              "text": "Mamdani is an LGBT supportive minority, Eric Adams is also an LGBT supportive minority. The former is loved by New Yorkers while the latter is hated. Can you guess why?",
              "votes": "0",
              "replies": []
            }
          ]
        },
        {
          "text": "Leftists are forever working for the society and that’s not just speculation or dreams , it’s reality; if you see on the other hand people who spends millions they never find the solution on people thinking ; you never fulfill them without simplicity ; work , food , weekend , a low budget yearly special needs children education, health…that’s what they need actually",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-7",
      "replies": [
        {
          "text": "No he won by focusing on what people actually care about, cost of living.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-7",
      "replies": [
        {
          "text": "A lot of people apparently give a fuck. Under a rock?",
          "votes": "2",
          "replies": []
        }
      ]
    }
  ],
  "id": 136
}