{
  "url": "https://www.reddit.com/r/bangladesh/comments/1op2l5m/tumio_jano_amio_janiora_shobai_pakistani_magura/",
  "hash": "6b3b260d713e2529d6bf0b13637e0b7b",
  "scraped_at": "2025-12-08T17:33:33.079229",
  "title": "''tumio jano amio jani...ora shobai pakistani''. Magura school students protest after Jamaat election campaign stops assembly.😊",
  "description": "Students of Magura Government High School have demanded the removal of the acting headmaster after an incident where they were made to memorize the names of Jamaat candidates during the school assembly. On November 27, at around 12 p.m., during the day section assembly, Acting Headmaster Zahidul Islam introduced Abdul Matin and MB Baker, Jamaat candidates for the Magura-1 and Magura-2 constituencies, to the students. The candidates then made the students repeatedly memorize their names along with the party symbol.\nFollowing the incident, negative reactions from students and parents arose, angry 10th-grade students staged a protest march to the Magura Deputy Commissioner’s office. Students like Shakil and Sakkar demanded the school be kept free from politics and called for the removal of the accused headmaster. They later submitted a memorandum to the Deputy Commissioner, copying the Ministry of Education Secretary and District Education Officer.\nMagura District Commissioner Md. Ahidul Islam stated that an investigation into the students' complaint has been assigned to the District Education Officer. Appropriate action will be taken following the investigation.",
  "votes": "163",
  "comments": [
    {
      "text": "Praiseworthy protest from the students.",
      "votes": "66",
      "replies": []
    },
    {
      "text": "These are your real students. Apolitical, yet burning with national identity, common sense and pride.",
      "votes": "49",
      "replies": []
    },
    {
      "text": "Kudos to the kids. It takes guts to raise such voice at this moment 👏",
      "votes": "35",
      "replies": []
    },
    {
      "text": "W students",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Damn, not only I was right that half the student in that assembly couldn't give less fuck about the jamaat. The reality was even more pleasantly suprising.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Big Ws",
      "votes": "8",
      "replies": []
    },
    {
      "text": "জামাতের ব্রেইনোয়াস প্রজেক্ট টা এমন ই, ওরা নাবালক দের আগে সদস্য করে। এবং যতদিনে তারা বুঝের হয় ততদিনে তাদের একটা সময় চলে যায়। আর কেউ যদি জামাতের কোন নীতি নিয়ে প্রশ্ন করে এটা কেন??? সাথে সাথে বহিষ্কার। বেশির ভাগ সদস্য ই চায় না, যে প্রশ্ন তুলে বহিষ্কার হবে, কারন জীবনের বিরাট একটা সময় তো এই দলের পিছনে বিনিয়োগ হয়ে গেছেই।",
      "votes": "24",
      "replies": []
    },
    {
      "text": "Source jugantor: https://www.jugantor.com/country-news/1024402",
      "votes": "14",
      "replies": []
    },
    {
      "text": "It has been a while I have heard something positive regarding students. Kudos to them and I hope more follows their footsteps.",
      "votes": "20",
      "replies": [
        {
          "text": "When injustice becomes law, resistance becomes duty. 😅",
          "votes": "11",
          "replies": []
        }
      ]
    },
    {
      "text": "khomotai na peyei era school college and mashjid e giye je disturbing kaj kam kortese era shamann khomotar vag peleu onek jalabe bojhai jaitese.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "I am so proud of them. This is the Bangladesh we were looking for.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "আমি তখন ক্লাস সিক্সে পড়ি। তখন এই জামাত-বিএনপির চার দলীয় ঐক্যজোট সরকার। তো তখন জাশি'র এক সাথী ভাই স্কুলে এসে তাদের সদস্য সংগ্রহ করা শুরু করল আমাদেরকে ফরম দিল আমরা পূরন করলাম। কিন্তু কতজন শিবিরে যোগ দিয়েছিল তা বলতে পারব না।",
      "votes": "4",
      "replies": []
    },
    {
      "text": "They have more guts than me ❤️",
      "votes": "3",
      "replies": []
    },
    {
      "text": "BAL dalal student 😡😡😡",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Video ?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Based",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 138
}