{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oniram/%E0%A6%A2%E0%A6%95%E0%A7%AD_%E0%A6%86%E0%A6%B8%E0%A6%A8%E0%A6%B0_%E0%A6%A4%E0%A7%8E%E0%A6%AA%E0%A6%B0%E0%A6%AF/",
  "hash": "5dde4eb6953446ada5d2170ca8fe7757",
  "scraped_at": "2025-12-08T17:36:58.940013",
  "title": "ঢাকা-৭ আসনের তাৎপর্য",
  "description": "ঢাকা-৭ (জাতীয় সংসদ সংসদীয় আসন নং ১৮০) হচ্ছে দেশের রাজধানীর পাশাপাশি পুরা দেশের অর্থনৈতিক কেন্দ্রবিন্দু। এই আসনে ঢাকার সবচাইতে বেশি সংখ্যক ওয়ার্ড আছে যার সবগুলোই ব্যাবসায়িক হাব হিসেবে পরিচিত। এতে আছে ঢাকা দক্ষিণ সিটি কর্পোরেশনের (DSCC) ওয়ার্ড নম্বর ২৩—৩১ (লালবাগ) এবং ৩২, ৩৩, ৩৫, ৩৬ (কোতয়ালী)। যে এই ঢাকা-৭ আসনে নির্বাচিত হবে, সে নির্দ্বিধায় দেশের অর্থনীতির একান্ত রক্ষকের ভূমিকায় থাকবে। আমার এলাকা উক্ত আসনের অধীন থাকার কারণে ছোটকাল থেকেই এর জন্য কাড়াকাড়ি দেখে বড় হয়েছি। এই আসনের জন্য তো হাজার কোটি টাকা বিনিয়োগ করাও খুবই সস্তা বিনিয়োগ মনে করে অনেকে। কারণ নিজের প্রার্থী ক্ষমতায় আনতে পারলে বছরে ৫০ হাজার কোটি টাকার মুনাফা করাও পানির মতো সহজ হয়ে যাবে। আসনটির দাপট ঢাকার ভেতর এবং বাহিরে লক্ষ্যণীয়। ঢাকা-৭ অন্তর্ভুক্ত একটা ছোট্ট পাইকারি মার্কেটের উপরেও বাংলাদেশের ৬৩ জেলার প্রায় ২৯০টি আসনের মানুষ নির্ভর করে। কারণ এখানে না বিক্রি হলে কোথাও হবে না, আর বেচাকেনা না হলে এরা পেট চালাতে পারবে না। ছোট-মাঝারি পাইকারী/হোলসেল মার্কেট (যেমন — কামরাঙ্গীরচর ভিত্তিক বাজার, চকবাজারের নির্দিষ্ট পাইকারি জোনের অংশ) আছে, যা কাপড়, পোশাক, ব্যাগ, গয়না-প্রভৃতি পণ্যের পাইকারি সরবরাহে পরিচিত। এই মার্কেটগুলোর গ্রাহক ও রুট ঢাকার বাইরে দেশের অনেক জেলা পর্যন্ত বিস্তৃত যার কারণে দেশের অর্থনীতির এক বিশাল অংশ উক্ত আসন ছাড়া অচল। স্থানীয় পাইকারি বাজারগুলোতে দোকানপাটের পাশাপাশি পরিবহন, গুদামজাতকরণ, লজিস্টিক সেবাদি এবং ক্ষুদ্র শিল্পজগৎ (কাটা-সেলাই, প্যাকেজিং, হোলসেল ট্রেডিং) জড়িত। অর্থাৎ প্রত্যক্ষ ও পরোক্ষভাবে বৃহৎ কর্মসংস্থান এবং নগদ-চলাচল তৈরি করার জন্য ঢাকা-৭ আসনের অপরিসীম। ঢাকা শহরের নির্বাচনী ইতিহাসে আসনের সীমানা ১/১১-র সরকার কর্তৃক ২০০৮ সালে পরিবর্তিত হয় (রিডিস্ট্রিক্টিং)। এসব রাজনৈতিক পরিবর্তনকে স্থানীয় ব্যবসা-নীতির সাথেই সামঞ্জস্য রেখে করা হয়েছিলো।",
  "votes": "10",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I am just interested in seeing the drama unfolding at Dhaka -17..andaleev partho tasnim Jara and hero alom..man I want a front row seat to that",
      "votes": "4",
      "replies": []
    }
  ],
  "id": 150
}