{
  "url": "https://www.reddit.com/r/bangladesh/comments/1on9zwv/khaleda_for_dinajpur3_bogura7_tarique_for_bogura6/",
  "hash": "7fa1036619be42cf2534f14474512a89",
  "scraped_at": "2025-12-08T17:38:02.956476",
  "title": "Khaleda for Dinajpur-3, Bogura-7; Tarique for Bogura-6: BNP names 232 potential candidates for national polls",
  "description": null,
  "votes": "69",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "She needs to retire. She is old.",
      "votes": "36",
      "replies": [
        {
          "text": "Safe seat emni emni hatchara korbe? Lol",
          "votes": "9",
          "replies": []
        },
        {
          "text": "If she's old and should retire, let the people decide by not electing her.",
          "votes": "4",
          "replies": []
        },
        {
          "text": "do you want bnp to choose you? so they loose the seat",
          "votes": "-3",
          "replies": [
            {
              "text": "Are you saying they need 1 seat to win?",
              "votes": "6",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Seriously how are people okay with her being in election right now? I respect that maybe during her time she was an exemplary politician and a very good person but the fact she is still contesting in the election despite knowing she is I'll and will be physically incapable of performing mp duties even if she wins and she will win as she is the head of BNP. But this portrays how lightly we take national elections not thinking who will be the best to govern us but based on emotions or political relations and other stuff .",
      "votes": "15",
      "replies": [
        {
          "text": "they need the seat",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Dead man tells no tales. What can this dead lady give us?!",
      "votes": "14",
      "replies": []
    },
    {
      "text": "The Mummy Returns!",
      "votes": "11",
      "replies": []
    },
    {
      "text": "Khaleda is a Dinajpur sadar girl. Her sister was elected in this seat. If she stands for the election here, there is no power in hell she's going to lose.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "She's very popular and politics is a popularity contest. She also has ties to the area, just kind of how politics works. If AL had fair elections in 2024 and gave up power, we would probably be in a better place as a country, but BNP should win this election only question is by how much and how many seats do Jamat pick up. People drastically overstate how bad the BNP is in terms of fear mongering, for better or worse both the AL and the BNP are vastly better administrators of their country than most of our socioeconomic peers countries 30 years ago. We have been one of the fastest growing countries over the last 3 decades, and there's no reason to believe it will change under BNP rule given we grew well under the 10 years they governed in the past.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "https://www.tbsnews.net/bangladesh/politics/khaleda-contest-dinajpur-3-tarique-bogura-6-bnp-names-232-potential-candidates",
      "votes": "2",
      "replies": []
    },
    {
      "text": "https://www.tbsnews.net/bangladesh/politics/khaleda-contest-dinajpur-3-tarique-bogura-6-bnp-names-232-potential-candidates",
      "votes": "2",
      "replies": []
    },
    {
      "text": "So, I'm guessing she will give up the seat for some other BNP member later on and then Tarique will be the leader of the party and PM if they win the election. Also, who is NCP selecting as their \"leader\", isn't Nahid too young to even qualify for PM?",
      "votes": "2",
      "replies": []
    },
    {
      "text": "better then jamat, direct implementation of 1984",
      "votes": "3",
      "replies": [
        {
          "text": "better then jamat, direct implementation of 1984",
          "votes": "3",
          "replies": [
            {
              "text": null,
              "votes": "6",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "This old women cant just leave us alone this family",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Mommy after smelling power !",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Another fascist coming (2)",
      "votes": "-4",
      "replies": [
        {
          "text": "",
          "votes": "1",
          "replies": []
        },
        {
          "text": "Jamat bot",
          "votes": "0",
          "replies": [
            {
              "text": "Reddit e bnp o ase",
              "votes": "-1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Ehh, I thought she would sit for phulgazi feni as that's her hometown",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 154
}