{
  "url": "https://www.reddit.com/r/bangladesh/comments/1omj9xq/amar_mayor_tomar_mayor_mamdani_mamdani/",
  "hash": "2031ebd5d339c8c2bed50c4e6635aa1b",
  "scraped_at": "2025-12-08T17:38:53.006483",
  "title": "\"Amar Mayor, Tomar Mayor, Mamdani Mamdani!\"",
  "description": "",
  "votes": "71",
  "comments": [
    {
      "text": "I would like to see him as my Prime Minister.",
      "votes": "20",
      "replies": [
        {
          "text": "I’d like to see him as my president.\n~ Sincerely, a disgusted American.",
          "votes": "7",
          "replies": []
        }
      ]
    },
    {
      "text": "Praying he wins. Seems to genuinely value the diversity of NYC.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Man I love this so much . This guy is running a campaign of so much joy and hope and putting in the effort. Every Bangladeshi I know on NYC is voting for him.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Finally a socialist trying to bring real change instead of hiding behind an economic or aesthetic facade. I hope this guy wins. Its good to see the youth on a global level supporting this guy, his policies are actually good.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "He thanked the Bangladeshi aunties for working on his campaign by going from door to door. He really loves Bangladeshis and is a staunch Anti-BJP, Anti-RSS and Anti-India candidate. I really hope and pray he wins this election.",
      "votes": "2",
      "replies": [
        {
          "text": "Mamdani literally did a campaign video in Hindi addressing Indian Americans. What are you talking about? XD",
          "votes": "4",
          "replies": []
        },
        {
          "text": "He's not Anti-India. He is Indian himself!",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "XD",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Source:\nSozoo Today FB Post.\nTBS Article: 'Amar Mayor, Tomar Mayor, Mamdani Mamdani': Bengalis bring election-chant spirit to New York\nZohran Mamdani IG Post.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "-5",
      "replies": [
        {
          "text": "I don't think it's only because of Shahana Hanif. Zohran was the assembly member representing Astoria one of the biggest deshi enclaves and he did a great job. Same for his work with the NYTWA - so many deshi uncles are can drivers. Lastly his aide Zara Rahim and DRUM beats really cemented his support. I like Hanif but tbh she was closer to Lander in the primary cause she worked for him before getting elected to city council.\nNot sure why you are getting downvoted tho",
          "votes": "2",
          "replies": [
            {
              "text": "The bengali community was definitely one of the first large communities that backed him because he focused on getting their support knowing they were not very active politically and he's shown his appreciation for them multiple times. I've only seen Hanif with Mamdani and her addressing the bengali community in support of him. DRUM connect is a Bangladeshi woman kazi fouzia who has been working with hanif for a really long time.",
              "votes": "6",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "https://www.facebook.com/reel/668211722942609/?mibextid=ZZyLBr",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Love this guy",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "-3",
      "replies": []
    },
    {
      "text": "",
      "votes": "-33",
      "replies": [
        {
          "text": "He is going to win. There is no way cuomo can win this election.",
          "votes": "15",
          "replies": [
            {
              "text": "",
              "votes": "-10",
              "replies": []
            }
          ]
        },
        {
          "text": "Ah yes the politics understander has logged on!",
          "votes": "3",
          "replies": []
        },
        {
          "text": "thats what i was thinking as well same shit happened with trump",
          "votes": "7",
          "replies": [
            {
              "text": "People favored Hilary in the 2016 US presidential election. But, ultimately Trump won the election... US politics is so lame in the world. People won't elect the best, but the rich, elite backed, narcissistic one...",
              "votes": "6",
              "replies": []
            }
          ]
        },
        {
          "text": "https://www.nytimes.com/live/2025/11/04/nyregion/nyc-mayor-election\nHistory!",
          "votes": "2",
          "replies": []
        },
        {
          "text": "He is gonna win and it won't even be close.",
          "votes": "3",
          "replies": []
        }
      ]
    }
  ],
  "id": 157
}