{
  "url": "https://www.reddit.com/r/bangladesh/comments/1om9p3k/%E0%A6%8F%E0%A6%95%E0%A6%A4%E0%A6%A4%E0%A6%B0%E0%A6%B0_%E0%A6%B9%E0%A6%A4%E0%A6%AF%E0%A6%AF%E0%A6%9C%E0%A6%9E_%E0%A6%B8%E0%A6%B6%E0%A6%B2%E0%A6%B7%E0%A6%9F%E0%A6%A4%E0%A6%B0_%E0%A6%85%E0%A6%AD%E0%A6%AF%E0%A6%97_%E0%A6%AD%E0%A6%A4%E0%A6%A4%E0%A6%B9%E0%A6%A8_%E0%A6%9C%E0%A6%AE%E0%A7%9F%E0%A6%A4_%E0%A6%87%E0%A6%B8%E0%A6%B2%E0%A6%AE/",
  "hash": "6ee1480a5e61521a5a00c9bae3b4c716",
  "scraped_at": "2025-12-08T17:39:12.647892",
  "title": "একাত্তরের হত্যাযজ্ঞে সংশ্লিষ্টতার অভিযোগ ভিত্তিহীন: জামায়াতে ইসলামী",
  "description": null,
  "votes": "1",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "ডাহা মিথ্যা",
      "votes": "15",
      "replies": []
    },
    {
      "text": "ডাহা মিথ্যা কথা",
      "votes": "7",
      "replies": []
    },
    {
      "text": "মিঞা খলিফা ভার্জিন।",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Bangladesh will only be whole when those who betrayed the nation are held to account. We must dismantle Rajakar networks through legal action, institutional reform, and civic vigilance. Rajakars have no rightful place in Bangladesh.",
      "votes": "5",
      "replies": [
        {
          "text": "Hopefully we can achieve this, Jamaat should've been completely banned a long long time ago they are against the existence of Bangladesh",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Not only was Jamaat against our liberation war, the party also fought actively against our freedom fighters, committed numerous war crimes, and was also involved in the killing of our intellectuals on 14th December. Quoting from Recognizing the 1971 Bangladesh Genocide:\nIronically, one of the most critical pieces of evidence about the 1971 Bangladesh Genocide comes from Pakistan in the form of the Report of the Hamoodur Rahman Commission’s Inquiry into the 1971 War.\nPakistan President and later Prime Minister Zulfiqar Ali Bhutto (December 1971 - July 1977) established the inquiry primarily to investigate the events behind their defeat and subsequent surrender on 16 December 1971. In August 2000, the Pakistani daily Dawn and the Indian magazine India Today released excerpts from the report. However, substantial portions of the report remain highly classified and inaccessible.\nWhile contesting the official number of deaths by a large margin, the report indicated that mass killings of civilians had genuinely occurred during 1971. The report also recounts army officials’ testimony about plotting to arrest and interrogate Bangladeshi intellectuals in December 1971, based on a list they compiled with the cooperation of local collaborators. A copy of the list was discovered in Bangladesh and later published in the media. Many intellectuals on that list were kidnapped and murdered in December 1971 - their families are witnesses to that tragedy. We shall be doing a grave disservice to the martyrs and victims of the genocide if we do not acknowledge it as such.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "",
      "votes": "16",
      "replies": [
        {
          "text": "",
          "votes": "-6",
          "replies": [
            {
              "text": "কওমিরা জামাত বিরোধী বলেই যে সঠিক সেটা তো না। কওমিরা এদেশের গণতন্ত্র বদলে তালেবানি তন্ত্র প্রতিস্টা করতে চায়। শাহবাগি সহ সমস্ত বিজ্ঞানসম্মত সমস্ত শিক্ষার বিরোধীতা করে, সমকামিতার বিরোধীতা করে অথচ নিজেরা ই বলৎকারের ওস্তাদ",
              "votes": "7",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "😂😂😂 71 সালে জামাতের নেতৃত্বে দেশ স্বাধিন হয়েছে, এটা বলে নাই যে, সেটাই সৌভাগ্য 👀👀👀 কারন এদেশে পাঞ্জাবি টুপি লাগায়া বলৎকার ধর্ষন করলে ও কোন পাপ হয় না 🆘🆘🆘",
      "votes": "11",
      "replies": [
        {
          "text": "কিছুদিন পরে সেটাও বলবে। চেষ্টা তো চলছে। এই যেমন কিছুদিন আগে গো.আযম কে ইতিহাসের মহানায়ক বানানোর পোস্ট দিয়ে একটু বাজিয়ে দেখলো জাতিকে।",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "The LIE of the history",
      "votes": "3",
      "replies": []
    },
    {
      "text": "একেই বলে রাজনীতি। ইসলঅমের নামে মিথ্যার ফুলঝুরি!!",
      "votes": "2",
      "replies": []
    },
    {
      "text": "ভেজাল ছাড়া একেবা‌রে কাচা মিথ‌্যা কথা। মানুষ কিভা‌রে পা‌রে এভা‌বে দি‌নে দুপু‌রে মিথ‌্যা বল‌তে!",
      "votes": "2",
      "replies": []
    },
    {
      "text": "আওয়ামী আর জামাতের মধ্যে মিল হলো, দুই দলই চেতনায় বিশ্বাসী।। আর দুই দলই অপকর্মে পর জনগণের কাছে ক্ষমা চাইতে অস্বীকার করছে।।",
      "votes": "-2",
      "replies": [
        {
          "text": "Deksen, apni kinto jamaat er against e bolsen. Tao gorte thaka ek bishes srenir manusher gaye lagse.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-9",
      "replies": [
        {
          "text": "গোয়াজম দেশদ্রোহী এবং হারামি, এটা অলরেডি প্রমাণিত; এর বিপরীতে সকল বক্তব্য রিভিশনিজম বাদে কিছুই না জনাব",
          "votes": "8",
          "replies": []
        },
        {
          "text": "পুরানো পত্রিকার আর্কাইভে গিয়া দৈনিক সংগ্রাম পইড়া দেইখেন।",
          "votes": "4",
          "replies": []
        },
        {
          "text": "Hm...",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "https://www.facebook.com/reel/668211722942609/?mibextid=ZZyLBr",
      "votes": "1",
      "replies": []
    },
    {
      "text": "BAL has already spent more than 50 years establishing this fuking fact and using it as a card in politics, Mujib forgives the Rajakars, Albodors, etc, and never gives priority trial to them, which was more important issue at that time. Now this fuking BAL narrative again tries to establish to cover July mass killing. BD needs to move forward to further this fuking shit 💩 make hell the country. It’s like rolling loop, when you think progressive this fuking narrative comes from Bangu Sushil.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Me when I'm lying and my opponent is:",
      "votes": "1",
      "replies": []
    },
    {
      "text": "তাহলে এখন বলবে সব বীর মুক্তিযোদ্ধাদের ধারা সঙ্গঠঠিত হয়েছে।",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 158
}