{
  "url": "https://www.reddit.com/r/bangladesh/comments/1olkhem/why_are_the_current_bangladeshi_political_parties/",
  "hash": "748ca4dd72b1f8ab2741fdc6b3af4b29",
  "scraped_at": "2025-12-08T17:40:36.262273",
  "title": "Why are the current Bangladeshi political parties so busy infighting or fighting with each other, despite knowing that one of them must eventually come to power and rebuild the nation?",
  "description": "What makes them think they can handle all the chaos later, or why are they willingly ready to plunge into a state of turmoil for a short time? Have they forgotten they need to bring the economy back on track? What is the reason for this confidence?",
  "votes": "7",
  "comments": [
    {
      "text": "This is part of politics",
      "votes": "3",
      "replies": []
    },
    {
      "text": "its literally the situation with this whole damn country. its not only some political parties, it's literally everyone fighting each other. and people who deserve the power, good people, responsible people, educated people...they can either leave this country or just watch this clown show.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Because nobody cares about the country or \"rebuilding\". The entire motivation to join politics in Bangladesh comes from amassing wealth through corruption. People want to come to power to extract the country and people's wealth not because they love their country.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Because these students just created power vacuum not reforms, funny how they thought removed hasina job done",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Forget political parties I am pissed off at the talk shows of all channels. All the talk shows talk about are the statements made by politicians over and over again. Why don't they talk about the problems and national issues of the country ever? Maybe if something goes viral they will mention it once or twice and go back to highlighting or bashing political parties.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 163
}