{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ofsj99/on_a_scale_of_110_1_being_awful_10_being/",
  "hash": "73c3f8a638a27f5c9a9af9aac514b526",
  "scraped_at": "2025-12-08T17:45:36.469211",
  "title": "On a scale of 1-10, 1 being awful, 10 being brilliant, rate this interim government.",
  "description": "Curious to hear why?",
  "votes": "350",
  "comments": [
    {
      "text": "I rated 3-5 for the following reasons:\nFor trying to increase the share of solar in the electricity mix. The deep state backed by political parties are blocking their efforts, but they are still trying. I will show proof if you ask.\nFor avoiding Sri Lanka like situation by increasing foreign reserve.\nFor trying to protect the environment despite pressure from political parties. They failed in most places because Govt employees don't listen, but they at least tried, which no previous government did.\nThey are not getting a higher score because of the law and order situation, for not resisting pressure from political parties and some other reasons.",
      "votes": "13",
      "replies": [
        {
          "text": "I think reason 2 has a different scenario. Sri Lanka's main economy relies on tourism and other exports, but Bangladesh's main export income depends on RMG. If the Taka value appreciates now, our RMG exports will decrease foreign orders, and the current government's $ 32 billion reserve would not be possible and most MNCs might leave bd because of reserve reasons.",
          "votes": "5",
          "replies": [
            {
              "text": "Taka has appreciated against the dollar after Trump came to power, but the Bangladesh Bank managed to keep it weak by buying more dollar from the banks.",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "Hello I'm really interested in your line of work and interests, can we talk if you have social media, I cannot find an option to dm you on reddit",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "7-9 : This government has inherited a rotten system with a hostile neighbor. Almost every other day this government has to do firefighting on different fronts. What they have done so far is commendable as the situation could have been worse.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "-10",
      "votes": "8",
      "replies": []
    },
    {
      "text": "I rated 1-3.\nReason : I had very high expectations from Yunus. BUt turns out he is a spineless looser who have no courage to stand tall. He already surrendered to the randical forces. He couldnt demolish the corrupt bureaucracy, people who ran Hasina's regims are still running the country.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "1-3 is reserved for all the auth regimes. That's why I voted 3-5",
      "votes": "3",
      "replies": []
    },
    {
      "text": "I'm giving 3-5 cause I believe there are a few good decent people (ill say Yunus moderate) but they all are cowards who couldn't stand against the other corrupts. Letting them achieve free reign over the country.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": [
        {
          "text": "Goddamn not this joke again",
          "votes": "-3",
          "replies": [
            {
              "text": "Whats the context of it?",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "6-7 ✌️🤣🤣🤣💔💔",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "0 should be an option as I wanna give these idiots a big fat 0",
      "votes": "0",
      "replies": []
    },
    {
      "text": "0: BAL Govt (2024)\n1: Under Mujib (1973-1975)\n2: BAL Govt (2009 - 2023)\n3: BAL Govt (1996 - 2001)\n4: Fakhruddin Caretaker (2007 - 2009)\n5: Under Ershad/JP (1983 - 1990)\n6: Yunus Interim (2024 - Present)\n7: BNP Govt (2001 - 2006)\n8. BNP Govt (1991 - 1996)\n9: Under Ziaur Rahman (1977 - 1978)\n10: BNP Govt (1979 - 1982)",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Damn! I gave it 3-5 based on my mixed feelings and am genuinely surprised to see most of the votes on that option! We don't agree on most of the stuff on this sub, but ig our feelings about this shitty interim government remains the same.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 180
}