{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ofdsjy/%E0%A6%B8%E0%A6%AC%E0%A6%95_%E0%A6%AA%E0%A6%B0%E0%A6%A7%E0%A6%A8_%E0%A6%AC%E0%A6%9A%E0%A6%B0%E0%A6%AA%E0%A6%A4_%E0%A6%96%E0%A7%9F%E0%A6%B0%E0%A6%B2_%E0%A6%B9%E0%A6%95%E0%A6%B0_%E0%A6%B0%E0%A6%9C%E0%A6%A8%E0%A6%A4%E0%A6%95_%E0%A6%86%E0%A6%9F%E0%A6%95/",
  "hash": "6217d350631a533f049b05b983a5cf58",
  "scraped_at": "2025-12-08T17:45:55.706818",
  "title": "সাবেক প্রধান বিচারপতি খায়রুল হকের রাজনৈতিক আটক",
  "description": "\"বাংলাদেশের সাবেক প্রধান বিচারপতি এ বি এম খায়রুল হক কারাবন্দী আছেন। তাঁর গ্রেপ্তার ও চলমান কারাবাস হাসিনা-পরবর্তী বিচারব্যবস্থার জন্য একটি বড় কালো অধ্যায়।\nএ ধরনের গ্রেপ্তার আওয়ামী লীগ আমলের সঙ্গে সাদৃশ্যপূর্ণ। এভাবেই তখন আইনশৃঙ্খলা প্রয়োগ আর বিচার বিভাগ রাজনৈতিক হুকুমের আজ্ঞাবহ হয়ে উঠেছিল। এমন স্বৈরাচারী ব্যবস্থার কারণেই আইনের শাসনের ওপর কোনো আস্থা ছিল না।\nআজ যাঁরা ক্ষমতায় আছেন, তাঁদের অনেকেই একসময় এসব প্রতিষ্ঠানের রাজনৈতিক অপব্যবহারের কঠোর সমালোচক ছিলেন; কিন্তু তাঁরা এখন হয় নিজেরাই এই অন্যায়ের সহযোগী হয়েছেন, নয়তো সব দেখেও মুখে কুলুপ এঁটে আছেন। যে দুর্নীতিগ্রস্ত ব্যবস্থাকে তাঁরা আগে নিন্দা করতেন, এখন সেটিকেই তাঁরা নিজেদের রাজনৈতিক স্বার্থে ব্যবহার করছেন।\n২০১৭ সালে তৎকালীন প্রধান বিচারপতি সুরেন্দ্র কুমার সিনহা একটি গুরুত্বপূর্ণ সাংবিধানিক মামলায় সরকারের বিরুদ্ধে রায় দিয়েছিলেন বলে আওয়ামী লীগ সরকার তাঁকে পদত্যাগ করতে এবং দেশ ছাড়তে বাধ্য করেছিল। সিনহাকে চাপ দেওয়ার অংশ হিসেবে ডিরেক্টরেট জেনারেল অব ফোর্সেস ইন্টেলিজেন্স (ডিজিএফআই) তাঁর এক ঘনিষ্ঠ সহযোগীকে গুম করেছিল এবং হুমকি দিয়েছিল, সিনহা যদি পদত্যাগ করে দেশ না ছাড়েন, তাহলে তাঁকে গুম করে রাখা হবে।\nএটা ঠিক, বর্তমান সরকার সেই পর্যায়ের সীমা লঙ্ঘন করেনি। কিন্তু আরেক দিক থেকে তারা আবার আরও বেশি চরম মাত্রায় গেছে। তারা একজন সাবেক প্রধান বিচারপতিকে মিথ্যা বা উদ্দেশ্যপ্রণোদিত অভিযোগে কারাগারে পাঠিয়েছে। আওয়ামী লীগ পর্যন্ত তাদের দমন-পীড়নের চরম সময়েও এমন করেনি।\nনিঃসন্দেহে আওয়ামী লীগের কর্তৃত্ববাদী শাসনকালে বিচারবহির্ভূত হত্যা, গুম ও কাঠামোগত দুর্নীতির মতো ভয়াবহ অপরাধ সংঘটিত হয়েছিল। যেখানে এসব অপরাধের বিষয়ে বিশ্বাসযোগ্য ও শক্ত প্রমাণ আছে, সেসব ক্ষেত্রে জড়িত ব্যক্তিদের অবশ্যই বিচারের আওতায় আনা উচিত।",
  "votes": "4",
  "comments": [],
  "id": 181
}