{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oath8o/%E0%A6%A8%E0%A7%9F%E0%A6%96%E0%A6%B2%E0%A6%A4_%E0%A6%9B%E0%A6%A4%E0%A6%B0%E0%A6%B6%E0%A6%AC%E0%A6%B0_%E0%A6%93_%E0%A6%AF%E0%A6%AC%E0%A6%A6%E0%A6%B2%E0%A6%B0_%E0%A6%A8%E0%A6%A4%E0%A6%95%E0%A6%B0%E0%A6%AE%E0%A6%A6%E0%A6%B0_%E0%A6%AE%E0%A6%A7%E0%A6%AF_%E0%A6%B8%E0%A6%98%E0%A6%B0%E0%A6%B7%E0%A6%B0_%E0%A6%98%E0%A6%9F%E0%A6%A8_%E0%A6%98%E0%A6%9F%E0%A6%9B/",
  "hash": "ebe1b4f9f6dd764349a88d8e8953d468",
  "scraped_at": "2025-12-08T17:49:24.527344",
  "title": "নোয়াখালীতে ছাত্রশিবির ও যুবদলের নেতাকর্মীদের মধ্যে সং'ঘ'র্ষে'র ঘটনা ঘটেছে।",
  "description": "নোয়াখালীর সদর উপজেলার নেওয়াজপুর ইউনিয়নের কাশেমবাজার এলাকায় ইসলামী ছাত্রশিবির ও যুবদলের মধ্যে সংঘর্ষের ঘটনা ঘটেছে। রোববার (১৯ অক্টোবর) বিকেলে এ ঘটনায় উভয় পক্ষের অন্তত ২৫ জন আহত হয়েছেন। তাদের কয়েকজনকে নোয়াখালী জেনারেল হাসপাতালে ভর্তি করা হয়েছে।প্রত্যক্ষদর্শীরা জানান, আছরের নামাজের পর প্রতিযোগিতা শুরু হলে মসজিদের বাইরে যুবদলের নেতাকর্মীরা 'জিয়ার সৈনিক' স্লোগান দেন। এ সময় উভয়পক্ষের মধ্যে উত্তেজনা ছড়িয়ে পড়ে এবং সংঘর্ষে রূপ নেয়। সংঘর্ষের সময় মসজিদের ভেতরে অবস্থান নেয় ছাত্রশিবির সদস্যরা এবং বাইরে বিক্ষোভ করতে থাকেন যুবদলের নেতাকর্মীরা।\nইসলামী ছাত্রশিবিরের কেন্দ্রীয় কার্যকরী পরিষদের সদস্য ও নোয়াখালী শহর শাখার সভাপতি হাবিবুর রহমান আরমান বলেন, 'আমাদের শান্তিপূর্ণ কোরআন ক্লাসে যুবদল পরিকল্পিতভাবে হামলা চালিয়েছে। আমাদের ভাইয়েরা মসজিদে আহত অবস্থায় পড়ে আছে।'\nআহতদের মধ্যে রয়েছেন- হাসান (২২), দেলোয়ার হোসেন মিশু (২৪), আবিদ (২০), সালাউদ্দিন (১৯), সাইমুন ভাই (২০), আব্দুল আজিজ (২৫), তানবির সিয়াম (২৭), সাকিব উদ্দিন মাহমুদ (১৪), মিনহাজ মাহমুদ (১৯), মো. বিলাল হোসেন (২৪), হাসানুর রহমান (২৪), মো. সোহাগ (২৪), নাঈম (১৪), আরিফুল ইসলাম (১৮), আল-আমিন (২২)।\nঅন্যদিকে নেওয়াজপুর ইউনিয়ন বিএনপির প্রচার সম্পাদক মো. আক্তার, দফতর সম্পাদক জাহাঙ্গীর, ইউনিয়ন ছাত্রদলের সাবেক সভাপতি জিয়াউর রহমানসহ ৮ জন নেতাকর্মী নোয়াখালী জেনারেল হাসপাতালে চিকিৎসাধীন আছেন।",
  "votes": "15",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "মসজিদ রাজনীতির যায়গা না। এখন যদি বাকি সব দল মসজিদ ভিত্তিক রাজনীতি করতে চায়????",
      "votes": "1",
      "replies": [
        {
          "text": "এখন রাজনীতি জায়গা করে ফেলা হয়েছে। আমার এলাকায় রেললাইন এর সঙ্গে এক মসজিদে জামাতের দখলে সেখানে pro জামাত ওয়াজ হয় প্রতি শুক্রবারে এবং এর ২০০ গজ দূর আরেকটি মসজিদে বিএনপির দখলে সেইম প্রতি শুক্রবার বেগম জিয়া তারেক জিয়া করতে করতে শেষ হয়।",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 193
}