{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oa10r3/this_government_is_too_weak_to_rule_this_country/",
  "hash": "70d837da2f2b077585df305abc4fa4fb",
  "scraped_at": "2025-12-08T17:49:40.663925",
  "title": "This government is too weak to rule this country",
  "description": "It's 14 months already. This government has been failing miserably in every aspect. They hasn't been able to ensure public safety, law and order situation is pathetic. They have no intention of stopping mob. It seems that they are patronizing mob violence. The economic situation is also under threat. The industries are being closed. Unemployment problem is rising. Foreign policy is highly questionable. All things are messed up. If they continue without arranging a good election, it will be disastrous for the country.",
  "votes": "57",
  "comments": [
    {
      "text": "The Yunus administration is weak by design. They didn't come to the power after election, they are not a military-backed regime, they don't have strong-supporters at root level.",
      "votes": "33",
      "replies": [
        {
          "text": "That's why their prolongation in power is not working. They must ensure to hold a free, fair and inclusive election.",
          "votes": "8",
          "replies": [
            {
              "text": "Indeed, that's their only purpose.",
              "votes": "10",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Too weak or they want to rule like this",
      "votes": "12",
      "replies": [
        {
          "text": "Too weak, too coward, too evil.",
          "votes": "11",
          "replies": []
        }
      ]
    },
    {
      "text": "Weak? Are they even trying? They are puppet govt placed by jamaat, jamaat will also play opposition party by themselves, I'll not be surprised if jamaat team b (NCP) started to play that role.",
      "votes": "15",
      "replies": [
        {
          "text": "They're not trying. They're favoring Jamaat and NCP.",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "They are not failing , they are doing exactly what they are designed to do. Making Bangladesh a foreign, especially the west dependent nation. Port will be given for 30 years in December, the Bay of Bengal will be leased, the airport will be leased. These are confirmed so far.",
      "votes": "15",
      "replies": [
        {
          "text": "This is very true. Yunus was always going to be a western puppet. America has been planning to put him in power with one excuse or another for a long time, and failing. But in the end, they succeeded in getting what they wanted. Once they get what they want, ports, military bases, etc, they will just make the next government tow their line.\nJamat was clearly smart spotting this power vacuum and pouncing on it. They will ultimately do America's bidding while keeping the domestic population in check with their religious flavor authoritarian governments somewhat similar to the middle east countries.",
          "votes": "2",
          "replies": []
        },
        {
          "text": "And under Hasina, we were India's slaves\nPort needs to be leased as now it is being run by cadres on basis of bribes",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "\"Agreed! There is only one core problem – the immediate arrangement of a credible election. Otherwise, the country's overall situation will deteriorate further.\"",
      "votes": "2",
      "replies": []
    },
    {
      "text": "When Rome was burning, Nero was playing the flute; when Dhaka was burning, Yunus was signing the July Charter.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "\"Revolution\" ;3",
      "votes": "3",
      "replies": []
    },
    {
      "text": "It's the Revolution Baiibeeeeeeeeeeeee XD",
      "votes": "3",
      "replies": [
        {
          "text": "Revolution/uprising was inevitable. Sheikh Hasina closed all doors of the transfer of power.",
          "votes": "8",
          "replies": [
            {
              "text": "Enjaaaaaaaaaaaaaaaaay XD XD XD",
              "votes": "-1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I FIXED IT: THIS GOVERNMENT IS UNABLE TO RULE THIS COUNTRY! OR, THIS GOVERNMENT IS FAILURE TO REULE THIS COUNTRY!",
      "votes": "2",
      "replies": []
    },
    {
      "text": "This is onle phase one after the fall of hasina. Things don't magically fall from sky like Hindi movies. Everyone needs to come forward and play the roll.",
      "votes": "0",
      "replies": [
        {
          "text": "How do you expect everyone to come forward and play the role by their own? There has to be strong leaderships for that. The government could also play crucial role.",
          "votes": "11",
          "replies": []
        }
      ]
    },
    {
      "text": "I mean, half the problems are being caused by secret BAL members. You really think all the arsons, misinformation and religious provocations are coincidences?",
      "votes": "0",
      "replies": [
        {
          "text": "Religious provocation? Mullahs will do mullah things if given the leniency.",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-4",
      "replies": [
        {
          "text": "BAL government was not weaker. Their flaws were different.",
          "votes": "12",
          "replies": [
            {
              "text": "",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 194
}