{
  "url": "https://www.reddit.com/r/bangladesh/comments/1o8tks3/%E0%A6%86%E0%A6%87%E0%A6%A8_%E0%A6%AD%E0%A6%A4%E0%A6%A4_%E0%A6%A8%E0%A6%87_%E0%A6%AC%E0%A6%B2_%E0%A6%9C%E0%A6%B2%E0%A6%87_%E0%A6%B8%E0%A6%A8%E0%A6%A6_%E0%A6%B8%E0%A6%AC%E0%A6%95%E0%A6%B7%E0%A6%B0_%E0%A6%85%E0%A6%A8%E0%A6%B7%E0%A6%A0%E0%A6%A8_%E0%A6%85%E0%A6%B6_%E0%A6%A8%E0%A6%AC_%E0%A6%A8_%E0%A6%8F%E0%A6%A8%E0%A6%B8%E0%A6%AA/",
  "hash": "34d739b2429dd6ee08bb1306cc4f6ed5",
  "scraped_at": "2025-12-08T17:51:09.429560",
  "title": "'আইনি ভিত্তি নেই' বলে জুলাই সনদ স্বাক্ষর অনুষ্ঠানে অংশ নেবে না এনসিপি",
  "description": null,
  "votes": "21",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "নাটক সিনেমা সব",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Eigula chay July sodon hobey constitution thekeyo powerful.\nAlia Riaz is a cancer.",
      "votes": "15",
      "replies": [
        {
          "text": "Dr. Ali Riaz proposed reforms that would have finally established necessary checks and balances, making it very challenging for any party to amend the constitution and adopt an authoritarian stance like Hasina. However, your preferred party, the BNP, chose to oppose every one of those proposals except the term limit one. The NCP deserves criticism for drama, but that man does not. He has shortcomings, but he is not \"cancer.\" I would argue that we are very lucky to have someone like him in the consensus commission.",
          "votes": "7",
          "replies": [
            {
              "text": "আমেরিকা লাকী আলী রিয়াজকে পেয়েছে বলে বাংলাদেশীরা না!",
              "votes": "4",
              "replies": []
            },
            {
              "text": "So called checks and balances, proposed by riaz and bodu, will make weak govs, like pakistans, which can be easily toppled. Any foreign power can manipulate the situation. The way imran khan was toppeled eikhaneyo hobey. There is a reason Atlanata council fellow like riaz was chosen for this task.\nChecks and balances shuntey bhalo lagey.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Juloi shonod desh k kon sodoner upore rakbe sheta porishkar",
      "votes": "5",
      "replies": []
    },
    {
      "text": "July Chodon খাওয়ার টাইম হইছে ওগো",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Reforms were futile anyway because no potential ruling party in Bangladesh is interested in establishing proper checks and balances like other advanced democracies. All they want is absolute power.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "0",
      "replies": []
    },
    {
      "text": "বেজন্মা এনসিপির রাজনীতি খালি ঢাকা বিশ্ববিদ্যালয় কেন্দ্রিক।",
      "votes": "-4",
      "replies": [
        {
          "text": "আর তোরা সেখানেও নাই হাহা",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 199
}