{
  "url": "https://www.reddit.com/r/bangladesh/comments/1o85c9d/signing_without_consensus_how_the_july_charter/",
  "hash": "bc7444e94cf329a513157f83d7e06ecd",
  "scraped_at": "2025-12-08T17:51:27.777098",
  "title": "Signing without consensus: How the July Charter could deepen division",
  "description": "\"The major problem, of course, lies with those proposals where parties have clear disagreements or have submitted \"notes of dissent.\" There are seven proposals that have met with outright opposition from more than five parties. One of them—removing the March 7 Speech from the Constitution—has been opposed outright by nine parties. Seven parties have objected to the proposal to establish three separate commissions.\nThe largest party, BNP, has objected to fifteen proposals. Among these, nine proposals are also opposed by the NDM, the 12-Party Alliance, and the Nationalist Like-Minded Alliance. Only four parties have raised no objections at all: the Islami Oikya Jote, NCP, Gono Sanghati, and Bangladesh State Reform Movement. On the other hand, the parties with the highest number of objections are BASAD (16 proposals), BNP (15), and the 12-Party Alliance (13).\nHowever, the real fault line lies in the proposals that have drawn \"notes of dissent.\" These include issues such as the powers of the President (objected to by nine parties), the method of forming a caretaker government (seven parties), allocation of seats in the Upper House based on voting ratios (seven parties), and the procedure for appointing constitutional officers such as the Ombudsman, Auditor General, and Public Service Commissioners (also seven parties). Interestingly, on almost every issue where the BNP has lodged a note of dissent, the NDM, 12-Party Alliance, and Nationalist Like-Minded Alliance have aligned with them in opposition.\nThe problem with these direct objections and notes of dissent is that if any of these proposals are implemented unilaterally, the political climate of the country will become inflamed, and doubts will arise about the next election. Nearly all political analysts believe that if the election is delayed, Bangladesh will head towards instability.",
  "votes": "5",
  "comments": [],
  "id": 200
}