{
  "url": "https://www.reddit.com/r/bangladesh/comments/1o5k7zv/voters_satisfaction_with_local_political/",
  "hash": "e0d61c8b490a2386597b84bc9e31f125",
  "scraped_at": "2025-12-08T17:55:13.835048",
  "title": "Voters' satisfaction with local political activities: Jamaat 30.4%, NCP 23.7%, BNP 21%, survey finds",
  "description": null,
  "votes": "52",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "এ কথা সত্য যে তারা ভোট পাবার জন্য যা দরকার তা করতেছে। এবং তাদের মধ্যে মেরিটোক্রেসির চর্চা আছে। বি এন পি এখন নিজের পাওয়া ভোটের গো* য়া মারলে কি করার আছে পাবলিক ওদের থেকে বাচার জন্য জামাতরে ভোট দিবে।",
      "votes": "14",
      "replies": []
    },
    {
      "text": "At this point, its just inevitable!",
      "votes": "37",
      "replies": [
        {
          "text": "Astagfirullah Astagfirullah Astagfirullah 😭😭😭😭😭😭😭",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "Something tells me BNP might do a tag team with their mortal enemy if Jamat/NCP gang forms a government",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Wait another poll was saying BNP is first Which one to believe?",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Now it’s just a matter of waiting to see what happens in the end.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "I know there is something wrong with this list not because jamaat is at top, that is believable but because no way in hell even 20% is satisfied with NCP\nEdit: I can't find the link to the actual survey I saw on thier website that they published it , but is it broken or something? I am finding the older ones\nhttps://innovision-bd.com/wp-content/uploads/2025/03/250313_Innovision-National-Poll__English_Official.pdf\nWas 6 months enough time to change peoples opinion so much?\nEdit 2: https://innovision-bd.com/wp-content/uploads/2025/03/250313_Innovision-National-Poll__English_Official.pdf\nFound the new one. ALSO\nAmong those who revealed their voting intentions, support for the Awami League has risen significantly to 18.8% (from 14.0%), while support for the BNP (41.3%) and Jamaat-e-Islami (30.3%) has remained relatively stable. Voting support for NCP (4.10%) and Islami Andolon (3.10%) also rises. However, the Awami League does not participate; in that case, the BNP (45.6%) and Jamaat-e-Islami (33.5%) are seen as the primary beneficiaries, and a notable portion of voters (8.3%) would choose not to vote. Voting intentions also vary by demographics: BNP support increases with age and decreases with education, while support for Jamaat-e-Islami and NCP is strongest among younger, more educated individuals. The BNP (39.1%) is widely considered the most suitable party to form the next government, followed by Jamat-e-Islami (28.1%). Additionally, 40% believe BNP has the best chance of creating the next government (up from 29.3% in Round 1).\napparently satisfaction is not the same as support.\nHowever, when analyzing only on revealed group, support for the BNP has remained relatively stable (41.7% in Round 1 vs. 41.3% in Round 2). Jamaat-e-Islami's share slightly decreased (31.6% in Round 1 vs. 30.3% in Round 2). The most notable shift is the increase in support for the Awami League (18.8% in Round 2, up from 14.0% in Round1).\nalso 6 months don't seem to be enough to drastically change opinion that much.\nBut ultimately I wonder why did the news report on the satisfaction only but not the support?",
      "votes": "3",
      "replies": []
    },
    {
      "text": "What? BNP is below NCP? No fkin way!",
      "votes": "3",
      "replies": []
    },
    {
      "text": "NCP = Jamaat team B",
      "votes": "10",
      "replies": []
    },
    {
      "text": "https://www.tbsnews.net/bangladesh/304-voters-satisfied-political-activities-jamaat-21-bnps-survey-1259551",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Chud gaye guru",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "3",
      "replies": []
    },
    {
      "text": "On the other hand, dissatisfaction was found to be highest in BNP, as 27.6% said they were dissatisfied with the party's local political activities, compared to 19.7% for Jamaat and 17% for NCP.\nPeople are not happy with excessive extortion, and other illegal activities in their area, but that doesn't matter. The BNP will still win more than 90% of the seats in the national election. Believe it!",
      "votes": "-2",
      "replies": [
        {
          "text": "This isn't the 90s anymore. Jamat will win .\nযদি কোনভাবে বিএনপি জিতে , তাহলে ১ বছরের মধ্যেই হেফাজত জামাত নাপার জঙ্গিগুলা একসাথে তারেকের **** ধরে ক্ষমতা থেকে টেনে নামাবে।",
          "votes": "5",
          "replies": [
            {
              "text": "",
              "votes": "-5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "-11",
      "replies": [
        {
          "text": "Yeah because they are such saints bro. They can't do anything wrong. No wrong doings at all...",
          "votes": "8",
          "replies": [
            {
              "text": "Except for that one super tiny oopsie mistake in 1971",
              "votes": "4",
              "replies": []
            }
          ]
        },
        {
          "text": "",
          "votes": "6",
          "replies": [
            {
              "text": "extortion of BAL leaders\nIf they are not extorting the general public, they have my vote again",
              "votes": "-3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Sorry, stopping Awami league from participating elections is not going to be good for Bangladesh.",
      "votes": "-4",
      "replies": [
        {
          "text": "There isn't going to be a Bangladesh, if Awami League is to exist.\nYeah, this is true! Hasina threatened the military that she would request Indian intervention or they have to shoot her dead, but she wouldn't leave power.\nThere is no scenario in which, we don't fight to our deaths before that flag of red, painted in blood, circled by the green of eternal youth and life is lowered!\nAwami League was killed in Bangladesh and buried in India. That is the end for good!\nনৌকা ডুবে গেছে",
          "votes": "1",
          "replies": [
            {
              "text": "And is Jamaat is any better? I doubt it.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "সাধু সাধু",
      "votes": "1",
      "replies": [
        {
          "text": "সাধু সাধু",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 213
}