{
  "url": "https://www.reddit.com/r/bangladesh/comments/1o4lbaa/well_well_well/",
  "hash": "e7e4f849f9f911a9fa7aa3014a4c6242",
  "scraped_at": "2025-12-08T17:56:06.276025",
  "title": "well well well 🤡",
  "description": "Akta Jamaate type fb group er post",
  "votes": "136",
  "comments": [
    {
      "text": "By the way, Reddit isn't Facebook. You can't spread hate, you need to be productive regardless of anything.",
      "votes": "69",
      "replies": [
        {
          "text": "imagine if facebook had a karma system",
          "votes": "27",
          "replies": []
        },
        {
          "text": "While reddit as a platform is slightly better than FB, it's still shit",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Era Reddit theke gaali kheye pore Facebook e giye kaade",
      "votes": "92",
      "replies": [
        {
          "text": "Ban kheye",
          "votes": "17",
          "replies": [
            {
              "text": "For real. And I am so glad it's that way.",
              "votes": "8",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Ask them about consent and child marriages, you would find out what kind of people they are",
      "votes": "83",
      "replies": []
    },
    {
      "text": "Engagement of my last post. You all can see what's the reality. Yea, Indian people can be here.Yes any post can get viewed by indians too. They could be majority viewers too. Infect people from any country can join any sub. But assuming that indians controlling it or capturing it is next level dilution. We are also Bangladeshi but not like those toxic people of fb. That's it. Main point is their bots cannot work here, cannot control this sub that's why they are pissed off. Simple.",
      "votes": "43",
      "replies": []
    },
    {
      "text": "How do they even think their argument works? Give one stats of one post, and a picture of one user that doesn't post in either dhaka or Bangladesh subreddit anymore cause they get downvoted every time( currently the most frequent r/SecularBangla poster unsurprisingly).\nDude is writing about forced narrative while making their own narrative.Also since I know OOP from Facebook definitely gonna read this comment. You are genuinely cringe buddy.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Stats from one of my recent posts.\nসামুবিডির আধুনিক সংস্করণ, মন্তব্যটা ভালো লাগছে। ইতিবাচকভাবে নিলাম 💪",
      "votes": "8",
      "replies": []
    },
    {
      "text": "",
      "votes": "15",
      "replies": []
    },
    {
      "text": "I don't understand why these people are so obsessed with Reddit. For once, it feels good that we are finally becoming visible in Bangladeshi social media discourse; on the other hand, these people are all fools with their conspiratorial brains.\nI see people on this sub constantly dunking on BAL, and they are not banned for any of that. Yes, there are a lot of Indians in our sub, but no, you are not being brainwashed by Indians, stupid Facebookers!\nEdit: Removed the profanities, so automod doesn't remove my comments.",
      "votes": "60",
      "replies": []
    },
    {
      "text": "Reddit is one of the few places where you can freely share your thoughts and truly be yourself. The environment is mostly free from cheap bots, since it’s relatively harder for them to operate here.",
      "votes": "42",
      "replies": [
        {
          "text": "Plenty of indian bots here, they are cheap",
          "votes": "33",
          "replies": [
            {
              "text": "True",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "bhai hudai facebook er jinish reddit e aisha share koriyen na, chod kheye moruk ora idgf",
      "votes": "6",
      "replies": []
    },
    {
      "text": "this is the stat of one of my posts in this subreddit, it’s nowhere close to OP’s screenshot.",
      "votes": "15",
      "replies": []
    },
    {
      "text": "Bruh I prefer reddit than facebook. Atleast sob jaigai tader moto hate speech dicchi bah dichen nah. And ask them about content and child marriage rules. They will be like \"Consent ki jinish? Atoh english chodai nah. Child marriage rules ase Bangladesh a? Jantam nah. Mone korsi bidesh a hoi rules\"",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Am adding insight of my posts you people can see and decide. 🃏",
      "votes": "10",
      "replies": [
        {
          "text": "",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "Wow, a post about Indian viewership and the comments are sane and rational? And not one accusation of mods being indian? I don't believe my eyes!",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Reddit e to pare na tai gese fb te kannte😂",
      "votes": "3",
      "replies": []
    },
    {
      "text": "btw that group is maintain by Shibir",
      "votes": "3",
      "replies": []
    },
    {
      "text": "",
      "votes": "3",
      "replies": []
    },
    {
      "text": "এই ছাগু গুলো বুঝে না একটা জিনিস, ইন্ডিয়ানরা এখানে এসে বাংলাদেশী সেজে বাংলাদেশের বিপক্ষে বললেও বাংলাদেশীরা গলায় গলা মেলাবে না। আওয়ামী লীগরা আওয়ামীর পক্ষেই বলবে। কমিউনিস্টরা নিজেদের পক্ষেই কথা বলবে। নির্দলীয় মুক্তিযুদ্ধের সমর্থক মুক্তিযুদ্ধের সমর্থন করে যাবে। জামাতি রা নিয়ে বিনিয়ে মুক্তিযুদ্ধের বিপক্ষেই বলবে। পাকিস্তানে জয়গান গাইবে। ইন্ডিয়ানরা এখানে কিছুই চেঞ্জ করতে পারবে না।\nকিন্তু রেডিটে কি কি সম্ভব না সেটা বলি।\n১) জঙ্গিপনা ছড়ানো। পোস্ট দিয়ে একাউন্ট ও পোস্টটি টিকিয়ে রাখা। ২) রেস্টিস্ট গালি ও পোস্ট দিয়ে একাউন্ট ও পোস্টটি টিকিয়ে রাখা। ৩) পেডোফিলিয়া ছড়ানো । পোস্ট দিয়ে একাউন্ট ও পোস্টটি টিকিয়ে রাখা। ৪) মিসিজিনস্টিক প্রোপাগান্ডা ছড়ানো।পোস্ট দিয়ে একাউন্ট ও পোস্টটি টিকিয়ে রাখা।\nএগুলা ছড়ানোর চেষ্টা করে অনেকে । এদের পোস্ট ও কমেন্টগুলো যদি এক সপ্তাহ এখানে ছড়াতে চায়, এগুলা কি আমাদের মনকে চেঞ্জ করে দিবে ? তাদের সংখ্যাধিক্য দেখিয়ে আমাদের কি তাদের মত করতে পারবে? না।",
      "votes": "5",
      "replies": []
    },
    {
      "text": "India has 10x more population than Bangladesh does and significantly higher Reddit users. Reddit also promotes posts from similar communities to each other. It kinda makes more sense to have higher Indian views.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Your average chagu mumin won't last 5 seconds on Reddit . They'll go to some porn sub , say something mental and get banned immediately 😄😄",
      "votes": "3",
      "replies": []
    },
    {
      "text": "বাংলাদেশের অনেক নেটওয়ার্কেই VPN ছাড়া রেডিট ব্যবহার করা যায় না। একারণে অনেকের লোকেশন সিঙ্গাপুর/আমেরিকা/ইউরোপ দেখায়, যদিও তারা বাংলাদেশে আছে। বাংলাদেশের প্রকৃত পার্সেন্টেজ আরও বেশি হবে।",
      "votes": "4",
      "replies": [
        {
          "text": "VPN e Indian server o ase",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "3",
      "replies": []
    },
    {
      "text": "They are goddam, right?",
      "votes": "2",
      "replies": []
    },
    {
      "text": "I don't care watch thia instead: https://www.instagram.com/reel/DPeVs7HDG_A/?igsh=bWxoa3FzaHAzcXdx",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Any mention of bad-mouthing of Reddit In FB is almost deemed to backfire",
      "votes": "2",
      "replies": []
    },
    {
      "text": "ধোন বলেছেন",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Is this wrong? What’s your post engagement stat saying?",
      "votes": "2",
      "replies": []
    }
  ],
  "id": 216
}