{
  "url": "https://www.reddit.com/r/bangladesh/comments/1o3s7ur/%E0%A6%9C%E0%A6%B2%E0%A6%87_%E0%A6%AC%E0%A6%AF%E0%A6%AC%E0%A6%B8_%E0%A6%AC%E0%A6%A8%E0%A6%A7_%E0%A6%95%E0%A6%B0/",
  "hash": "34ff9361baa24a9264d7b6cd1875fc0c",
  "scraped_at": "2025-12-08T17:57:15.643986",
  "title": "জুলাই ব্যাবসা বন্ধ করো।",
  "description": "জুলাই ব্যাবসা বন্ধ করো।\nলাশ ব্যাবসা বন্ধ করো।\nআহতের নামে চক্ষু হাসপাতাল দখল করা বন্ধ করো।\nউচিত কথা বললে দিল্লি, ভারত, শাহবাগী বন্ধ করো।\nমুজিববাদ মুর্দাবাদ ফেনফেন বন্ধ করো।\nআওয়ামী লীগ-ফ্যাসিবাদ কুত্তার মত ঘেন ঘেন বন্ধ করো।\nমাজার হামলা বন্ধ করো।\nরাস্তায় রাস্তায় মোল্লাগিরি বন্ধ করো।\nবাংলাদেশকে গড়ে তুলো।",
  "votes": "15",
  "comments": [
    {
      "text": "To be honest,,,আমার যদি এনাফ পরিমান টাকা থাকে,,আমি আমার ফ্যামিলি নিয়ে মিডল ইস্ট হোক ইউরোপ হোক,সেটেল হবো,,,,this country is sucks,,,যে দেশে রুলস এন্ড রেগুলেশন এর কোন আত্তাপাত্তা নাই,,সে দেশে এগুলা স্বাভাবিক,,সামান্য একজন মোবাইল দোকনাদাএ আপনাকে মিথ্যা বলে মোবাইল বিক্রি করবে, কারন সে যানে ধরা খেলে আপনি কছু করতে পারবেননা,,,সামান্য একজন রিক্সাওয়ালা এসে আপনার দামি গাড়ির বারোটা বাজাবে,কারন সে জানে সে রাস্তায় বসে কাঁদলে পাব্লিক আপনাকে গালি দিবে উলটা,,,সরকারী কোন কাজ আপনি টাকা ঘুষ ছাড়া আদায় করতে পারবেননা কারন কর্মকর্তা জানে আপনি তাকে ছাড়া কাজ সম্ভব না,,ডক্টর ইউনুস এই জিনিসগুলা নিয়ে কোন পদক্ষেপ নিতে পেরেছে কি?",
      "votes": "3",
      "replies": []
    },
    {
      "text": "সহমত। গত ৫০ বছর যারা ৭১ নিয়ে বিজনেস করল, তাদের বিষয়েও একি রকম লেখা চাই।",
      "votes": "13",
      "replies": []
    },
    {
      "text": "১৯৭১ এর চেতনা ব্যবসা নিয়ে আপনার অভিমত জানতে চাই।",
      "votes": "3",
      "replies": []
    },
    {
      "text": "ঝুলাই সায়দাবাদীদের আমার post history দেখার বিনিত অনুরোধ রইল।\n#ইনকিলাব সায়দাবাদ\n#ঝুলাই সকিদ ঝিন্দালাশ।",
      "votes": "-4",
      "replies": [
        {
          "text": "More like\nফায়দাবাদী",
          "votes": "3",
          "replies": []
        },
        {
          "text": "যাদের গাত্রদাহ কেনো শকিদের রক্ত শুকানোর আগেই এসব বলছি...\nশহিদদের রক্ত কখনই শুকায় না। শুকিয়ে যায় মানুষের ধৈর্য। আপনারা যেই পথ বেছে নিয়েছেন আওয়ামী লীগের চেয়ে কম নয়। আওয়ামী লীগও রাজাকারদের সাথে হাত মিলিয়েছে আপনাদের ইনকিলাবওয়ালারাও গোপনে লীগার ঢুকাচ্ছে। আওয়ামী লীগও বঙ্গবন্ধু নিয়ে নেচেছে আপনারা আজকে নাচছেন খালেদাকে নিয়ে। এদিকে দেশে শান্তি নেই। কথায় কথায় শুনতে হয় এই বুঝি ক্যু হয়ে গেল। বাটপারি একদিন জনগন খাবেনা। যেদিন গণধোলাই খাবেন সেদিন নরমাল মানুষ সাইডে দাড়িয়ে থাকবে, মুজিবের মূর্তি ভাঙ্গার সময়ও দাড়িয়ে ছিল",
          "votes": "-2",
          "replies": []
        }
      ]
    },
    {
      "text": "Eita e to ei desher politics. BAL e 71 er chetona bechse, BNP ziar chatena bechse, NCP/Jamat july bechbe.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 220
}