{
  "url": "https://www.reddit.com/r/bangladesh/comments/1o3s5wd/%E0%A6%86%E0%A6%AB%E0%A6%97%E0%A6%A8_%E0%A6%AA%E0%A6%B0%E0%A6%B0%E0%A6%B7%E0%A6%9F%E0%A6%B0%E0%A6%AE%E0%A6%A8%E0%A6%A4%E0%A6%B0%E0%A6%B0_%E0%A6%B8%E0%A6%AC%E0%A6%A6_%E0%A6%B8%E0%A6%AE%E0%A6%AE%E0%A6%B2%E0%A6%A8_%E0%A6%A2%E0%A6%95%E0%A6%A4_%E0%A6%AA%E0%A6%B0%E0%A6%A8%E0%A6%A8_%E0%A6%A8%E0%A6%B0_%E0%A6%B8%E0%A6%AC%E0%A6%A6%E0%A6%95%E0%A6%B0_%E0%A6%A6%E0%A6%B2%E0%A6%B2%E0%A6%A4/",
  "hash": "c053fefcd69c9a2ad687e4e480ab1d89",
  "scraped_at": "2025-12-08T17:57:32.528814",
  "title": "আফগান পররাষ্ট্রমন্ত্রীর সংবাদ সম্মেলনে ঢুকতে পারেননি নারী সংবাদিকেরা, দিল্লিতে বিতর্ক",
  "description": "আরেক সাংবাদিক স্মিতা শর্মা বিস্ময় প্রকাশ করে এক্সে লেখেন, \"মুত্তাকির সংবাদ সম্মেলনে কোনো নারী সাংবাদিককে আমন্ত্রণ জানানো হলো না। তালেবান জমানায় আফগান নারীদের দুর্দশার বিরুদ্ধে জয়শঙ্করের ভাষণ বা যৌথ বিবৃতিতে একটি শব্দও নেই। অথচ এ দেশে মুত্তাকিকে লালগালিচা বিছিয়ে স্বাগত জানানো হচ্ছে, যেখানে নারীদের সাফল্যে গর্ব বোধ করা হয়। এটাই আজকের রাজনীতি।\"",
  "votes": "11",
  "comments": [
    {
      "text": "Dari tupi wala must be feeling proud.",
      "votes": "11",
      "replies": []
    },
    {
      "text": "সিলেবাস এ ছিল না তো এটা।",
      "votes": "5",
      "replies": []
    },
    {
      "text": "ভারত দেখি আফগানিস্তান হয়ে গেল 😂",
      "votes": "4",
      "replies": [
        {
          "text": "Tahole to bharot keo baap dakbey ekhon touhidi jonota",
          "votes": "11",
          "replies": [
            {
              "text": "ভারত যেহেতু বাপ ডাকছে। ডাকতেও পারে।",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "It's not much different. Extremist parties doing identity politics are the same everywhere. They will sell extreme ideals and use that to manipulate their followers, while it is nothing but a ploy to exploit them for absolute power and control.\nSame pattern can be observed with parties like Jamaat. They will attempt to strategically please India on one hand and would also make silly controversial anti-India remarks to address their followers and keep them in check.",
          "votes": "5",
          "replies": []
        },
        {
          "text": "বাংলাদেশকে আফগানিস্তান বলতে বলতে নিজেই আফগানিস্তান হয়ে গেছে দেখি।",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "বিসিএস এর জন্য ইম্পর্ট্যান্ট। নেক্স্ট টাইম আসবে। কনফার্মড।",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Bhai thamen, Bharot ar Bangladesher Baak, Naari o emni swadhinota eke oporer sathe compare kore nijeder lojja diben na. You can downvote me all you want but you know what the actual truth is.",
      "votes": "-1",
      "replies": [
        {
          "text": "Looks like someone got triggered. What is the actual truth? Why don't you enlighten us?\nWhat's the actual stats? Let's take a look at the Women, Peace And Security Index. India ranks at 128 out of 177 countries with a score of 0.595. Bangladesh ranks at 131 out of 177 countries with a score of 0.593.\nHere is the gender inequality index by country 2025. India ranks 0.44, and Bangladesh follows closely with 0.5. You must be feeling so mighty and proud due to that difference. Nice going.\nThis post was not meant as a comparison or an attack but looks like your insecurity and ego got triggered. Things can be much different when you look at real-world data outside of your bubble. I will also just leave this nice report from Amnesty for you here. And this is in no way attempting to undermine the struggles women faces in Bangladesh or anywhere else.",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 221
}