{
  "url": "https://www.reddit.com/r/bangladesh/comments/1o1gzyq/%E0%A6%B8%E0%A6%AE%E0%A6%B0%E0%A6%95_%E0%A6%AE%E0%A6%B9%E0%A7%9C_%E0%A6%A8%E0%A6%95_%E0%A6%85%E0%A6%A8%E0%A6%AF%E0%A6%95%E0%A6%9B/",
  "hash": "16541ecad3cb996c595680c5f4ae65bb",
  "scraped_at": "2025-12-08T18:00:09.512551",
  "title": "সামরিক মহড়া নাকি অন্যকিছু?",
  "description": "বাংলাদেশ কবে এত বড় বিগশট হইল যে আমেরিকা বাংলাদেশের সাথে সামরিক মহড়া দিতে চাইবে?\nসোর্স: https://www.kalerkantho.com/online/national/2025/10/08/1588695",
  "votes": "90628",
  "comments": [
    {
      "text": "",
      "votes": null,
      "replies": []
    },
    {
      "text": "ভাই এরকম অনেক সময় ই আসে, জাস্ট এখন ব্যাপারটা গরম তাই নিউজ করলো আরকি :3",
      "votes": "3",
      "replies": [
        {
          "text": "can confirm. used to live near the place they dock and my school often arranged visits to those ships and i did happen to visit one of them",
          "votes": null,
          "replies": []
        },
        {
          "text": "এর আগেও বাংলাদেশে আসছে এমন নিউজের লিংক থাকলে দিয়েন তো ভাই। ধন্যবাদ।",
          "votes": "3",
          "replies": [
            {
              "text": "https://www.gov.uk/government/news/british-royal-navy-ship-hms-tamar-visits-bangladesh\nhttps://ispr.gov.bd/en/japan-maritime-self-defence-force-ship-bungo-and-takashima-arrives-in-chattogram-port-on-goodwill-visit\nhttps://en.people.cn/n3/2016/0127/c90883-9010370.html\nhttps://www.newagebd.net/post/foreign-affairs/262311/3-russian-warships-arrive-in-ctg-on-goodwill-visit",
              "votes": "3",
              "replies": []
            },
            {
              "text": "The source you provided states that it happened in 2022 as well :\\",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "আরে ভাই, আপনাগো সেন্ট মার্টিন চালু হইতেছে না? ওইটার অন-এরাইভাল ভিসা দিতে আসছে ।",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Just see it as a regular military exercise and knowledge exchange; the US conducts it with most regional partners that align with its vision. Currently, Bangladesh is not in a position to take sides such as the NATO bloc or the China-Russia bloc; we have to make a balance without pissing any of them off.",
      "votes": "5",
      "replies": [
        {
          "text": "একটা ব্লাডি রেভ্যুলেশন এর পরে দেশ যখন সোস্যালি পলিটিক্যালি ইকোনমিক্যালি আনস্টেবল তখন একটা পরাশক্তি সামরিক মহড়া দিতে আসবে এইটাকে এক্টু সন্দেহ লাগেই তার উপর দেশটা যখন আমেরিকা তখন আরো বেশিই ভয় এবং সন্দেহ লাগে।",
          "votes": "5",
          "replies": [
            {
              "text": "Ship visit সামরিক মহড়া না",
              "votes": null,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "cant wait to go to usa sorry saint martins lol",
      "votes": null,
      "replies": []
    },
    {
      "text": "খেলা হবে খেলা শুরু হয়ে গেছে",
      "votes": null,
      "replies": []
    },
    {
      "text": "গত বছরের আগস্টের পর থেকে তো এরা যাওয়া আসার মধ্যেই আছে। ৪-৫ টা মহড়া হয়ে গেছে এক বছরের মধ্যে। এত মহড়া তো NATO member দের সাথেও করে না আমেরিকা।",
      "votes": null,
      "replies": []
    },
    {
      "text": "সোর্স",
      "votes": null,
      "replies": []
    },
    {
      "text": "You've kept the মান সম্মান of your username! Congrats!",
      "votes": null,
      "replies": []
    },
    {
      "text": "Hoo dada, desh beicha ditase, hasina thakle bechto na, yunus kharap",
      "votes": null,
      "replies": [
        {
          "text": "তা ভাই ফ্যাসিস্ট মাগী রেন্ডিয়ার কাছে বেচতেছিলো তাই হারাম আর থ্রি জিরো নোবেল সুদী আমেরিকার কাছে বেচতেছে তাই আরাম? সবাই যদি বেচেই তাইলে আমি চাই পায়ুযোদ্ধা gamat আসুক পাকিস্তানের কাছে বেচুক! এটলিস্ট সুন্দরী পাকিস্তানি মেয়েগো তো পামু!",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "সন্দেহের চোখে দেখতে চাইলে অনেক কিছুই দেখা যায়। তবে যেটা সন্দেহ করছেন সেটার পিছনে যৌক্তিক কারণ না থাকলে অহেতুক অন্য মানে না খোঁজাই ভালো। এটা সামরিক মহড়া না, এই পোস্টে বাকিরাও বলেছে যে এমন সফর আগেও হয়েছে।\nআর যুক্তরাষ্ট্র গোপনে কিছু করতে চাইলে এভাবে ঢাকঢোল পিটিয়ে কেন করবে? যুক্তরাষ্ট্র খুব ভালো সেটা বলছি না। যুক্তরাষ্ট্র তার স্বার্থ উদ্ধারের জন্য কূটনীতি ও নোংরামি করছে সব দেশের সাথেই কম বেশি আর করবেও ভবিষ্যতে। তার সাথে এসব ঘটনা মেলানোর দরকার নেই কারণ ছাড়া।",
      "votes": null,
      "replies": [
        {
          "text": "কারণ হইল আগের ফ্যাসিস্ট মাগি বলত ইউএস আসবে বাংলাদেশ ফাঁসবে! তখন এইগুলারে পাগলের প্রলাপ লাগত! মনে হইত রাস্তায় একটা টায়ার বাস্ট হইলেও ওই বেটি সেইখানে যেমন জাশি রাজাকার খুইজ্জা পায় এইখানেও তাই। ক্ষমতা ধইরা রাখতেই এইসব কথা এখন সে যাওয়ার পরে তার কথা কিছু জায়গায় মিল পাইলেই ডর লাগে। ঝড়ে বক মরে ফকিরের কেরামতি বাড়ে জানি প্রবাবলি ফ্যাসিস্ট মাগীর প্রেডিকশন এর সাথে মিল গুলা কাকতালীয় কিন্তু একদম নিতান্তই সাধারণ মানুষ হিসাবে ভয় আর কনসার্ন থেকে জিগ্যেস আর কি।",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "1",
      "replies": [
        {
          "text": "ইন্টেলেকচুয়াল সাইটে আসছিই এইজন্য! ফেসবুকে নিজের বাবলে নিজের মতবাদের প্রিচিং শুনতে শুনতে কান শেষ তাই দেখি বাকিরা কি বলে!",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "ভালো কিছুও হতে পারে!",
      "votes": null,
      "replies": []
    },
    {
      "text": "Nothing new, they pay visits all the time. There's training exercises that are done with them going back years.",
      "votes": null,
      "replies": []
    },
    {
      "text": "তাও যদি আচোদা সাইকো মোসলমানের দেশটা ইনভেড কইরা কিছু সভ্যতা আনতে পারতো!!",
      "votes": null,
      "replies": []
    },
    {
      "text": "Are liberal bangu vodai, usa jokhon toder pisone lagabe tokhono tora bolbi erokom to ageo lagato.",
      "votes": null,
      "replies": []
    },
    {
      "text": "মহরা",
      "votes": null,
      "replies": []
    },
    {
      "text": "নুনুস বেঁচে দিচ্ছে ভাই :'(",
      "votes": null,
      "replies": []
    }
  ],
  "id": 230
}