{
  "url": "https://www.reddit.com/r/bangladesh/comments/1o1aaoq/bangladesh_must_focus_on_selfreliance_move_away/",
  "hash": "741849ffa15fd85af11f6b74263e427e",
  "scraped_at": "2025-12-08T18:00:29.617716",
  "title": "Bangladesh must focus on self-reliance, move away from dependence: CA Yunus",
  "description": null,
  "votes": "68",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "All talk and no action.",
      "votes": "40",
      "replies": [
        {
          "text": "He will soon make Bangladesh less reliant on electricity imports by signing PPAs with new solar power plants. He is also planning to build an oil refinery in Bangladesh to make us less dependent on imported oil products. Moreover, his government before leaving will issue a tender for offshore gas exploration.\nI think he is also making preparations so that Bangladesh does not rely on Indian ports for exports.",
          "votes": "13",
          "replies": [
            {
              "text": "Once they happen we can say. This gov has a tendency of stealing valor. And we aaw what they did with the pink busses",
              "votes": "3",
              "replies": []
            },
            {
              "text": "If this is fr, alhamdulillah 🙏\nSomething should be done about the Boropukuria coal mine as well. Heard the exposed coal sitting ducks there are degrading away while being exposed to the elements.",
              "votes": "4",
              "replies": []
            },
            {
              "text": "Shhhh, doing state facts. People here doing like it sometimes.",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "আরে থ্রি জিরোস দেখাতে হবে না?",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "\"Bangladesh must rise to the top and become a global super power,\"\nI said while planning to do nothing tomorrow.",
      "votes": "20",
      "replies": []
    },
    {
      "text": "We can behead very well. I think he should invest in this sector",
      "votes": "10",
      "replies": []
    },
    {
      "text": "And how so?",
      "votes": "13",
      "replies": [
        {
          "text": "",
          "votes": "-5",
          "replies": [
            {
              "text": "Only quantity, no quality. People are more focused on 4 wives than focusing on education, discipline, utilizing religion to educate moral values.",
              "votes": "4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Over a year and still no improvements to the public safety and mob.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Bangladesh must win world cup in 2026",
      "votes": "4",
      "replies": []
    },
    {
      "text": "After this speech Bangladesh became so developed that Donald Drum resigned and made সুদী ইউনূস the President of USB (united states of Bangladesh)",
      "votes": "13",
      "replies": []
    },
    {
      "text": "Is that why he's giving up Chittagong port management to a foreign company? To become self reliant?",
      "votes": "10",
      "replies": []
    },
    {
      "text": "https://www.tbsnews.net/bangladesh/bangladesh-must-no-longer-be-dependent-become-self-reliant-ca-yunus-1255776",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Chief Advisor ❌\nMotivational Speaker ✅",
      "votes": "4",
      "replies": []
    },
    {
      "text": "ভাগ্যিস চাপা বাইড়ানোতে নোবেল নাই তাইলে ষাড়ের নোবেল ২টা হইত!",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Chief Advisor ❌\nMotivational Speaker ✅",
      "votes": "3",
      "replies": []
    },
    {
      "text": "You know it would be very good if you actually did the stuff that you said like moving away from our \"friendly\" neighbor india",
      "votes": "2",
      "replies": []
    },
    {
      "text": "What he did last one year exactly?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "This is an idiotic statement from a 'world class' economist, there is no country on earth that is self reliant, even China. The only country that were self reliant in modern age was communist Albania under Enver Hoxha & it was not a good experience for Albanians.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "\"Our own capabilities are the true strength of the nation 💪\"",
      "votes": "-1",
      "replies": []
    },
    {
      "text": null,
      "votes": null,
      "replies": []
    }
  ],
  "id": 231
}