{
  "url": "https://www.reddit.com/r/bangladesh/comments/1o0lchb/bangladesh_is_a_failed_state/",
  "hash": "26d0652defd3f68de36c993c9ba58968",
  "scraped_at": "2025-12-08T18:01:07.448070",
  "title": "Bangladesh is a failed state",
  "description": "We need Xi Jinping",
  "votes": "11",
  "comments": [
    {
      "text": "We need Lee Kwan Yew",
      "votes": "30",
      "replies": [
        {
          "text": "We don’t actually need anyone else. We just need to design our systems and rules in a way that empowers individuals to build things.... businesses, ideas, progress... and gives them real autonomy.\nPower has to be decentralized so no single corrupt person can control the entire economy. Of course, that still requires structure and rules.\nBut the way things look right now, I don’t see much improvement happening anytime soon. There’s a massive gap between the educated and the uneducated. Around 80% of the population can’t even grasp the basic idea of development, modernization, or education.\nOnly a small fraction of Gen Z seems to care.... maybe 1% of the whole country (Now in that bucket 90% Gen Z's are scrolling on Tiktok, and making cringe videos). The rest don’t understand what voting actually means. They see it as getting 500 taka for short-term gain, not realizing it decides the country’s future.\nSo honestly, I don’t have much optimism left. The best move might be to get rich, leave, and then come back later...... when you have enough power to actually change the system yourself.",
          "votes": "6",
          "replies": []
        },
        {
          "text": "Agree",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "tried to write something against it, but my xiaomi device started overheating out of nowhere. whats happening gu",
      "votes": "65",
      "replies": [
        {
          "text": "The phone got cold sweats when he heard the Supreme Leader's name.",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "Without a cultural revolution, BD will be a second Pakistan",
      "votes": "12",
      "replies": []
    },
    {
      "text": "we need mao zedong",
      "votes": "11",
      "replies": [
        {
          "text": "Wait, do you mean Deng Xiaoping? Because Mao Zedong is not really what we need. 😭😭",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "I visited after 20 years, went to visit village home in bisnath area. They only just started to fix rd in December. And dont get me started on the dirty sewers full of mosquitos in city",
      "votes": "9",
      "replies": []
    },
    {
      "text": "We better be careful what we wish for",
      "votes": "17",
      "replies": [
        {
          "text": "I’m careful and I’m in a great state of consciousness.\nI repeat — we need Xi Jinping or Lee Kwan Yew",
          "votes": "7",
          "replies": [
            {
              "text": "No! u get obaidul kader 🥀",
              "votes": "7",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Need a strict but non greedy “evil” dictator rn",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Some of you need to visit other parts of the country fr fam. I would say we are alive and well, thriving even in some sectors. Alas! Y'all can't ever be positive about your country. I love my country and given enough time, it will flourish once again. Again this is just my opinion. Both yours and mine are equally logical and illogical. So, if you are a citizen of this country, maybe work to fix it instead of waiting for a new leader. Why don't you start small and make your way up? Become the next big political figure who isn't all about corruption and greed but rather for the development of bd? If you are from abroad, Then kindly feel free to share your opinions cuz free speech exists here ( as long as it's not political or religious ;😜) Best Regards, Sorry-Dress",
      "votes": "5",
      "replies": [
        {
          "text": "And one more thing I wanted to add. (Not a personal attack but) Time doesn't flourish a country. It's the system that does. And I don't see any people that are on the top who will put the systems in place.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "She was not strict enough, she was corrupted and involved students into politics. This country can be saved by Xi Jinping only",
      "votes": "7",
      "replies": [
        {
          "text": "She was not strict enough, she was corrupted and involved students into politics. This country can be saved by Xi Jinping only",
          "votes": "20",
          "replies": [
            {
              "text": null,
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "3",
      "replies": [
        {
          "text": null,
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "The left will freak out if English is made the official medium of instruction in schools. The right will freak out if a military base is given to USA. So no Lee Kuan Yew.\nHalf of the left will rot in jail if we have a strong authoritarian government life China. Half of the right will start Jihad of the state and Islam is throughly separated. So no Xi Jinping for BD.",
      "votes": "1",
      "replies": [
        {
          "text": "Wdym? The right (Jamaat and co.) will bend over and give a base to US as long as it lets them stick it to India. The left (Inu Menon gang) have been the ones repeating the “base in St Martin’s” rumor so much that it’s about to manifest into reality 🤫",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "We need to dramatically depopulate Bangladesh for the coming decades. Even one child policy will fail - people should prove their eligibility to have kids lol This country should not have more than 5 crore people",
      "votes": "1",
      "replies": [
        {
          "text": "We need to dramatically depopulate Bangladesh for the coming decades. Even one child policy will fail - people should prove their eligibility to have kids lol This country should not have more than 5 crore people",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "We need a BDcirclejerk subreddit. Or maybe OkayBD",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Red sun in the sky playing in the background",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Be careful for what you wish for",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "-5",
      "replies": []
    },
    {
      "text": "",
      "votes": "-10",
      "replies": []
    },
    {
      "text": "Yeah, thanks for reminding that",
      "votes": "1",
      "replies": []
    },
    {
      "text": "All emotional mindless zombies hungry for power and possession.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 233
}