{
  "url": "https://www.reddit.com/r/bangladesh/comments/1nzf86k/will_take_part_in_the_election_tarique_rahman/",
  "hash": "8737ee911931610ee0c031ac0bccf71a",
  "scraped_at": "2025-12-08T18:03:21.448019",
  "title": "Will take part in the election, Tarique Rahman tells BBC Bangla",
  "description": "The BNP leader, who has been living in London for nearly 18 years, said as a politician and a worker of a political party, he has always been closely connected with elections.\n\"So, when an expected election for the people takes place, how can I stay away from it?\" he asked.\nTarique, 58, said his absence from Bangladesh was only physical. \"Physically I may be in this country (UK), but in mind and heart, in every way, I have been in Bangladesh for the last 17 years,\" he said.",
  "votes": "8",
  "comments": [
    {
      "text": "Dude will return to Bangladesh once BNP forms a government or its minus 2 💀🤫",
      "votes": "4",
      "replies": []
    },
    {
      "text": "The military has not yet given the green signal.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "what a joke.",
      "votes": "5",
      "replies": [
        {
          "text": "Our Crown Prince is returning to Bangladesh to ascend the throne and fulfill his destiny. Why is this a joke to you? This is the will of the people.",
          "votes": "5",
          "replies": [
            {
              "text": "i think you forgot to add /s",
              "votes": "3",
              "replies": []
            },
            {
              "text": "Based on recent elections would not count Jamaat out.",
              "votes": "1",
              "replies": []
            },
            {
              "text": "\"Is it your own destiny, or is it a destiny someone else has tried to force on you?\" Iroh to Prince Zuko.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Why isnt he returning? He got one more case right",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 240
}