{
  "url": "https://www.reddit.com/r/bangladesh/comments/1nz0tvi/%E0%A6%B8%E0%A6%AE%E0%A6%A8%E0%A6%B0_%E0%A6%A6%E0%A6%A8%E0%A6%B0_%E0%A6%9B%E0%A6%A4%E0%A6%B0_%E0%A6%B0%E0%A6%9C%E0%A6%A8%E0%A6%A4/",
  "hash": "4c6825e2cf880f6c80b090cbd9b581a9",
  "scraped_at": "2025-12-08T18:03:38.223032",
  "title": "সামনের দিনের ছাত্র রাজনীতি",
  "description": "সামনের দিনে আপনাকে রাজনীতি করতে হলে, বিশেষ করে ছাত্ররাজনীতি করতে হলে এনজিও হতে হবে। এনজিও না হতে পারলে রাজনীতির মাঠে টিকে থাকা কঠিন হবে।\nআমাদের জেনারেশনে বিরাজনীতিকরণ হয়ে গেছে অলরেডি। বর্তমানের শিক্ষার্থীরা রাজনীতি বোঝে না, তারা বোঝে সাময়িক সার্ভিস। আপনি কোথা থেকে টাকা এনে এই সার্ভিস দিচ্ছেন সেটা কেউ আপনাকে জিজ্ঞেস করবে না। আপনি এই ইনভেস্টমেন্ট করে কিভাবে রিটার্ন পাবেন তাও জিজ্ঞেস করবে না। আপনি জিজ্ঞেস করলে উল্টো শিক্ষার্থীরাই আপনাকে সন্দেহ করবে।\nছাত্রদল অলরেডি এই ফাঁদে পা দিয়ে দিছে। তারা এখন আর কর্তৃপক্ষের নিকট পানির ফিল্টার চায় না, নিজেরা কিনে দেয়। বাগছাস এই ফাঁদে পা দেয়নি অথবা দিতে পারছে না এখনো।\nভবিষ্যতে স্বাধীন ছাত্রসংগঠনগুলো ধীরে ধীরে ইরেলিভেন্ট হয়ে যাবে। ছাত্র রাজনীতি আরও মাদার পার্টি কেন্দ্রিক হয়ে যাবে। মাদার পার্টিগুলো এই এনজিও কাজ করার জন্য ডোনেশন দিয়ে ছাত্র সংগঠনগুলোর ওপর আরও কর্তৃত্ব স্থাপন করতে পারবে। শিক্ষা প্রতিষ্ঠানে কোন প্রোগ্রাম বা অনুষ্ঠান আয়োজন করা হলে প্রধান অতিথি বা প্রদর্শন করতে দেখা যাবে মাদার পার্টির নেতাদের। সাথে হবে মৃদু মৃদু নির্বাচনী রাজনীতি।\nতাই বলি আপনারা যারা রাজনীতিতে ভালো করতে চান তারা রাজনীতি করা বাদ দিয়ে দিন, এনজিও খুলুন।",
  "votes": "9",
  "comments": [
    {
      "text": "তা বস এই আগে যে বিশাল জনসংযোগ হতো বিশাল তোরণ, বিশাল মঞ্চ, ওগুলো পয়সা আসতো কোত্থেকে বস ?কে জিজ্ঞাসা করতো এগুলো কিভাবে রিটার্ন আসবে। রাজনীতিকবিদরা এবং তাদের সমর্থকরা চাকরি না করে কিভাবে থাকতো বস?\nমানে আমি রাজনীতি বুঝি না তো তাই জিজ্ঞাসা করছিলাম?",
      "votes": "7",
      "replies": [
        {
          "text": "কয়টা সংগঠন বিশাল জনসংযোগ করতো?",
          "votes": "-1",
          "replies": [
            {
              "text": "ইয়ে বস, মানে যে কটাই সংগঠন বিশাল সংযোগ করত তারা কি রাজনীতি করত না এনজিও করত?",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "এরকম হবেনা,তবে আপনার অবজার্ভেশন ভালো। সবার চোখ খুলে গেছে",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 241
}