{
  "url": "https://www.reddit.com/r/bangladesh/comments/1nwa3hy/whom_are_we_voting_in_the_upcoming_elections/",
  "hash": "7451595aa679bb1938c4e165d378e6db",
  "scraped_at": "2025-12-08T18:04:57.017571",
  "title": "Whom are we voting in the upcoming elections?",
  "description": "IMPORTANT: No vote is a complete bs. Voting NoVote means you are just wasting your vote, it doesnt impact the election results in anyway. Even if 80% people vote for NoVote, even then the elections wont be postponed. By voting novote, youre just giving the party you hate the most a chance in winning the election",
  "votes": "7",
  "comments": [
    {
      "text": "There will be competition between these broad factions and possibe alliances:\nCenter: BNP and Allies, like Partha, Ganosamhati maybe Hafazot and etc.\nRight: NCP, GOP, ABP and etc.\nLeft: Communist Party, BASOD, Socialist party, Revolutionary workers party and etc.\nIslamist: Jamat, Nezam, Andolon, Majlish and etc.\nFringe: JaPa, Zaker, JaPa(Monju) and etc.\nIndependent: Record number of independents, rebels and possibly Leaguer candidates preparing to participate.",
      "votes": "6",
      "replies": [
        {
          "text": "I can't ever get over the fact BNP is deciding on allying with Hefazot. People who were deciding on voting them to not let extremist win must be distraught as fuck.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "All i know I'm not voting Gamati A,B,C,D,E,F... Parties",
      "votes": "4",
      "replies": [
        {
          "text": "Jara alphabet niya matamati kore oderi alphabet dol ase 🏗️",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I am not participating any votes.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Let's say BAL and then waste my vote 😆",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 246
}