{
  "url": "https://www.reddit.com/r/bangladesh/comments/1nvaawr/what_caused_the_collapse_of_relationship_between/",
  "hash": "79eb438a87bdc5d78f1d07707ee9334f",
  "scraped_at": "2025-12-08T18:06:04.568899",
  "title": "What caused the collapse of relationship between India and Bangladesh?",
  "description": "I'm curious to know the reasons from the Bangladesh side. I always assumed both countries were in good terms given the cultural similarity with W.Bengal and India's role in Bangladeshi Independence.\nWhat caused the practical collapse of government to government relations in recent years and the overall degradation of people to people interactions (especially the vitriol in social media).",
  "votes": "5",
  "comments": [
    {
      "text": "India built up a puppet and that puppet got carried away and became a dictator. India then decided to double down on their puppet and put all their eggs in one basket instead of having a politically neutral stance to a foreign country which lead people to associate the dictator and their actions with India; ultimately making it look as if the dictators ever increasing narcissistic actions and corruption was at the very least, implicitly supported by India if not explicitly. Thus as the dictator became more oppressive, that oppression was linked to India, and ultimately people don't like being oppressed.\nWhen the dictator was overthrown, India providing a safe haven for the dictator and going into an all out offensive against the revolution ultimately sealed the fate of the relationship. You still see Indians constantly attacking any and all posts by Bangladeshis online, claiming that all Bangladeshis are now islamic extremists, and claiming that Bangladeshis overthrew a democracy (which it wasn't). These kinds of comments, reactions, characterizations, again, ultimately, don't help the relationship. You then had immature Bangladeshis respond to these online attacks with their own inaccurate, misinformed, and often racist attacks, and now you have a self perpetuating cycle of degradation.",
      "votes": "59",
      "replies": [
        {
          "text": "Perfectly explained",
          "votes": "5",
          "replies": []
        },
        {
          "text": "Well said",
          "votes": "3",
          "replies": []
        },
        {
          "text": "Well said bro",
          "votes": "3",
          "replies": []
        },
        {
          "text": "",
          "votes": "-6",
          "replies": [
            {
              "text": "You mean the thing that most Bangladeshis strongly oppose? What about them?",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "ok, too many points, I'll try to keep short, First, everyone will agree that India wants to be the regional power of this region. Nothing wrong with that, but the problem is how you get that position. as an example China projects soft power, in Pacific Ocean, whenever theres a natural calamity happens in some remote island, Chinese navy is first to reach there to help, they make the people of other countries realize that China is their friend... India does the opposite, India literally tortures people... They treat Bangladeshis as some poor helpless group of people whoso only life purpose is to serve them. Every year BSF kills more than thousand Bengali people in the border just for fun. (Search for Felani murder, BSF killed a young girl threw her body on the fence as a display. no one dared to approach her and bring down the body because they were also afraid of being shot). As a upstream country, India uses dam to take control of the whole river. multiple rives actually. whereas international law clearly says upstream countries can not dam more than 45% of the water. So, clearly the Bangladeshi people are fed up with everything. Then comes the second problem. Indian government always thought, they can exploit the people and by keeping the government in check, they can keep the people in check. They totally succeeded in this. Even the most fundamentalist groups of Bangladesh stays within the line. But this can go one for so many years. The hatred you are seeing it was bound to happen today or tomorrow",
      "votes": "13",
      "replies": []
    },
    {
      "text": "Indian imperialism.",
      "votes": "15",
      "replies": [
        {
          "text": "Can u expand more",
          "votes": "2",
          "replies": [
            {
              "text": "",
              "votes": "-10",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Regardless of who's in power, the natural response is to adapt and attempt to strengthen the relationship with a foreign country after they have a big upheaval. So India's reaction is confusing because they didn't show any goodwill in mending the diplomatic relations. They certainly don't mind having good relations with Afghanistan. It's unclear if India will change their approach when a democratically elected government is in charge.",
      "votes": "8",
      "replies": [
        {
          "text": "I think core bjp hates muslims especially Bengali muslims. They believe they can use them as a target to win elections in W.Bengal, Assam and rest of North East India",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "You should go ask your Indian friends why they claim to be the biggest democracy in the world, but support rabid dictators to keep a country in their sphere of influence. Whenever Bangladesh has tried to secure it’s national interest, India has intervened in one way or the other. They never came to us as friends on equal terms, but always as a bully.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Short version:\nBorder killings, disagreement over water allocation, direct involvement in some enforced disappearances, direct support for Hasina who was very authoritarian, and Akhand Bharat are some of the reasons for the collapse.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Rhetorics",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Modi Sarkar",
      "votes": "1",
      "replies": [
        {
          "text": "Let's not forget, the decision to let Hasina stay there was bilateral. So congress is equally to blame, not only for putting Hasina to power in the first place but also for sheltering her.",
          "votes": "1",
          "replies": [
            {
              "text": "con-gress also enabled rendian army to mass loot our country worth in Billions $$ of 1971's money, after pakisurrender. lets not forget",
              "votes": "-2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Hindutva terrorism",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Bangladeshis want india to be secular while they themselves want a islamic sharia state and vice versa. I think religion is being used as a tool here, always have.",
      "votes": "-4",
      "replies": [
        {
          "text": "More like Bangladeshis do not want dictators sheltered and backed by India to SHOOT at us and make us disappear.",
          "votes": "11",
          "replies": []
        },
        {
          "text": "Bangladeshis want india to be secular, want a islamic sharia state\nBangladeshis want india to stay its imperial, hostile, self-serving, two-faced hypocrite bigfat nose far the fuck away from our country and preferably exist in a different dimension on a different planet altogether. i dont give a shit about rendia's secularism nor want my country to be a religiofascist state like fuckistan (or rendia) again and neither does majority of Bangladeshis.",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-5",
      "replies": []
    },
    {
      "text": "We didn’t hated our government. But they clung to power with India’s support.\nMy enemy’s friend is my enemy.",
      "votes": "0",
      "replies": []
    },
    {
      "text": null,
      "votes": "2",
      "replies": []
    },
    {
      "text": "Move on bro, pakistan remains same whether it is west or east doesn't matter.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "So?",
      "votes": "1",
      "replies": [
        {
          "text": "So?",
          "votes": "1",
          "replies": []
        },
        {
          "text": "This post was removed as it breaks reddiquette, which is a set of guidelines that all users of r/bangladesh follow in order to make the subreddit a civil discussion space.\nThis also includes discrimination or offensive language which is not tolerated here. This includes racism, misogyny, xenophobia, homophobia, and/or religious discrimination.\nBe civil. Remember the human that you're interacting with.\nWhile your post may have had substantive content, either right or wrong, we have had to remove this in order to be fair about enforcing the rules. Thank you for understanding.\nRule #1. Follow Reddiquette.\nএই পোস্টটি সরানো হয়েছে কারণ এটি রেডিকেট লঙ্ঘন করেছে। রেডিকেট হলো একটি নিয়মাবলী যা r/bangladesh এর সকল সদস্য মেনে চলে, যাতে এই প্ল্যাটফর্মটি শালীন এবং গঠনমূলক আলোচনার পরিবেশ বজায় রাখতে পারে।\nএই সাবরেডিটে কোনো ধরনের বৈষম্যমূলক বা আপত্তিকর ভাষার অনুমতি নেই। এর মধ্যে পড়ে বর্ণবাদ, নারীবিদ্বেষ, জেনোফোবিয়া, কুইয়ারফোবিয়া, এবং ধর্মীয় বৈষম্য।\nআপনার আচরণে শালীনতা বজায় রাখুন। মনে রাখবেন, যার সঙ্গে আপনি কথোপকথন করছেন, তিনিও একজন মানুষ।\nআপনার পোস্টে হয়তো গুরুত্বপূর্ণ কিছু বিষয় ছিল, তবে নিয়মের প্রয়োগ নিশ্চিত করতে এটি সরাতে হয়েছে। বিষয়টি বোঝার জন্য আপনাকে ধন্যবাদ।",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Caste",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Bangladesh’s economy is heavily interlinked with India’s — far more than India’s is with Bangladesh.\nRaw cotton: Over 60–70% of Bangladesh’s raw cotton imports come directly from India. Without Indian cotton, Bangladesh’s $45+ billion garment industry literally stalls.\nYarn & fabrics: India is one of the main suppliers of yarn, dyes, chemicals, and accessories — all the intermediate goods Bangladesh needs to finish its garments.\nLogistics: Many RMG inputs are shipped via Indian ports (Kolkata, Petrapole–Benapole, etc.) before reaching Dhaka or Chittagong.\nMachinery & maintenance: Much of Bangladesh’s textile machinery, spare parts, and technical maintenance support comes from Indian firms.\nIf India restricts exports or raises tariffs on these, Bangladesh’s RMG exports could contract by double digits within months.\nThis one is massive and underreported.\nElectricity imports: Bangladesh imports over 1,100 MW of electricity directly from India — roughly 10% of its total grid supply.\nExample: The Bheramara–Baharampur and Tripura–Comilla transmission lines.\nFuel and LNG: India provides refined petroleum products and LPG to Bangladesh, including emergency supplies when local plants face shortages.\nCoal and grid stability: Indian coal and cross-border power trading help Bangladesh maintain base-load stability. → If India cuts supply, Bangladesh faces rolling blackouts and factory slowdowns within weeks.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I hope my comment does not get deleted",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 250
}