{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pafbzu/for_people_who_want_a_simple_explanation_of_what/",
  "hash": "4df4847b5369c2d22f6f0059c23ddf87",
  "scraped_at": "2025-12-08T17:03:21.018603",
  "title": "For people who want a simple explanation of what is commonly called the minus two theory. মাইনাস টু থিওরি কি",
  "description": "During 2008 when the country was under a caretaker government, the deep state of Bangladesh which I think is basically our intelligence agencies along with foreign ones decided that if they removed the main heads of the two biggest parties, the Sheikh and Zia families, the country would be free from family based political dynasty and we would have a better democracy. They even created a political party called Nagorik Shokti নাগরিক শক্তি*** led by Yunus ( তখনকার এনসিপি) . For some reason they failed. Awami League somehow came to power and that deep state disappeared into thin air. Their luck this time is that they do not have to worry about Hasina and Khaleda because one is on her deathbed and the other has fled the country. Most other members of the Sheikh family have no real power over Awami League, so one part of the formula is already done. The only remaining strong figure and the only real challenge for the deep state is Tareq Zia, and they will likely try to finish their unfinished business now. Yes, there are figures like Sheikh Taposh, Sheikh Selim, and the daughters in law of Begum Zia, but grassroots party cadres do not care about them. So in one line the minus two formula means this: if you cut the snake’s head, the snake will die. PS - এনসিপি এর স্টুডেন্ট এর নাম বাংলাদেশ গণতান্ত্রিক ছাত্র সংসদ বা বাগছাস থেকে নাম করা হইসে জাতীয় ছাত্রশক্তি*** xD connect the dotts",
  "votes": "28",
  "comments": [
    {
      "text": "Eto shoja na. Kono political party e minus hbe na. Ei deshe public sentiment weather er cheye druto change hoy. Last year ei time e Dr Yunus er Public Rating was sky high. Now see where it has reached.",
      "votes": "15",
      "replies": [
        {
          "text": "It's not eliminating the political party, but the supreme leader of that political party, in south Asia politics mostly controlled by family.\nHere it comes -4 If you eliminate the 2 family from the politics then the party will be divided into many pieces.\nThen controlling the country by oligarch will be more easy. Soon it will be more clear.",
          "votes": "3",
          "replies": [
            {
              "text": "Will Khaleda and Hasina live forever? Death can come at any time. If a party as old as league has none to offer after Hasina, then they deserve to the present treatment they are receiving now.",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "In august if Yunus stood in a threeway election between hasina vs khaleda vs yunus. The results would have been. 1. Khaleda 2. Hasina 3 Yunus.\nIf it was sky high he would have contested elections.",
          "votes": "-2",
          "replies": [
            {
              "text": "When did Bangladesh adopt presidential election? League will not win any election in upcoming 10/15 years. That's the reality. Even if BAL is allowed run in election, they will never cross single digit. Hasina destroyed league from the core. Its somehow in their favor not to be able to run in this election. That's why Fakhrul wanted them to run this election. Being a non politician, Yunus made the wrong choice.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Yunus was supposed to lead Nagorik party but he backed out later because of the backlash from the existing political parties. Yunus always comes to forefront of having credibility in the national and international scene when you think about someone from Bangladesh. That's why Hasina hated him to death since then. She was already bitter about Yunus being catapulted to this most respected Bangladeshi abroad. She likely didn't think anyone should be seen higher than her father and family.\nAs for the minus two formula, it likely was backed by USA. Both Moinuddin and Fakrul is now in USA. Removing the two big parties doesn't solve the problem. Our people have no morals. Education is pointless if you can't judge something above your religious belief. We dodged one kind of bullet there because Yunus would compromise with everyone to keep everyone happy.",
      "votes": "16",
      "replies": [
        {
          "text": "He asked for nagorik party. The problem is except some elites and middle class people from Dhaka, no one in BD will vote for him or his party. Hence nagorik party fell apart.\nAlso he askes for a full term for moin u. Moin u did not ablige. Moin u saw the writing on the wall.\nHasina hated him (khaleda would too if she came to power in 08) as he was central in Minus 2 plan. Ekhon BNP is sucking Yunus is because BNP wants to get to power and bring Tarek back.",
          "votes": "5",
          "replies": []
        },
        {
          "text": "Younus Was never Suppose to lead Ncp",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "BD r tmn kno established 'deep state' nai except for a few business, military and mafia families that also act as spies and agents for the CIA, Raw and ISI.\nThe current abrupt change is the CIA's doing in particular, and Raw's intentional negligence to let BAL fall cuz they had enough of BD slowly falling into China's orbit along with many other reasons\nAnd if you know anything about the CIA, and their hundreds of coups around the world, you'll know they don't give a rat's dime about democracy. They will only work to further their nation's interests. The US has no friend.\nThey'll make nations fall into rubble if that makes a profit for their own",
      "votes": "4",
      "replies": [
        {
          "text": "We always had a deep state. Tarique Zia ran a deep state from 2001-2006 in hawa bhabun: https://en.wikipedia.org/wiki/Hawa_Bhaban\nYou could argue the entire BAL tenure was a deep state. There are also conspiracies that the BDR massacre was done in part to silence critiques of the deep state (when the army played a role during the 2006-08 caretaker government).\nWith every regime change, a new power pulls the strings from the shadows.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "মাইনাস টু থিউরি মূলত তৎকালীন ঢাকার আমেরিকান দূতাবাসের চার্জ দ্য এফেয়ার জন ডানিলোভিজের মাথা থেকে বের হওয়া বুদ্ধি। তিনি তখনকার সিআইএ হেডকে একটা তারবার্তা পাঠান যেটাতে তিনি বাংলাদেশে একটা প্ল্যানের কথা বলেন যেখানে - হাসিনা ও খালেদা দুজনকেই অবসরে পাঠানো হবে, sham একটা ইলেকশন হবে যেখানে ড. ইউনুসের নেতৃতাধীন নাগরিক পার্টি ভোটে জিতবে এবং জামায়াতে ইসলামী হবে বিরোধী দল, আওয়ামী লীগ ও বিএনপির মধ্যে থাকা আমেরিকাপন্থী নেতাদের নিয়ে রিফর্ম লীগ ও রিফর্মড বিএনপি গঠন হবে, এতে পুরো পলিটিক্যাল স্ট্রাকচারটাই প্রো-আমেরিকা হয়ে যাবে প্লাস জামায়াতকে বিরোধী দল করলে ইসলামিস্টদের একটি জাগরণ হবে যেটা প্রফেসর ইউনুস ঠেকিয়ে রেখে পশ্চিমা হিরো হয়ে যাবেন। কেউ WikiLeaks এ গিয়ে ওর নামে সার্চ করে দেখেন কি পরিমাণ ডকুমেন্ট ফাঁস হয়েছে।",
      "votes": "3",
      "replies": [
        {
          "text": "thank u for further information",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Not easy. They represent two streams of poltics and their voters like these families, so for unity, someone from the family will.come along. There will be a down period of chaos from there a new face will come and bring unity. hasina was made president in absentia in the 80s when she was in exile and rest is history and they will be joined by a new brand of strong leaders. bad time creates strong men. Eikhaneyo hobey. For both BNP and AL.\nDeeo state will be succeasful temporarily.\nForeign intelligence amader bhalo chaibey keno?",
      "votes": "4",
      "replies": [
        {
          "text": "",
          "votes": "-5",
          "replies": [
            {
              "text": "Lol. They want another pakistan. A pro mikitary state with weak politics and gov. Deep state er kotha na shunley be prepared to become another imran khan or hasina.",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "So, is this a good move? Tired of BAL and BNP.\nBut the alternatives are not any better.",
      "votes": "1",
      "replies": [
        {
          "text": "Devil you know the devil you dont. Alternatives are worse.",
          "votes": "7",
          "replies": []
        }
      ]
    },
    {
      "text": "Too much falsified information.",
      "votes": "-1",
      "replies": [
        {
          "text": "which one is false? give counter infiormation .",
          "votes": "0",
          "replies": [
            {
              "text": "Yunus is not part of NCP at present, but they might make him president if they come to power. Jamaat might make Shafiqur the president and Golam Parwar the prime minister. If BNP comes to power, Khaleda Zia might be elected president and could also remain in the upper house.",
              "votes": "0",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "They show that they're doing minus two, but only do minus one. Last time it was BNP.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 31
}