{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p9v7k8/whats_stopping_tarique_rahman_to_come_back_to/",
  "hash": "05f4e0e02ca121396cece6810d7709a0",
  "scraped_at": "2025-12-08T17:03:40.083640",
  "title": "What's stopping Tarique Rahman to come back to Bangladesh?",
  "description": "I have tagged it as politics, but not here to make it a political discussion. I am simply curious to know what's stopping him to go back to Bangladesh. Does anyone know / have an idea?\nHis mother is in critical condition, natually, every child would do anything in their power to stay close to their mother. I am sure he would too. But, what's stopping him?",
  "votes": "26",
  "comments": [
    {
      "text": "British passport?\nFear of assasination?\nTarique is a hologram and the real tarique is dead?\nWants confirmation from yunus of election in feb?\nOne of those probably",
      "votes": "31",
      "replies": [
        {
          "text": "Tarique is a hologram... lol..",
          "votes": "13",
          "replies": [
            {
              "text": "Tarique is a hologram and the real tarique is dead?\nI remember the Michael Jackson and Robert Kardashian and Queen Elizabeth (before she died they used hologram for the balcony appearance) holograms, lol.\nIf the real one was dead they would use someone who looks like him, like they do with so many famous people already.",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "Bangladesh Army! He signed a contract with the Army that he would never do politics in Bangladesh soil. I think without army's green signal he would never be able to come in Bangladesh!",
      "votes": "17",
      "replies": [
        {
          "text": "A Contract is not enforceable if it was induced by threat or undue influence.",
          "votes": "5",
          "replies": []
        },
        {
          "text": "Nah. That's outdated. The Amry has no intention to enforce that contract right now.",
          "votes": "10",
          "replies": []
        }
      ]
    },
    {
      "text": "I have a much simpler theory that's more plausible. It can be the case that although Tarique Rahman has refugee staus in UK he doesn’t have UK citizenship or passport yet. In such case if he travels back to BD he will loose his asylum status and can't go back to UK ever again. Loosing the asylum status is bad for him if he ever needs to flee BD.",
      "votes": "11",
      "replies": [
        {
          "text": "This is the least probable. One someone has asylum status, it takes only 5 years to be permanent and then apply for citizenship. Also, I think the restrictions are only for 7/8 years, where you can’t travel to your home country, after that, you are free. He lived in the UK for long enough to be British already.",
          "votes": "9",
          "replies": []
        },
        {
          "text": "He is not a British citizen and has permannt residency through refugee status in the country per latest British filings on his case. I do not understand how this misinformaiton spreads when there is documents online as the Brits are pretty transparent with their legal decisions.\nHe gave up his PASSPORT not citizenship of Bangladesh to seek refugee status. The passport is the thing used to travel across countries, so Tarique currently (unless he gained his passport back from the embassy, as is his right as a by-birth citizen of Bangladesh).",
          "votes": "5",
          "replies": [
            {
              "text": "This is not about Tarique tho. Paragraph 1 in the decisions says “He entered the United Kingdom as a Tier 4 (General) Student on 7 November 2013”. As far as I know, Tarique went to London in 2008. Also, in paragraph 5 it states “he had taken part in demonstrations calling for the release of Khaleda Zia and Tarique Rahman”. It is clearly about someone else and not Tarique.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Is he really that afraid? I can already see how much of a puppet he would be if he ever became prime minister. It seems like Bangladesh could fall under military rule whenever a greedy army officer rises to power.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "If the caretaker govt had any sense, they'd ban party leadership from abroad.\nYou should have to live in country for more that 1/2 of the year to hold a leadership position in a registered party, and stand for or hold public office. They could put a cap on foreign finances for the parties as well.\nSuch a move would be both within their mandate, and clear the playing field for new era of politics.\nBut unfortunately the caretakers got preoccupied with rewriting the constitution, getting new pink uniforms for the policy, and setting up a kangaroo court.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "The BNP's strategy is to win the national election using the hype that will be generated upon Tarique's return. One of their central leaders(cant remember name) has said a few months ago that half of their campaign will be completed when Tarique finally arrives here. That means if he returns to early, the hype will fade by the time of the election. Now do you understand why he isn't returning?",
      "votes": "5",
      "replies": [
        {
          "text": "Hi mother is dying. Him coming and being the son would give him poltical mileage.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "This here is what's wrong with our politics in a nutshell.\nEvery corrupt politicians like him or Zia family or the Sheikh family and others should stay the fuck away from the country unless they are in prison for their crimes.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "MSS the Chinese Intelligence agency and ISI the Pakistani intelligence agency has advised DGFI and NSI to not let Tarique Rahman come to Bangladesh because they don't want him to make the same mistake as Ziaur Rahman. R&AW has plans to assassinate him just like they did to his father because he has an expansionist mindset. Also if that doesn't happen The Deep State will and frame India to create a war like situation between India and Bangladesh so that they can profit from it by selling weapons. Also they brought a new plan Tarique Minus Policy just because he refused to collaborate with the USA against China and give them a Base which was also refusd by Ziaur Rahman during his ruling period. So for the USA it is like killing 2 birds with 1 rock.",
      "votes": "9",
      "replies": [
        {
          "text": "DGFI তে ভাইয়ের পোস্ট কি?",
          "votes": "4",
          "replies": []
        },
        {
          "text": "this might remain in the realm of theory",
          "votes": "4",
          "replies": [
            {
              "text": "let him cook",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "Lol",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "what ever the threat is... If he cant come at this dying hour for her mother, he may never be seen as an worthy or manly politician who stood against all odds. He still has that chance to grab that but does he actually want to?!!!",
      "votes": "3",
      "replies": []
    },
    {
      "text": "অনেকেই বলতেছে মায়ের এই অসুস্থতার সময় ছেলে কেন দেশে আসতেছে না, অভ্যন্তরীণ কিছু ঘটনা থাকে যেটা আমাদের সব সময় অজানা।\nআন্তর্জাতিক কিছু থ্রেট আছে ভাই তার জন্য উনি দেশে আসতেছে না।। বিশেষ করে ভারতের থেকে। অনেকে হয়তো যুক্তি দিবেন যে এই দেশে কিভাবে সম্ভব, আসুন একটা উদাহরণ দেই কিছুদিন আগে কানাডাতে একজন শিখ নেতার জীবন গেছে সেখানে ভারতের সরাসরি জড়িত থাকার প্রমাণ পাওয়া গিয়েছিল। দেশে উনার নিরাপত্তা নিশ্চিত হওয়ার পরই কেবল উনি দেশে আসতে পারেন।।\nবিঃদ্রঃ একই ধরনের নিরাপত্তার হুমকি জুলাই অদ্ভুত্থানের ৬ জন সমন্বয়কেরও রয়েছে, তারাও হতে পারে টার্গেট কি/লিং এর শিকার। ধন্যবাদ।।",
      "votes": "2",
      "replies": [
        {
          "text": "মনে হয়না। আওয়ামীলীগের অবর্তমানে এখন ইন্ডিয়া তারেক জিয়াকেই চাইবে। কারন জামাত আসুক এটা ওরা নিশ্চয়ই চায়বেনা। তো অপশন একটাই। ওরা চাইবে তারেক জিয়ার সাথে হাসিনা টাইপ রিলেশন গড়ে তুলার, যতটুকু সম্ভব।\nআর যেরকম এন্টি ইন্ডিয়া সেন্টিমেন্ট দেশে বিরাজমান, তাতে ইন্ডিয়া কর্তৃক ঝুকি থাকলে রিজভি সাহেব এতোদিনে দশবার শাড়ি পুরায় ফেলতো। বিএনপি ইন্ডিরেক্টলি হলেও এটা বলে দিত; তাতে মানুষের সাপোর্ট ও পেতো, যেটা রাজনৈতিক মাইলেজও এনে দিত বিএনপিকে।",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "But, what's stopping him?\nYou are this so close to become a conspiracy theorist. He's not allowed to visit her, for \"reasons\" known to him and them (those who are controlling him).",
      "votes": "0",
      "replies": []
    },
    {
      "text": "আচ্ছা সবাই যে এত লিখে ফাটায় ফেলতেসে... আমার খালি লজ্জা লাগে যে ভাই, আমরা কোন চেটের বাল যে সারা বিশ্বের গোয়েন্দা সংস্থা আমাদের কন্ট্রোল করে আর যদি আমরা ওমন হেডম ওয়ালা হইও, তাইলে সবাই আমাদের কন্ট্রোল করে কেন!!!",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 32
}