{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p9pax4/graphic_violence_warning_tuohidi_gang_chase_and/",
  "hash": "6956c23528ef651aca84c3c9e5483cb0",
  "scraped_at": "2025-12-08T17:04:16.517438",
  "title": "GRAPHIC VIOLENCE WARNING: Tuohidi gang chase and attack a Baul folk singer for allegedly hurting religious sentiment in Dhaka after Jummah prayers on Friday, Nov 28",
  "description": null,
  "votes": "103",
  "comments": [
    {
      "text": "Country will be destroyed by these men.",
      "votes": "48",
      "replies": [
        {
          "text": "The country is already gone. It's just tendering to a complete meltdown.",
          "votes": "16",
          "replies": [
            {
              "text": "Be prepared. Thanks your local gen-Z morons for this havoc. Enjoy",
              "votes": "18",
              "replies": []
            }
          ]
        },
        {
          "text": "Be prepared. Thanks your local gen-Z morons for this havoc. Enjoy",
          "votes": "8",
          "replies": []
        },
        {
          "text": "The country is already gone. It's just tendering to a complete meltdown.",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "Aha RELIGION",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Madrasai shishu balat.kar korle problem nai 💀",
      "votes": "45",
      "replies": [
        {
          "text": "কারন একজন ভালোমানুষ অমুসলিমের চেয়ে শিশু ধর্ষক হুজুর এদের চোখে অনেক ভালো:\nhttps://youtu.be/LLCWHCgaJA8",
          "votes": "6",
          "replies": [
            {
              "text": "So according to this id!ot you can commit atr0.cities but if you do your prayers everyday \"You are good mate.\" The one who doesn't believe in g0d but does good everyday will still be condemned? It sounds like he is trying to convince people that his reli.g!on is a complete shambles. LOL",
              "votes": "7",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Fun fact: The Baul Abul Sharkers daughter was one of the July fighters.",
      "votes": "30",
      "replies": [
        {
          "text": "Do you think they care? I think we can all agree now July was more about putting these guys in power.",
          "votes": "22",
          "replies": [
            {
              "text": "No. They dont. This is the way rulers in our country start digging their own graves. BAL came to power as a result of grassroot activism by secular activists. After solidifying their power, first thing Hasina did was make this country a jahannam for seculars. She enjoyed koumi janani so much it became her downfall. The fall was so steep, she fell with her whole party. The current regime is doing the same. They are hurting the people who supported their uprising.",
              "votes": "7",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Lock them up asap",
      "votes": "14",
      "replies": []
    },
    {
      "text": "পূণ্যে পাপে দুঃখে সুখে পতনে উত্থানে\nমানুষ হইতে দাও তোমার সন্তানে\nহে স্নেহার্ত বঙ্গভূমি............\nসতেরো কোটি সন্তানেরে, হে মুগ্ধ জননী,\nরেখেছ বাঙালী করে, মানুষ কর নি।",
      "votes": "11",
      "replies": []
    },
    {
      "text": "I’m very sad to say this bt I miss Hasina",
      "votes": "14",
      "replies": []
    },
    {
      "text": "Terrorists",
      "votes": "9",
      "replies": []
    },
    {
      "text": "So stupid, So infuriating. যত NCB আর হারামির বাচ্চারা দেশ বেইচা দিছে এদের হাতে তাদের সবার আগে এই হাল হওয়ার দরকার ছিল..",
      "votes": "4",
      "replies": []
    },
    {
      "text": "এই হোলো “শান্তিপ্রিয়” মুসলমান, এদের “শান্তির” হাত থেকে মুসলমানরাই রেহাই পায় না, বাকিদের কথা নাহয় বাদই দিলাম।",
      "votes": "9",
      "replies": []
    },
    {
      "text": "The existence of Bangladeshi common Muslim under serious threat .\nstop your zakaat sending to madrasa & masjid give it directly to poor",
      "votes": "4",
      "replies": [
        {
          "text": "And then the poor give it to the madrasas cuz that’s how they (think) they get blessed",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Sad reality",
      "votes": "2",
      "replies": []
    },
    {
      "text": "আচ্ছা এই হুজুরগুলো এমন কেন?? এরা কেমনে বলে এরা শান্তির ধর্ম প্রচার করে? সবসময় খালি খুন খারাপই ই করে বেড়ায়।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "What a shitshow.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Umar (RA) during his caliphate brought in people of other faith to live in harmony with the Muslims (with their religious beliefs), a person that was given the good news of Jannah when he was still living. So, do these so called religious people in Bangladesh think that they are better than Umar (RA)?",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Apparently he was a mobile phone thief, not baul",
      "votes": "3",
      "replies": [
        {
          "text": "Still not a good reason for mob justice. That's what law enforcement is there for.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "i believe they all are under cover j@@m@t ,Hef@jot & HT members. they are same in different name",
      "votes": "3",
      "replies": []
    },
    {
      "text": "At this point, it isnt about religion. They just wanna have fun and justify it under their version of \"religion\". Definitely star plus, eid natok enjoyer molobis.",
      "votes": "0",
      "replies": []
    },
    {
      "text": null,
      "votes": "-3",
      "replies": []
    },
    {
      "text": "এই সেন্টিমেন্ট শুধু তৌহিদি খনিকের পোলাদের ই আছে। এদিকে ইউনুস সাহেব আছেন মহা আনন্দে।",
      "votes": "1",
      "replies": []
    },
    {
      "text": "And Bangladeshis call Indians intolerant. 😆",
      "votes": "1",
      "replies": []
    },
    {
      "text": "That's why you need Hasina, it's sad but because of this stupid Yunus Government, Hasina govt will be back in 5 years, these extremists can not be controlled with the joker Government where there is no law and order.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 34
}