{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p7yo0d/%E0%A6%A8%E0%A6%9C%E0%A6%A6%E0%A6%B0_%E0%A6%AA%E0%A6%B0%E0%A6%AC%E0%A6%B0%E0%A6%B0_%E0%A6%AC%E0%A6%AF%E0%A6%95_%E0%A6%B2%E0%A6%95%E0%A6%B0_%E0%A6%AD%E0%A6%99%E0%A7%9F_%E0%A6%87%E0%A6%89%E0%A6%A8%E0%A6%B8%E0%A6%95_%E0%A6%AC%E0%A6%AF%E0%A6%95_%E0%A6%A1%E0%A6%95%E0%A6%A4_%E0%A6%AC%E0%A6%B2%E0%A6%B2%E0%A6%A8_%E0%A6%B6%E0%A6%96_%E0%A6%B9%E0%A6%B8%E0%A6%A8/",
  "hash": "188003f8a9ed40391dd643e16776f1f5",
  "scraped_at": "2025-12-08T17:06:22.574524",
  "title": "নিজেদের পরিবারের ব্যাংক লকার ভাঙায় ইউনুসকে ব্যাংক ডাকাত বললেন শেখ হাসিনা, স্বীকার করলেন ৮৩২ ভরি স্বর্ণ থাকার কথা",
  "description": null,
  "votes": "5",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "৮৩২ একজন প্রধানমন্ত্রীর জন্য কিছুই না প্রধানমন্ত্রীর পিয়নের চেয়ে বেশি সম্পদ হয়তো আছে।\nআপনি যদি নিখুঁতভাবে আইনের পথে যেতে চান তো তাহলে দেখেন গয়নাগুলো নির্বাচনীয় হলফনামায় আছে কিনা।",
      "votes": "11",
      "replies": [
        {
          "text": "Found it. See lied as expected.\nhere is the source https://www.prothomalo.com/bangladesh/ifjr7ruqgk",
          "votes": "6",
          "replies": []
        },
        {
          "text": "আপনি যদি নিখুঁতভাবে আইনের পথে যেতে চান তো তাহলে দেখেন গয়নাগুলো নির্বাচনীয় হলফনামায় আছে কিনা।\nখুবই rational আলাপ আনলেন ভাই। এটাই দেখা উচিত। Let me see if there is anything about the details.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Okay so I'll say two things actually three.\nI'm not defending IG.\nDidn't a lot of you say this entire situation was orchestrated and the jewellery intentionally placed there? Your supreme leader is saying otherwise, maybe next time don't start saying random shit without thinking just to shittalk on groups you don't like.\nThe fact the opening of the vault was actually followed legally this time, unlike Hasina is claiming, the gov waited till court issue to pen the vault(I wrote it in another comment they might have waited this long for theatrics basically).\nAlso for other people if Hasina has to prove nothing was placed there after her becoming a Prime minister she still should have kept a proper documentation of it(which is also her or her lawyers responsibility to show the government.) because as far as I know even when inherited people have to still declare their assests. And public officials still have to declare it again after/before thier tenure. So unless Hasina can prove she declared it ,the right authorities can seize it all.\nWhen making a claim the burden of proof lies in yourself. In this situation the only thing the current gov said was this amount of gold was found in the vault (no saying if these are illegal or not as far as I know feel free to prove me wrong).",
      "votes": "2",
      "replies": []
    },
    {
      "text": "সেতো বলছেই স্বর্ণ বস্তি বাসিকে দিয়ে দিতে। নূনূস এখনো দেরি করে কেন? নাকি স্বর্ণ লোন দিবে?",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 41
}