{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p7xil5/do_you_think_not_finding_anything_luxurious_when/",
  "hash": "937b99809298da95a7933d4e3b5d1e22",
  "scraped_at": "2025-12-08T17:06:39.509167",
  "title": "Do you think not finding anything luxurious when gonobhobon was pilfered was the reason of the gold drama?",
  "description": "July fighters didnt reqlly find gold or hard cash or things Like that when they occupied and pilfered gonobhobon. But found normal furnitures and walton TV and Ac. Didnt even have a swimming pool, which forced july fighters to swim in a fish pond and steal underwear and ducks etc.\nIf they found luxurious or valuable things, do you think, gold drama need not be done for the ACC case?",
  "votes": "6",
  "comments": [
    {
      "text": "Let's take this as a drama. Now tell me did BAL's good government steal money or not? Did you check Hasina’s bag before she left the country? Why do you think she can't keep a deposit box in a bank and leave it there while taking her gold from Ganabhaban with her?",
      "votes": "6",
      "replies": [
        {
          "text": "This, i don't actually get why people think this drama is faked. A drama for sure but not fake. Why do people think they waited so long to issue Hasina's assets be seized,when they already did It for many other politicians. They wanted to open the vaults at the right time, and right after her death sentence was the perfect time for theatrics.\nEi khane keo unironically judi chinta kore ekta politician er bank e absurd amounts of taka ar jewelry thakbe nah is stupid. I don't doubt even Yunus is free of such guilt.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "দেখানোর মতো কিছু না থাকলে সাধারণ ঘটনাকেও নাটকে পরিণত করা—এটা খুবই পরিচিত এদেশে।",
      "votes": "2",
      "replies": [
        {
          "text": "",
          "votes": "-6",
          "replies": []
        }
      ]
    },
    {
      "text": "মৃত্যু ঝুকি সম্পন্ন পলায়ন করা বাড়ির মালিক তার ঘর থেকে জিনিসপত্র না নিয়ে আগে সে ব্যাংকে যাবে, কিছুক্ষন অপেক্ষা করবে ডকুমেন্টস রেডি করবে, তারপর উইথড্র করবে, তারপর বাড়িতে আসবে, ব্যাগ গুছাবে, তারপর পলায়ন করবে যখন তার হাতে আছে মাত্র ১ ঘন্টা??\nএটাতো কম সেন্স যে হাতের কাছে যা থাকবে তা নিয়েই আগে পালাবে।।",
      "votes": "1",
      "replies": [
        {
          "text": "To be honest gold er je nomuna dekhaisey chobi tey, no wonder Hasina didnt want it.",
          "votes": "-1",
          "replies": []
        }
      ]
    },
    {
      "text": "I feel the whole drama was done to divert people from a huge news that went right under the radar!! one of the most important person to Dr Mohammed Yunus , has allegedly impregnated someone with the promise to marry ( a criminal offence) and made her aboard the baby!! the leading media channels are trying to divert people from even discussing about it!! Within a month, we see two episode of large scale drama - to divert us from something happening at the same time!! when Dhanmandi 32 run down operation took place on the day of Haseena trial verdict - a huge 30 years lease was given out by the “interim” government that has the potential to decide the fate of this country (economically) for the next few decades!! I believe in patterns!! and I feel I should talk about it when I see one",
      "votes": "1",
      "replies": [
        {
          "text": ">I believe in patterns!! and I feel I should talk about it when I see one\nThis only works when one of your only two points isn't a straight up conspiracy theory with no alleged proof.",
          "votes": "1",
          "replies": []
        },
        {
          "text": "Wait, what, Mr Yunus impregnated someone and made her abort the baby?! Where did you read this? Wow.\nI thought Mr Yunus himself was a biologically female. Some of these men are.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Gonobhaban was just a farce. All the assets and valuable stuffs were securely stashed abroad. She's not dumb and she didn't get to this level of power being dumb.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 42
}