{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p59pzu/%E0%A6%8F%E0%A6%87_%E0%A6%A6%E0%A6%B6%E0%A6%B0_%E0%A6%AD%E0%A6%9F%E0%A6%B0_%E0%A6%A6%E0%A6%B0_%E0%A6%AE%E0%A6%A8%E0%A6%AE%E0%A6%A8%E0%A6%B8%E0%A6%95%E0%A6%A4_%E0%A6%AA%E0%A6%B0%E0%A6%AC%E0%A6%B0%E0%A6%A4%E0%A6%A8_%E0%A6%B9%E0%A6%A4_%E0%A6%86%E0%A6%B0%E0%A6%93_%E0%A6%B8%E0%A6%AE%E0%A7%9F_%E0%A6%B2%E0%A6%97%E0%A6%AC%E0%A7%A7%E0%A7%A6%E0%A7%A7%E0%A7%AB/",
  "hash": "f1018fe81f077d71039b5c1fbcca519e",
  "scraped_at": "2025-12-08T17:08:36.659518",
  "title": "এই দেশের ভোটার দের মনমানসিকতা পরিবর্তন হতে আরও সময় লাগবে।১০/১৫ বছর লাগবে।যখন বুড়ো রা দুনিয়া ত্যাগ করবে আর যুবকরা তখন।বুড়ো হবে তখন গিয়ে হাসনাত, হাদিদের ভাষা, কদর তারা বুঝবে।",
  "description": "হাসনাত আব্দুল্লাহর একটা ভিডিও দেখছিলাম।\nভিডিওটা দেখে মনে হলো, সম্ভবত সে তার নিজ এলাকায় গিয়েছে এবং তার এলাকার মুরুব্বিরা এলাকার মসজিদ মাদ্রাসার জন্য তার কাছে টাকা-পয়সা চেয়েছে।\nহাসনাত উঠান বৈঠকের মত একটা আয়োজনে মুরুব্বিদের বুঝাচ্ছে, এই যে তার কাছে মসজিদের জন্য টাকা চায়, এই টাকা তাকে অন্য কোথাও থেকে চুরি করে আনতে হবে। ভোটের আগে এরকম মসজিদে দান করে, রাস্তা বানায় দিলে, পকেটে পান খাওয়ার জন্য ৫০০ টাকা, বাজার করার জন্য ১০০০ টাকা ধরায় দিয়ে ভোট কিনে ক্ষমতায় আসা যাবে ঠিকই, কিন্তু পরে ক্ষমতায় এসে ৫ বছর ধরে সে টাকা আদায় করতেই থাকবে।\nহাসনাত তখন জিজ্ঞেস করলো, আপনারা কি ভোটের আগে টাকা নিতে চান না এমন কোন প্রতিনিধিকে ভোট দিবেন যে ক্ষমতায় এসে আপনাদের দিবে?\nউপস্থিত মুরুব্বিদের চেহারা দেখে মনে হলো, এরকম কথা এই ইহজনমে তাদের মাথাতেই আসে নাই। এভাবে তারা চিন্তাই করতে পারে না। তাদের হতাশা গোপন করতে পারছিলো না। সম্ভবত তারা ধরেই নিয়েছিলো হাসনাত এখন এত বড় নেতা, অন্য বড় দলের নেতাদের মত এলাকায় এসেই টাকা ঢালা শুরু করবে। নীতিকথা দিয়ে কী হবে?\nওসমান হাদীরও একটা ভিডিও দেখলাম, নির্বাচনী এলাকায় প্রচারনা করতে গিয়ে বলতেসে, চাইলে বড় বড় ব্যবসায়ীদের থেকে টাকা খেয়ে বিশাল গাড়ি বহর নিয়ে নির্বাচনী প্রচারনা চালাতেই পারতো, কিন্তু তাতে পরবর্তীতে সেই টাকা দেওয়া শক্তিদের তাবেদারী করা লাগতো ক্ষমতায় বসে। সে এই সিস্টেমটা ভাংতে চায়। সে ভ্যানগাড়িতে করেই প্রচারণা করছে তাই।\nআমার কেন জানি মনে হচ্ছে, জুলাই আন্দোলনের মূল যে স্পিরিট তা বাংলাদেশের প্রান্তিক মানুষদের খুব বেশি একটা স্পর্শ করেনি। তাদের ভিতরে রাজনীতি, নির্বাচন, ক্ষমতায় আসা নেতা— এদের ব্যাপারে ধারণা ও এক্সপেক্টেশন আগের মতই রয়েগেছে। শুধু মানুষ আর মার্কা চেঞ্জ হবে শুধু। বাকি সব আগের মতই থাকবে।",
  "votes": "0",
  "comments": [
    {
      "text": "এই পোস্টে গ্রাম-গঞ্জের মানুষজনের কথা উল্লেখ করা হলেও, লেখাটা মূলত এই সাবের ওই সমস্ত সংখ্যালঘুদের আই ওয়াশ করার জন্য লেখা হয়েছে; যারা নতুন দিনের মববর্বরদের আসল চেহারায় ইতোমধ্যে জেনে গিয়েছে",
      "votes": "14",
      "replies": []
    },
    {
      "text": "You literally picked the worst two persons to prove a point? No one cares about people like Hasnat, Sarjis, and Hadi. Ever asked why is that the case?\nBut it was not always like this. Almost everyone cheered for them initially. If they had integrity and acted smartly, this day wouldn't come for them. They have no one but themselves to blame for it.\nHasnat, the person we are apparently \"undervaluing\" now, his upazila was granted a whooping 338 crores courtesy of his good King's Party friend Asif. Asif's own upazila was granted the highest amount, 453 crores. Just to show how ludicrous and unjustified this amount is, entire districts from the poorest divisions like Rangpur were granted less than 20 crores. What will Hasnat do with all that money if he gets elected? Perhaps if he shared a realistic and honest plan with the rural people they would trust him more? Is he doing that?\nMost people don't want corruption and bad practices, regardless of them being from the rural or urban background. Expecting development and benefits in rural places from election candidates is not wrong or unnatural, but quite the opposite. Mamdani showed us how it can be done despite the odds. Why can't people like Hasnat or Hadi do the same? I will tell you why, they are a bunch of utterly incompetent morons who can only bark and annoy people with their big talks.",
      "votes": "4",
      "replies": [
        {
          "text": "A small correction: only a tiny fraction don’t want corruption and malpractices in this country. Most of the people are direct or indirect beneficiaries of corruption.",
          "votes": "1",
          "replies": []
        },
        {
          "text": "\"No one cares about people like Hasnat, Sarjis, and Hadi\" yeah sure buddy, you know who are BD's political young hotshots .\nWe really don't know if those supposed crore of provisioned money was due since the calculation of the 15 years were forked.",
          "votes": "0",
          "replies": [
            {
              "text": "Huge denial right there. 15 years has got nothing to do with this. There is absolutely zero justification in allocating 30 times money in their own sub-districts when compared to the poorest districts. Yes, by poorest I mean as of today according to government metrics, not poorest 15 years ago.\nBy the way, this is the same Asif you are defending who is repeatedly abusing his power. A similar recent misconduct was done here. Not to forget to huge list of other controversies and other misconducts. He declared he will be doing the election and yet he has not resigned. Speak volumes.",
              "votes": "1",
              "replies": []
            },
            {
              "text": "don't know\nCommenting without knowing is not a good look",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "amra shanti chai vai. vote hobe nirbachon hobe desh cholbe shobi hobe but always netader procharona dekhe jibon par korte chai na r.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "নেতা তো আকাশ থেকে নেমে আসে না রে ভাই। একজন নেতা আমাদের সমাজ, আমাদের শিক্ষা ব্যাবস্থা, আমাদের পারিপার্শ্বিক্তার প্রোডাক্ট। মানুষ নিজে যেমন সেরকম লোককেই নেতা হিসেবে দেখতে পছন্দ করে। আমরা বাংলাদেশীরা চুতিয়া টাইপের মানুষ, তাই আমরা আমাদের মধ্যে সুপার চুতিয়া টাকে সংসদে পাঠাই। তাকে আমাদের নেতা হিসেবে মানি।",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 49
}