{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p3961n/bnpbal_alliance_is_inevitable_thus_having_bal/",
  "hash": "fd7315380c699e16b173bcd41be814c6",
  "scraped_at": "2025-12-08T17:10:45.181220",
  "title": "BNP-BAL alliance is inevitable. Thus having BAL back is inevitable (Read before you down vote)",
  "description": "Okay so we all know these two have been bitter rivals for decades. But in an ironic sense they cannot live without eachother. They each (sort of) represent the left and right of politics. The reason why I say sort of is because they honestly have the same economic policies and ideas of government with minor differences. Same corrupt practices as well.\nThe biggest similarity between them is that they are established parties who have almost exclusively run the political scene since independence (barring the military dictatorships). All of the political elites are from these parties. It isn't uncommon for these elites to have connections to eachother.\nThe thing they hate more than eachother and the current status quo is anything that disrupts it. BAL and BNP are also considered the \"freedom fighter parties\" cause of their part during '71 so they naturally have issues with Jamaat. BNP (even though they don't fully mention it) believe in secularism just like BAL. Alliances with Jamaat before 2024 were all due to political convenience against BAL.\nNow that BAL is out of the scene, BNP finally has the chance to get back into power. However to beat Jamaat and any of its allies it needs BAL endorsement since they still have a supporting base.\nThis is why I believe there have been talks between top BAL and BNP leaders for support against Jamaat in exchange for the lifting on the ban of the party from following years. Sources? Remember how Mirza Fukrul wanted to let the Awami league to contest in the next elections? Just recently he said that the BNP would not go retaliation against the BAL. If someone needs sources I'll post them down if asked. (There is some speculation and predictions mentioned as well)",
  "votes": "90624",
  "comments": [
    {
      "text": "Mirza Fakhrul was against the ban because he was rightfully concerned that if a political party can be banned by an unelected interim Government BNP might be next. I do not think he feels AL will win an election now, so they are not a concern now.\nPolitical parties exist for one reason: to win elections. What will happen in the future is kind of useless to speculate on",
      "votes": null,
      "replies": [
        {
          "text": "He was concerned about minus two formula",
          "votes": null,
          "replies": []
        },
        {
          "text": "Imo it's not really about BAL having the chance to win. According to recent polling BAL has roughly 5-10% of the future national vote. That 5-10% of the vote might be enough for the BNP to get a majority. Jamaat and BNP are more neck and neck in the polls then you might think.",
          "votes": null,
          "replies": [
            {
              "text": "I don't doubt Jamaat might win, just when Mirza Fakhrul said this he was most afraid of BNP being also banned. It might get BNP some votes, but that was a secondary concern. Of course all is IMHO.",
              "votes": null,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "BNP isnt that smart .",
      "votes": null,
      "replies": []
    },
    {
      "text": "Damn, I sort of agree with the whole thing. I think our best outcome would be a coalition govt, where no one party holds majority on their own.",
      "votes": null,
      "replies": [
        {
          "text": "Agreed but the only realistic parties are Jamaat and BNP. NCP's share is so low that they probably wouldn't be needed to break any tiebreakers. The others are forgettable so barely any support",
          "votes": null,
          "replies": [
            {
              "text": "True, but I hope they also secure a few seats. I do think some of them are genuinely good and their presence is needed for the future of the country.",
              "votes": null,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "It won't be an alliance, more like absorption, which BNP has already started.\nWhat is BAL as a political entity? It was always about the Skeikh family, and without them, the rest of BAL leaders don't look out of place inside BNP. Fair, BNP themselves a family political dynasty, but atleast they didn't have any fascist lords whereas BAL had 2 of them.",
      "votes": null,
      "replies": [
        {
          "text": "Zia started the fascistic settlement operations in the CHT",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "What is the alternative? They are the most popular parties in the broader country. NCP and Jamat only really have support in urban areas (look at any election result from 1991-08) and where those groups are able to rally people. The reason they both have this rural loyalty is due to patronage + relationships/loyalty from the 1970s that is very hard to displace.",
      "votes": null,
      "replies": [
        {
          "text": "The other factor that is helping Jamaat is their religious affiliation. People are getting more religious by the day so they are willing to forget about '71. People are also just sick of the BNP-BAL lead governments. Funnily enough people will probably vote for Jamaat for actual change instead of the same issues (the DUSCU election was partly won because the Chattro Dol was going around asking for extortions exactly like the Chattro Leagues).",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "Tell that to the local BNP leaders who couldn't celebrate Eid in their own homes with their families for 10 years or the ones who's life became living hell cus of mamlabaji. Eto shoja na. Pinaki Elias kom khaan.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Political alliance is not possible. Even mutual understanding seems far fetched with the current heads of parties remaining same.",
      "votes": null,
      "replies": []
    }
  ],
  "id": 57
}