{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p16gnn/%E0%A6%A4%E0%A6%B0%E0%A6%95_%E0%A6%B0%E0%A6%B9%E0%A6%AE%E0%A6%A8%E0%A6%95_%E0%A6%95%E0%A6%9F%E0%A6%95%E0%A6%A4_%E0%A6%85%E0%A6%AD%E0%A6%AF%E0%A6%97_%E0%A6%95%E0%A6%A8%E0%A6%9F%E0%A6%A8%E0%A6%9F_%E0%A6%95%E0%A6%B0%E0%A7%9F%E0%A6%9F%E0%A6%B0%E0%A6%B0_%E0%A6%AC%E0%A6%B0%E0%A6%A6%E0%A6%A7_%E0%A6%AE%E0%A6%AE%E0%A6%B2/",
  "hash": "f8db1f0023b8f4b146bb64e70262ee2b",
  "scraped_at": "2025-12-08T17:11:51.705409",
  "title": "তারেক রহমানকে ‘কটূক্তি’ অভিযোগে কন্টেন্ট ক্রিয়েটরের বিরুদ্ধে মামলা",
  "description": "ঢাকায় বিএনপির ভারপ্রাপ্ত চেয়ারম্যান তারেক রহমানকে নিয়ে ফেসবুকে “কটূক্তি” ও “মানহানিকর” মন্তব্য করার অভিযোগে কন্টেন্ট ক্রিয়েটর শাহিন মাহমুদের বিরুদ্ধে সাইবার সুরক্ষা আইন অনুযায়ী মামলা করার আবেদন হয়েছে।\nমামলাটি দায়ের করেছেন জাতীয়তাবাদী আইনজীবী ফোরামের সহ-সাধারণ সম্পাদক ইলতুৎমিশ সওদাগর। তিনি আবেদনটি বুধবার (১৯ নভেম্বর) ঢাকার সাইবার ট্রাইব্যুনালে জমা দেন, যেখানে আরও একজনকে অজ্ঞাত আসামি হিসেবে অন্তর্ভুক্ত করা হয়েছে। আদালত বাদীর জবানবন্দি রেকর্ড করেছে এবং আদেশের তারিখ অপেক্ষমাণ।\nঅভিযোগ অনুযায়ী, ১২ নভেম্বর একটি ভার্চুয়াল ভাষণে তারেক রহমান মন্তব্য করেন যে “বর্তমান পরিস্থিতিতে গণভোটের চাইতে আলুর ন্যায্য দাম পাওয়া বেশি গুরুত্বপূর্ণ।”\nএর তিন দিন পর, ১৫ নভেম্বর, শাহিন মাহমুদ তার ভেরিফায়েড ফেসবুক আইডিতে লেখেন: “৮৮ কোটি টাকা দিয়ে বুলেট-প্রুফ গাড়ি না কিনে ওই টাকা কৃষকদের দিলে পেঁয়াজ-আলুর ন্যায্য দাম পেত।”\nবাদীর দাবি, এই পোস্ট মিথ্যা, উদ্দেশ্যপ্রণোদিত এবং তারেক রহমানের সম্মান, রাজনৈতিক ভাবমূর্তি ও দেশপ্রেমকে ক্ষুণ্ণ করার উদ্দেশ্যে করা হয়েছে। অভিযোগে আরও বলা হয়েছে যে তারেক রহমান বা বিএনপির পক্ষ থেকে ৮৮ কোটি টাকার কোনো বুলেটপ্রুফ গাড়ি কেনা হয়নি — ফলে শাহিনের মন্তব্য “ভিত্তিহীন ও বিভ্রান্তিকর।”",
  "votes": "37",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Just remembered this tweet:\nOn this World Press Freedom Day, let us unite to champion the independence of the press and the protection of journalists who report on the truth, with ethical integrity.\nJournalists serve as a vital pillar of democracy; their work must be protected and embraced, not attacked or censored. Yet in Bangladesh, we witnessed the systematic erosion of the press freedom under state-sponsored repression by the recently deposed authoritarian regime.\nDuring those dark years, through unwavering courage and commitment, many Bangladeshi journalists shone a light on matters ranging from deep rooted corruption, horrific human rights violations, and socio-economic failures, all by the state. These brave journalists were found across the mainstream and social media, at home and abroad, remaining steadfast in their pursuit of the truth, fighting for a democratic Bangladesh and upholding fundamental values of expression.\nBangladesh Nationalist Party-BNP draws inspiration from a new brand of journalism that upholds the highest standards of ethics and integrity. We respect fearless and objective reporting, even when it may not align with our agenda. We stand firm in our belief that a free and independent media makes or breaks a democracy. Journalism with integrity and objectivity should serve the people above politics.\nIf we are to have a strong and sustainable democracy, journalistic integrity and freedom must be maintained. Let us set aside all differences, to build a Bangladesh where elected, accountable governments ensure the freedom of expression, human rights, and the rule of law for all, including that of the press.\nTweet Link: https://x.com/trahmanbnp/status/1918361234388468023?s=20",
      "votes": "17",
      "replies": []
    },
    {
      "text": "গতবছর হাসিনা পালানোর পরে তারেক রহমানের প্রথম পিআর স্ট্যান্ড ছিলো তারা খুবই ফ্রিডম অব স্পিচের পক্ষে। দেড়টা বছরও পার হয় নাই এখনও",
      "votes": "17",
      "replies": []
    },
    {
      "text": "This is why no one should want this guy to lead... What a thin skinned duffus.",
      "votes": "24",
      "replies": []
    },
    {
      "text": "Sources:\nCourt moved to lodge cyber security case against digital creator over 'defamation' of Tarique Rahman ---tbs\nPhoto from BONGO WIKI",
      "votes": "4",
      "replies": []
    },
    {
      "text": "trailer দিলো। movie নির্বাচনের পরে।",
      "votes": "4",
      "replies": []
    },
    {
      "text": "এটা কি কর্তৃত্ববাদী নয়?",
      "votes": "2",
      "replies": []
    },
    {
      "text": "And they said they want to create amar \"Sonar\" Bangladesh",
      "votes": "2",
      "replies": []
    },
    {
      "text": "in the name of content or freedom of choice no one can't cross limit. Everything has limit. you can't lie in the name of policy or religion ! everything has limit !! stupid should have lesson .",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 61
}