{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p0xefc/how_come_no_one_is_questioning_the_fact_that_he/",
  "hash": "72c98e45f6adc5e70daebbba14b44dd4",
  "scraped_at": "2025-12-08T17:12:38.935066",
  "title": "How come no one is questioning the fact that he is interviewing a convicted criminal who has ran away?",
  "description": "In a saner world police should've asked the channel to reveal his location as they are searching for him for his crimes ?\nP.s. I am just trying to understand how insane politics is...it saves you basically from every crime you have ever committed and you get to give interviews despite your atrocities",
  "votes": "57",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "মাত্র ১ বছরে নাদুসনুদুস কামালের এই অবস্থা হইলে শেখ হাসিনার কি অবস্থা চিন্তা করুন",
      "votes": "32",
      "replies": []
    },
    {
      "text": "bro came straight outta marvel zombies",
      "votes": "33",
      "replies": []
    },
    {
      "text": "Man he looks rough",
      "votes": "10",
      "replies": []
    },
    {
      "text": "কিরে কামাইল্লা, ফেয়ারএন্ডলাভলীর টেকাটুকাও নাই নাকি রে",
      "votes": "14",
      "replies": []
    },
    {
      "text": "We can't expect anything from India tbh as they just want to cause more problems for us.",
      "votes": "33",
      "replies": []
    },
    {
      "text": "",
      "votes": "16",
      "replies": []
    },
    {
      "text": "Because as per international \"expectations,\" everyone has his right to be heard or least defend their case.\nPlease note I said expectations, not reality. As surely, if talibans or other extremist groups give their interview, it won't be promoted by media.",
      "votes": "15",
      "replies": [
        {
          "text": "The Taliban authorities also tied with India and did a few press conferences in India.",
          "votes": "20",
          "replies": [
            {
              "text": "During the Afghanistan war or famous war on terror?",
              "votes": "-1",
              "replies": []
            }
          ]
        },
        {
          "text": "they were told to come in bd and defend themselves with intl lawyers but yhey were sure they were to be hanged",
          "votes": "3",
          "replies": [
            {
              "text": "They are afraid of what will be done to them considering they never had any restraint with Jamaat and BNP.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Are you expecting integrity from the Republic? They are the worst of the worst in terms of Godi media.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Same question with Zakir naik & Ahmed al-sharaa too",
      "votes": "2",
      "replies": []
    },
    {
      "text": "যে হাত দান করে, সে দানগ্রহীতার থেকে উঁচু অবস্থানে থাকে!",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "-20",
      "replies": [
        {
          "text": "Hasina, the protector of the constitution 🤣🤣🤣🤣🤣",
          "votes": "9",
          "replies": []
        },
        {
          "text": "If double standard had a face! This is the same court and rules applied during the so-called war crime tribunal and now it has become a kangaroo court for you just because the tide turned against you, interesting.",
          "votes": "5",
          "replies": []
        },
        {
          "text": "the court that was setup by the dictator hasina herself",
          "votes": "3",
          "replies": [
            {
              "text": "And none has mentioned this",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "sparkle dishwash dia er thobla dhoa dorkar",
      "votes": "1",
      "replies": []
    },
    {
      "text": "MRG is a BJP stooge. He is not a journalist",
      "votes": "1",
      "replies": []
    },
    {
      "text": "It's no surprise their so called media achieved global recognition. Clearly, the concepts of 'scam' and 'fake' are foreign to them.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 64
}