{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p0gzlc/%E0%A6%87%E0%A6%A8%E0%A6%9F%E0%A6%B0%E0%A6%AE_%E0%A6%AE%E0%A6%AF%E0%A6%9C%E0%A6%95/",
  "hash": "32949660936bf7a2908921e55dd86071",
  "scraped_at": "2025-12-08T17:12:57.870516",
  "title": "ইন্টেরিম ম্যাজিক",
  "description": "চট্টগ্রাম বন্দরকে উন্নত, দুর্নীতি প্রতিরোধ এবং আন্তর্জাতিক বাজারে এগিয়ে নিতে লালদিয়া কনটেইনার টার্মিনাল পরিচালনায় ডেনমার্কভিত্তিক এপিএম টার্মিনালসের সাথে চুক্তিবদ্ধ হয়েছে সরকার। কিন্তু এই চুক্তির কার্যক্রম অত্যন্ত দ্রুততার সাথে শেষ করা হয়েছে। শর্তগুলোও প্রকাশ করা হয়নি। এমনকি চুক্তি স্বাক্ষরের দিনও বেছে বেছে আজকেই দেয়া হয়েছে যেদিন পুরো জাতির দৃষ্টি অন্যদিকে। এ যেন জাতির নজর ঘুরিয়ে তলে তলে কাজ সেরে ফেলা হলো! এমনকি সাধারন জনগন এ ব্যাপারে অবগতও নয়। এরকম রাখঢাক করে চুক্তি স্বাক্ষরের উদ্দেশ্য কী হতে পারে?\nসংগৃহীত: https://www.facebook.com/earkidotcom/posts/চট্টগ্রাম-বন্দরকে-উন্নত-দুর্নীতি-প্রতিরোধ-এবং-আন্তর্জাতিক-বাজারে-এগিয়ে-নিতে-লালদ/1176417304624058/",
  "votes": "40",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "এগুলো ডিফেন্ড করবার জন্য জামাত কোন বট আসে নি এখনো যুক্তির ডালা নিয়ে? 🧐🤔",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Meticulous design 🥴",
      "votes": "10",
      "replies": []
    },
    {
      "text": "Right now Bangladesh needs international expertise and investments and port is a right place as this is the economy’s bottleneck.\nI am hoping these port deals will create jobs for a lot of people. These people will become port operation experts and hopefully Bangladeshis will be operating these ports eventually.",
      "votes": "9",
      "replies": [
        {
          "text": "৩৩ বছরের চুক্তির কারিগরি প্রস্তাব মূল্যায়ন হয়েছে ১ দিনে, আর্থিক প্রস্তাব মূল্যায়ন হয়েছে ১ দিনে, এখানে বিদেশী কোম্পানিকে লিজ দেয়ার চেয়ে গুরুতর ব্যাপার হচ্ছে এগুলো, এতবড়ো চুক্তির কাজ এতো তড়িঘড়ি করে এভাবে বাংলাদেশে আগে কখনো হয়েছে বলে আমার জানা নেই।",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "it's time to protest...rajakar are trying to eat the economy of Bangladesh...i know it from the beginning that...kota protest is just a velki.. they try to overthrow the regimen... but i didn't expect that army will betray Bangladesh people 😭😭...no matter how you say we are doomed... there Will be no more freedom..jasi will kill everyone who will want freedom... soon Bangladesh will declare as a terrorist county... although i recently moved to Japan with All my family and asset but it's really makes me cry to see my dearest county fall apart by the hand of ynus ans jasi",
      "votes": "7",
      "replies": []
    },
    {
      "text": "",
      "votes": "4",
      "replies": [
        {
          "text": "I urge you read articles and books instead of screenshots.",
          "votes": "8",
          "replies": [
            {
              "text": "৩৩ বছরের চুক্তির কারিগরি প্রস্তাব মূল্যায়ন হয়েছে ১ দিনে, আর্থিক প্রস্তাব মূল্যায়ন হয়েছে ১ দিনে, এখানে বিদেশী কোম্পানিকে লিজ দেয়ার চেয়ে গুরুতর ব্যাপার হচ্ছে এগুলো, এতবড়ো চুক্তির কাজ এতো তড়িঘড়ি করে এভাবে বাংলাদেশে আগে কখনো হয়েছে বলে আমার জানা নেই, আপনি যেই বই পরে এমন কোনো পূর্বের ঘটনার কথা জেনেছেন তা দয়া করে জানাবেন।",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "নতুন নতুন বিজ্ঞ জ্ঞানী লোকজন এমন সব কথা কয় যে মাথা উল্টাই যায়।\nদুটি টার্মিনাল পরিচালনার দায়িত্বভার দুটি কোম্পানিকে দিয়েছে বাংলাদেশ সরকার৷ র কিছুই না।\nচট্রগ্রাম অন্যান্য দেশে আধুনিক বন্দরে জাহাজ খালাস করতে সর্বোচ্চ সময় লাগে ২৪ ঘন্টা কিন্তু বাংলাদেশে সময় লাগে ৭-৮ দিন। কেন? কেউ কি জিজ্ঞেস করেছে ?",
      "votes": "6",
      "replies": [
        {
          "text": "",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "if leftists criticises something, consider it a good work.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Dhur mia. Ei bolod re koi paisen? Ore bolen porashuna korte ajib pechal baad dia",
      "votes": "1",
      "replies": [
        {
          "text": "এসব বলা ছাড়া যুক্তিযুক্তভাবে তার কথার বিরোধিতা করার মতো কিছু থাকলে বলুন।",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Terminal e ki poriman corruption hoy kono idea ache Meghমলদ্বারের? At least ekhon time and cost save hobe bohut",
      "votes": "-1",
      "replies": [
        {
          "text": "বাংলাদেশে দুর্নীতি হয় না কোন সেক্টরে? এই যুক্তিতে তো তাহলে সবই বিদেশিদের হাতে তুলে দিতে হয়, আর ফ্যাসিস্ট সরকারের আমলে এমন চুক্তিগুলো নিয়েই তো জামাত শিবির রব তুলেছিলো যে দেশ নাকি বিক্রি হয়ে যাচ্ছে, এখন সব হাওয়া? দুর্নীতি যদি সমস্যা হয় তাহলে তার সমাধান দুর্নীতি রোধ করা, ৩৩ বছরের চুক্তি তড়িঘড়ি করে ২দিনে সম্পন্ন করে বিদেশীদের হাতে তুলে দেয়া তার সমাধান নয়।",
          "votes": "1",
          "replies": [
            {
              "text": "নিজেরা মেন্টেইন করতে না পারলে দিনের পর দিন billion dollar লস করে চলতে থাকলে কি লাভ? দেশ এমনেও বদলাবেনা সামনে আবার বিম্পি আসতেসে। তার থেকে এইটাই ভালো। comparatively লস কম",
              "votes": "7",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "নাটক আরো দেখবেন যদি বিম্পি ক্ষমতায় আসে। দেখবেন আজকে ডলার খেয়ে বন্দর বেচা নুনুস সেক্স্যুয়াল জামাতি বামাতিরা, দেশ ভারতের কাছে বিক্রি হয়ে গেল বলে কান্নাকাটি শুরু করবে !",
      "votes": "1",
      "replies": []
    },
    {
      "text": "another day another moldar slop",
      "votes": "0",
      "replies": [
        {
          "text": "এসব বলা ছাড়া যুক্তিযুক্তভাবে তার কথার বিরোধিতা করার মতো কিছু থাকলে বলুন।",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "বাংলাদেশে সবচেয়ে বেশী দূর্নিতী হয় বন্দরে। হাসিনা আগে জাপানকে দিয়ে মাতারবারি বানাচ্ছিল। মূলত ভারতের জন্যে।\nএই বন্দর এবং বন্দর ব্যবস্থাপনা যাচ্ছে ডেনমার্কের এক নামকরা কোম্পানির কাছে।\nএ পদক্ষেপ নিয়ে জল ঘোলা করার কোন কারণ নেই। এটা বাংলাদেশের জন্য বড় পাওয়া। এখানে কিন্তু সরকারের কোন ঋন নেই। মালিকানাও সরকারের। শুধু বন্দর বানাবে এবং পরিচালনা করবে ৩০ বছর। অসাধারন উদ্যোগ এটা।",
      "votes": "-1",
      "replies": [
        {
          "text": "৩৩ বছরের চুক্তির কারিগরি প্রস্তাব মূল্যায়ন হয়েছে ১ দিনে, আর্থিক প্রস্তাব মূল্যায়ন হয়েছে ১ দিনে, এখানে বিদেশী কোম্পানিকে লিজ দেয়ার চেয়ে গুরুতর ব্যাপার হচ্ছে এগুলো, এতবড়ো চুক্তির কাজ এতো তড়িঘড়ি করে এভাবে বাংলাদেশে আগে কখনো হয়েছে বলে আমার জানা নেই।",
          "votes": "4",
          "replies": []
        },
        {
          "text": "আপনাদের মত অবুঝদের কারণেই ওরা এসব করবার সাহস পাচ্ছে। আমাকে এটা বুঝান, যে অনির্বাচিত সরকার এসব সেন্সিটিভ ডিসিশন কিসের ভিত্তিতে নিচ্ছে? তাদের ক্ষমতায় এসে এগুলো নিয়ে কাজ করবার কথা? ব্রেইনটা হাল্কা ইউজ করেন দয়া করে",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Ho megh baam chutia er kase logic shikha lagbe",
      "votes": "1",
      "replies": [
        {
          "text": "এসব বলা ছাড়া যুক্তিযুক্তভাবে তার কথার বিরোধিতা করার মতো কিছু থাকলে বলুন।",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "এগুলো নিয়ে উতলা হওয়ার কিছু নাই। অসাংবিধানিক যে গায়েবী রুলের উপর এত এত অধ্যাদেশ হচ্ছে তার কোনোটাই বৈধতা পাবে না। অরাজনৈতিক সরকারের যে কোন চুক্তি রাজনৈতিক সরকার আসলে টেকে না। তফসিল এর আগে আরও কত কি হবে। মাদ্রাসার পোলাপান ভ্যাসলিন পাছুতে মেখে বল, আ পেশ উ উ উ বা পেশ বু উ উ উ।",
      "votes": "-1",
      "replies": []
    },
    {
      "text": "Bangladeshi politicians including student politicians will always bring up the most irrelevant and useless topics for needless debate.",
      "votes": "-2",
      "replies": [
        {
          "text": "Our beloved meghmollar didn't think hasina govt was facist. Looks like he had revelations recently and starts talking against everything in the govt now",
          "votes": "3",
          "replies": []
        },
        {
          "text": "৩৩ বছরের চুক্তির কারিগরি প্রস্তাব মূল্যায়ন হয়েছে ১ দিনে, আর্থিক প্রস্তাব মূল্যায়ন হয়েছে ১ দিনে, এখানে বিদেশী কোম্পানিকে লিজ দেয়ার চেয়ে গুরুতর ব্যাপার হচ্ছে এগুলো, এতবড়ো চুক্তির কাজ এতো তড়িঘড়ি করে এভাবে বাংলাদেশে আগে কখনো হয়েছে বলে আমার জানা নেই।",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-5",
      "replies": [
        {
          "text": "৩৩ বছরের চুক্তির কারিগরি প্রস্তাব মূল্যায়ন হয়েছে ১ দিনে, আর্থিক প্রস্তাব মূল্যায়ন হয়েছে ১ দিনে, এখানে বিদেশী কোম্পানিকে লিজ দেয়ার চেয়ে গুরুতর ব্যাপার হচ্ছে এগুলো, এতবড়ো চুক্তির কাজ এতো তড়িঘড়ি করে এভাবে বাংলাদেশে আগে কখনো হয়েছে বলে আমার জানা নেই।",
          "votes": "3",
          "replies": []
        },
        {
          "text": "I am not an expert on the port contracts but it makes sense to have an NDA(non disclosure agreement) as it is a business deal and the company and Bangladesh gov are two parties in the port operation contract. NDA is needed otherwise some other countries will ask them to give them similar terms Bangladesh got.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Was meghmollar this active before the current gov? Gum nia kichu bolenai, DU er ashe pashe dealer chacha der nia khub kanna kati korlo kintu oder dayitto newar temon kichu dekhlam na. So I don't care anymore about this guy. But OP seems like the biggest fan. Congrats",
      "votes": "0",
      "replies": [
        {
          "text": "ক নিয়ে কথা বলতে গেলে খ, গ, ঘ... নিয়ে আগে সম্পূরক কথা বলে আসতে হবে এমন গর্ধবের মতো যুক্তি কোথায় পেলেন? আপনি কোনো সমস্যা নিয়ে কথা বলতে গেলে কি প্রথমে দেশের সব সমস্যার তেলাওয়াত করে তারপর কথা বলা শুরু করেন?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "তারে কেউ বল এই নামে এখনো কোনো টার্মিনাল এ নাই। তারা নিজেদের টাকায় ০ থেকে বানাবে তারপর ৩০ বছর নিজেরা অপারেট করবে।",
      "votes": "0",
      "replies": []
    }
  ],
  "id": 65
}