{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pg8mjj/%E0%A6%97%E0%A6%B9%E0%A6%AF%E0%A6%A6%E0%A6%A7_%E0%A6%A4_%E0%A6%B9%E0%A6%B2%E0%A6%A8_%E0%A6%8F%E0%A6%AC%E0%A6%B0_%E0%A6%95_%E0%A6%9C%E0%A6%A4%E0%A6%AF_%E0%A6%B8%E0%A6%B0%E0%A6%95%E0%A6%B0/",
  "hash": "d52c5e6c434d02fe90fca3a3346256a7",
  "scraped_at": "2025-12-08T16:56:48.088576",
  "title": "গৃহযুদ্ধ তো হলোনা এবার কি জাতীয় সরকার ?",
  "description": "আমরা কি জাতীয় সরকার গঠনের দিকে এগোচ্ছি ? যেখানে সব পক্ষ খানিকটা ক্ষমতার ভাগ পাবে ? এই প্রস্তাবে রাজি নয় বলেই কি তারেক জিয়া দেশে আসতে ভয় পাচ্ছেন ?\nঅনেকেই প্রচুর উস্কানি দেওয়া সত্ত্বেও জনগণকে বিভেদ করা যায় নি ,ছোটখাটো মব ছাড়া দীর্ঘস্থায়ী কোন ক্ষতি হচ্ছে না । যে গৃহ যুদ্ধের জুজু গত বছর অনেকেই দেখিয়েছেন জনগণের অসহযোগিতায় তাঁরা এখন গেম প্লান কারেকশন করেছেন বলেই মনে হচ্ছে । এন সি পি কে ও আর গোপালগঞ্জ দখল করার হুমকি দিতে শুনছি না । সব মিলিয়ে মনে হচ্ছে এইবার তাঁরা পর্দার পেছনের গেম বাদ দিয়ে সরাসরি প্রস্তাব প্রকাশ করে দেবেন । শেষ পর্যন্ত তারেক জিয়া কে ও বাধ্য করা হতে পারে জাতীয় সরকারে অংশ নিতে ।\nদীর্ঘ মেয়াদী সরকার পেলেই একটা গোষ্ঠী তাঁদের প্রস্তাবিত ন্যারেটিভ গুলো প্রতিষ্ঠার সুযোগ পাবেন , আওয়ামীলীগ কে নিশ্চিহ্ন করার প্রয়াস পাবেন। ভারত বিরোধিতার জোয়ার তুঙ্গে রাখা যাবে । এই দেশের জনগণ কে আদর্শ গেলানোর চেয়ে গুজব গেলানো অনেক বেশি সহজ আর সময় সাশ্রয়ী উনারা সেই পথে হাঁটার প্রয়োজনেই জাতীয় সরকারের ফাঁদে আমাদের ফেলবেই , তবে বি এন পি এইটার অংশ না হলে সেই সরকার হবে দুর্বল ,অবশ্যই পরিকল্পনাকারী রা দুর্বল সরকার গঠনের রিস্ক নেবে না । সম্ভবত একটা নির্বাচন হবে যদি তারেক জিয়া কে দেশে না ফেরানো যায় আর তিনি ফিরে আসলে আর নির্বাচনের প্রয়োজন পরবে না বলেই মনে হচ্ছে ।\nএই সবটুকুই আমার ধারণা , বসে বসে বিভিন্ন দলের নেতাদের এবং টকশো জীবীদের বিভিন্ন বয়ান দেখে আমার এটুকুই আশঙ্কা হচ্ছে । আপনার কি মনে হয় ?",
  "votes": "11",
  "comments": [
    {
      "text": "কোনো ভাগ বাটোয়ারার নির্বাচনের পর জাতীয় সরকার হলেও অন্তত এই ব্যাপারটা মাথায় রাখতে হবে যাতে যোগ্য লোক ঠিক মন্ত্রণালয়ে বসে। বাংলাদেশের সমস্যা হলো বাংলা বিভাগে পড়া লোককে দায়িত্ব দেয় স্বাস্থ্য মন্ত্রণালয়ে।",
      "votes": "5",
      "replies": []
    },
    {
      "text": "আশংকা অমূলক নয়। তবে সমস্যা একটাই। আমেরিকাতে ক্লিনটন কাল্টের কোন সদস্য প্রেসিডেন্ট হিসাবে না থাকা। থাকলেই এরা ভারতের সাথে একটা যুদ্ধ লাগাইত। সেটা যেহেতু করা সম্ভব হয় নাই, তারা আসলে টাইম কিল করতাছে। জুলাইয়ে যে পরিমাণ ইনভেস্টমেন্ট এই কাল্ট গ্রুপের ছিল সেটা ১টা যুদ্ধ না হলে কোনভাবেই পুষানো যাবে না। তাদের গেইম প্লেনে বাংলাদেশ ১টা গুটি ছিল যাস্ট। এখানে যুদ্ধ লাগলে অস্ত্র বিক্রির অনেক বড় ১টা বাজার তৈরির সম্ভাবনা ছিল। শুধুমাত্র পাকিস্তান দিয়ে কাজ হচ্ছে না। ইউক্রেন যুদ্ধ মোটামুটি থেমে গেছে। অস্ত্র বেচার অপশন কমে যাচ্ছে। এই অঞ্চলে ১টা গ্যাঞ্জাম না বাধাইলে এত অস্ত্র বেচবে কই!",
      "votes": "6",
      "replies": [
        {
          "text": "তাঁদের সাজেশন ও বোধহয় জাতীয় সরকার , ভাবগতিক সেদিকেই মনে হচ্ছে । তবে ভারতের সাথে যুদ্ধ হয়তো এখনি লাগাবে না তবে জুজু আসবেই এই ভয় কিছু অস্ত্র বিক্রি তো হবেই ... সেই সাথে তাঁদের মোক্ষম সময়ের অপেক্ষা ও জাতীয় সরকার দিয়ে পূরণ করা সম্ভব হবে ।",
          "votes": "5",
          "replies": [
            {
              "text": "তবে জল্পাইদের যে পরিমাণ চর্বি জমছে এদের দিয়ে যুদ্ধ করানো টাফ। ভরসা কচিকাচা গুলোই।",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Bad analysis sesher dike. Let me share my point of view.\nJatio shorkar bhalo hobe arekta hasina create hobe na tahole. India will be in friendly terms with BD ghorer pashe juddho korar karon nai. The only reason they don’t wanna give hasina back is to show other country leaders that they can expect support from India in the last moment if they support India. Its a political game, it will never go towards a full blown war lol. They have enough enemies already Paki and China and war with Dhaka is prolly the last thing for India. Same for BD, it will be a bad strategy to go for War with Delhi since we share 80 90% border.\nRegarding US influence behind all this, nah man not everything is being run by US. People in Bangladesh literally wanted a power shift and that has been a while. July was not a planned event, it was a result of long authoritarian regime.",
      "votes": "1",
      "replies": [
        {
          "text": "Jatiyo shorkar is always a bad choice. Just look at Lebanon, nothing ever gets done and every blame gets passed on to a different ministry run by a different religion. Democracy is always better as -if you don't like the current government, vote for another one on the next election.",
          "votes": "3",
          "replies": []
        }
      ]
    }
  ],
  "id": 7
}