{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ozgw3r/indias_response_to_court_verdict/",
  "hash": "5e15f017489dc82019f6b17cea0fdc68",
  "scraped_at": "2025-12-08T17:15:10.360164",
  "title": "India's response to court verdict.",
  "description": null,
  "votes": "127",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "India won't hand her over. Even if they do, not to this government at least. However I wish at least India keeps her mouth fucking shut as to not sour both countries relationship any further",
      "votes": "80",
      "replies": []
    },
    {
      "text": "chatgpt please write a response that says absolutely nothing ...",
      "votes": "57",
      "replies": [
        {
          "text": "Uttor jey diye che, ei onek boro prapti!!",
          "votes": "6",
          "replies": []
        },
        {
          "text": "Exactly they did that may be :D",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "So they said nothing...",
      "votes": "38",
      "replies": [
        {
          "text": "Cz it doesn’t serve them..Hasina serves them..India and selfishness goes well",
          "votes": "18",
          "replies": [
            {
              "text": "Hasina never served India. BNP-Jamat rule hosted north east insurgents like ULFA targeting India. Hasina cleaned up all these mess. Hasina never awarded Padma Bridge project to India,but China. Dhaka metro to China. India pressurized to award the railway orders to India, but most of the orders gone to Indonesia. She pursued a free diplomatic relation. America didnt liked this. Ruppor nuclear plant in support with Russia is a major reason.But non support of Myanmar rebels was icing in cake. Hasina was never pro India, but she ousted all who where against India in her house.Hasina will be protected by India.\nSide note: She bargained and won rail and road transit rights to Nepal and Bhutan for the Kolkata-Agarthala rail connectivity India asked. India awarded excess land to Bangladesh to resolve the enclave border situation.",
              "votes": "9",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "As a close neighbour, India remains committed to the best interests of the people of Bangladesh",
      "votes": "42",
      "replies": [
        {
          "text": "sorry it meant as a close neighbour its committed to ensure the guamara of the interest of people of bangladesh",
          "votes": "16",
          "replies": []
        },
        {
          "text": "lol ya like sure buddy",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "The vaguest answer ever.",
      "votes": "13",
      "replies": []
    },
    {
      "text": "I hope India is pragmatic enough to realise that all this messing around internal affairs of all neighbouring countries isn't worth it. It will be better for both parties if they can just move forward, accept the reality that the Bangladeshi people rejected their little puppet, and deal with whoever comes to power, and not mess with the internal affairs of neighbouring countries. Like China does.\nBut given its track record of emotional, short-term, narrow-vision mindset, I don't have much hope for it.\nSouth Asians are generally emotional creatures. Swift in temper, slow in cunning. However, I think Bangladesh, compared to Pakistan and India, fares a little bit better. Bc it has historically had far fewer resources, and was forced to play smart and pragmatic.",
      "votes": "9",
      "replies": [
        {
          "text": "Wrong ,BNP - Jamat hosted north east insurgents like Ulfa in Bangladesh.Hasina cleaned up those for us.India will be greatful for Hasina to stabilize our north east.Hasina didnt granted any development project to India like Padma bridge or dhaka metro, all gone to China.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Indian chat bots/league bots will be very active all the way to the next election. AL knows their best chance to come back in politics is putting BNP in power. People like SA & AK will do anything to please India. Again, you may not like the truth here but these are facts.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Send that cunt back",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Even the Indians here agree she should be handed over to us.",
      "votes": "3",
      "replies": [
        {
          "text": "Never, Hasina cleaned up ULFA and North east rebels from Bangladesh.We will be always greatful.Apart from that she didnt do any major benefit to India.She granted all developmental projects to China and railway to Indonesia.Even bargained for Nepal and Bhutan rail and road transit rights for Kolakata-Agarthala rail line through Bangaldesh.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "স্টেটমেন্টে হাসিনার সাপোর্ট নিয়ে কিছুই লেখেনাই। গুড ফর ইন্ডিয়া। তারা বুঝে গেছে সম্পর্ক হাসিনার পক্ষ নিয়ে ভালো হবে না। তাই ইগনোর করে গেছে।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "It a good thing that India is sheltering a mass murderer like her. Bangladesh should know who the real enemy is and allow Chinese influence just like all of Indian neighbors did to counter Indian aggression.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "How patronizing, just look at the wording, like they should be in charge",
      "votes": "2",
      "replies": []
    },
    {
      "text": "She will be sent to some white country. May be she is already packing right now.\nNote : I am Indian and we do not want this headache.",
      "votes": "1",
      "replies": [
        {
          "text": "To do that, she will have to acquire an Indian passport. Because her Red coloured Diplomatic passport has been made invalid.",
          "votes": "8",
          "replies": []
        },
        {
          "text": "Depends on which country. Right now, India is the safest for her because India is the country least likely to send her back to BD. Any other western country might cut a deal with Younus in exchange for her and she knows that too.",
          "votes": "4",
          "replies": []
        },
        {
          "text": "Who is we , yourself ?",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Good. Bangladesh people don't hate *andia enough. They are giving the general population more reasons.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Just like hand washing, if they really want to maintain diplomatic relations then they should handover her",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 73
}