{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ozbgdo/sheikh_hasina_sentenced_to_death/",
  "hash": "e15216e71a193fc14723dc1d3271ce5f",
  "scraped_at": "2025-12-08T17:16:37.327078",
  "title": "Sheikh Hasina sentenced to death",
  "description": null,
  "votes": "90625",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "An expedited trial and death sentence makes bold headlines but delivers no lasting accountability. It instead hands Sheikh Hasina exactly what she needs for a lasting asylum claim.\nDoes she deserve this sentence? Absolutely. Does this sentence matter? Absolutely not, it’s a joke. Her trial was a joke. When her own lawyer says she deserves a death sentence, that’s not a fair trial, that’s a mockery of the court system. There’s no point in this other than flashy headlines.\nPeople criticize Shahbag movement for giving her government the power over the courts, well, the new establishment not only didn’t abolish that system, instead they went full on continuing it.",
      "votes": null,
      "replies": []
    },
    {
      "text": "নিজের গড়া ট্রাইবুনালে, নিজেরই কৃতকর্মের ফল পেল মুজিব কন্যা।",
      "votes": "20",
      "replies": []
    },
    {
      "text": "I can't say this sentence is injustice - 2000 death toll is no joke. But Bangladesh will be more chaotic in the coming years for sure. BNP created a mess in their last tenure, This lady had the chance to develop this nation. But she started to make it even messier from the day 1 of her tenure. In the end it's clear that whether it's BAL or BNP, none of them truly ever intended to develop the country.\nAmra bangalirao to ekek jon emotional shit - brain-buddhi kichui use korte jani na, kintu thik e kothay kothay triggered hoi. Ashole Bangladesh er vaggo tai kharap.",
      "votes": "1",
      "replies": [
        {
          "text": "This time BNP will probably win the election but they won't be able to last 4 years, they will be in a situation like BAL.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": null,
      "replies": []
    },
    {
      "text": "Didnt love her country or people + did selfish corruption & selling/golami for a ____stan + mercilessly butchered her countrymen when they rebelled for freedom\nSame like the jamootkhorpakis did '47-'71\nThe cycle will repeat once more. Not even god can break the loop. B*ngali has long stood the antonym of introspection.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "So no chance of extradition anymore??",
      "votes": null,
      "replies": [
        {
          "text": "nah. She's gonna escape like every mass murderer.\nNetanyahu, Bashar Al Asad, Bush, Kissinger.",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "That's a stupid sentence.\nThis will 100% make sure foreign countries will not be sending her back.\nYou could argue with a lifetime jail. But now with this, wherever she goes, she has a defence with human rights.",
      "votes": "1",
      "replies": [
        {
          "text": "She can’t even leave India as no one will take her.\nIndia itself uses capital punishment so that’s not a reason to deny extradition. They won’t send her back period.\nI prefer she be stuck in India.",
          "votes": "1",
          "replies": [
            {
              "text": "I prefer she be stuck in India\nAdd in how humiliated she must be feeling...",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "Firstly, BD doesn't want her back so from that pov it makes perfect sense. And secondly, there are no foreign \"countries\" rather just a single foreign country who matters here and they were never going to extradite her anyway.",
          "votes": null,
          "replies": [
            {
              "text": "Yep, no other place wanted dakini. Even Tulip couldn’t pull strings to get Hasina into the UK lol.",
              "votes": null,
              "replies": []
            }
          ]
        },
        {
          "text": "u r the one who is giving stupid opinion..which country aside india will take her in?",
          "votes": null,
          "replies": []
        },
        {
          "text": "Justice is equal for all. The blood mother of Awamileague who directly orchestrated the murder of 1500+ innocent people just in one month should be judged appropriately. This will be exemplary for any future politicians that they too can be hanged for crimes against humanity.",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "Granny gonna die India, ain't no way she coming back",
      "votes": null,
      "replies": []
    },
    {
      "text": "Alhamdulillah",
      "votes": "43",
      "replies": []
    },
    {
      "text": "Alhamdulillah",
      "votes": null,
      "replies": []
    },
    {
      "text": "Right.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Alhamdulillah good",
      "votes": null,
      "replies": []
    },
    {
      "text": "Unprecedented event in both political and judicial history of Bangladesh. 17Nov2025, 5 times prime minister Sheikh Hasina has been sentenced to death. This will remind every future leaders YOU ARE NOT UNTOUCHABLE!",
      "votes": null,
      "replies": []
    },
    {
      "text": "ফৌজদারী কার্যবিধি ৩৮২ ধারা অনুযায়ী, স্ত্রীলোকের মৃ′ত্যু′দ′ণ্ড স্থগিত হতে পারে, যদি সে গর্ভবতী হয়।\nমোদিই ভরসা।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "The poetic justice",
      "votes": "3",
      "replies": []
    },
    {
      "text": "joomat and other izlamists will pay for this. secularists will rise and slay you izlamists soon (w/o violence and peacefully ofc)",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Death Sentence? She deserves a paragraph",
      "votes": null,
      "replies": []
    },
    {
      "text": "Alhamdulillah",
      "votes": null,
      "replies": []
    },
    {
      "text": "Don't support death penalty for ethical reasons. But for her, bring it on",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Morally yes she deserves it, but this decision just continues the cycle of retaliatory politics in the country.",
      "votes": null,
      "replies": []
    },
    {
      "text": "The verdict has been confirmed by multiple international sources including BBC, Reuters, and Al Jazeera. The International Crimes Tribunal sentenced her to death for crimes against humanity related to the 2024 student protests. This is a significant legal development in Bangladesh's political landscape.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Here is the fact - She is 78, and in next election she/her party wont be able to join. Someone will win, but BAL doesnt have enough young people to rule the streets (as they used to do in the past), they are broken. Fast forward 5 years, she will be 83, and all the senior BAL politicians will be too old even to get out of the home. Within next 2 years she will be acting just like a mad person. We all have seen how politicians act when they cross 80. Even if she doesnt get hanged, her time is up. And that concludes the fate of BAL. She herself destroyed the party by not raising a proper next leader for the party. Good luck whoever is still hoarding for her.",
      "votes": "9",
      "replies": []
    },
    {
      "text": "Kinda dumb considering you can't extradite her or even get her in another country.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Alhamdulillah. আমি চাই অতিশীঘ্রই এই জানোয়ারের ফাঁসি কার্যকর হোক। বাংলাদেশ জিন্দাবাদ 🇧🇩",
      "votes": null,
      "replies": []
    }
  ],
  "id": 78
}