{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oyob7c/does_it_matter_if_tomorrow_hasina_gets_death/",
  "hash": "7871d805f8a62ba96cfeb3fed856b19f",
  "scraped_at": "2025-12-08T17:18:02.298534",
  "title": "Does it matter if tomorrow hasina gets death penalty tomorrow?",
  "description": "I mean she isn't in Bangladesh...she is living lavishly along with all those corrupt politicians? Is this verdict going to affect any of their lifestyle in any way?",
  "votes": "45",
  "comments": [
    {
      "text": "It doesn’t. 🙄 what if she was in Bangladesh and after the sentencing she was hanged in Shahbagh? It still wouldn’t matter. Jamaat leaders were hanged. Did it matter? They are enjoying the utmost state power without even winning any election. Things don't function as normally as they should in Bangladesh.",
      "votes": "21",
      "replies": []
    },
    {
      "text": "It never has, it never will. XD",
      "votes": "11",
      "replies": []
    },
    {
      "text": "It does matter even if Hasina stays in exile. This is a symbolic victory for the nation - a corrupt dictator sentenced for her atrocious crimes against humanity while they are too cowardly to even defend themselves.\nThis is a major blow to Awami League who has lost a symbol in Hasina and possibly even in Bongobondhu. Campaigning will be 10x harder without an anchor like that. Think about it, what is BAL without Hasina and her father. Nothing. They don’t offer a distinct ideology, a differentiated form of governance or a special track record compared to their counterparts. It has always been about their symbols.\nIn the past we’ve had dictators like Ershad. Look at what happened to his party after his downfall, a bare husk of its former self. BAL is in danger of going down the same path. Specially with this judgement hitting another blow to their reputation.",
      "votes": "19",
      "replies": [
        {
          "text": "I don’t think AL would end up like JP despite having a leadership problem when the Sheikh family is done. They’re a very large party, that is also the oldest and was key in 1971. They can milk those facts. JP on the other hand was founded during Ershad’s unpopular regime and is much smaller in size and relevance. AL will end up like BNP though (as in BNP during the last 15 years as an opposition).",
          "votes": "2",
          "replies": []
        },
        {
          "text": "While there are some merits to this argument, giving death penalty to Hasina will only make her a martyr, especially in the eyes of the people who support AL, who are in substantive numbers but laying low for now. I'm not arguing whether it is just or unjust that she deserves the death penalty. That's a different question altogether.",
          "votes": "-2",
          "replies": [
            {
              "text": "She is a fugitive. And she will never come back to Bangladesh. Her verdict will be symbolic, so the death penalty is the perfect verdict for a fugitive mass-murderer. If she had been arrested, then not giving the death penalty would have been better. But since she is fleeing justice, a death sentence is the perfect verdict.",
              "votes": "6",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Did she get a fair trial?",
      "votes": "19",
      "replies": [
        {
          "text": "It may be a just sentence but I am not sure the Bangladesh legal system is capable of undertaking fair trials for complex cases",
          "votes": "12",
          "replies": []
        },
        {
          "text": "I mean, if the overwhelming evidence that is already in public doesn't convince you, then how else can you be convinced. Any jury in any country can be suspicious to anyone.",
          "votes": "9",
          "replies": []
        },
        {
          "text": "Was she fair to Bangladeshi citizens? The answer is NO!",
          "votes": "1",
          "replies": [
            {
              "text": "Ya but if you wanna judge someone, you gotta act better than them. Otherwise on what basis are you judging them from?",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "She did.",
          "votes": "-3",
          "replies": [
            {
              "text": "Don't know why are you getting downvoted. Eishob hasina premik dekhle bujha jai beissha er dol bhora ei subreddit e.",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "You aren't kidding, right?",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "Even a thousand death penalties are less for her, for what she did...",
      "votes": "3",
      "replies": []
    },
    {
      "text": "It matters a lot, but not directly. Politically the effect is unprecedented.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "It matters, it will make this government illegitimate.She couldn't even get the chance to defend her. Before that the entire judicial system was shaked up.",
      "votes": "5",
      "replies": [
        {
          "text": "She had every chance Now its about to be written in stone.\nAfter this the next target will be those that participate in all the BAL wrongdoings, people are patiently waiting for a political government to take stage and then the real revenge will begin.",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "Should be a big number even if it's symbolic, 2100 years of imprisonment. The entire world should know.",
      "votes": "1",
      "replies": [
        {
          "text": "why does your tag say EEE? I'm curious coz I'm currently majoring in that subject",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "No, unless we can exchange her for the existing illegal Indian immigrants in Bangladesh",
      "votes": "0",
      "replies": []
    },
    {
      "text": "If BNP comes next will they hang hasina? Not sure Lol. So yeah.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Nope",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Regardless of whether it makes a difference now or not she won’t ever be able to return to her “homeland” and so this is a show of force.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 83
}