{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oyeccg/no_cap/",
  "hash": "61034f455897bc8d42e70f66c91fcc05",
  "scraped_at": "2025-12-08T17:18:39.511604",
  "title": "No Cap😭",
  "description": null,
  "votes": "167",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Dude, none of her elections had BNP and other major parties participating. Why does she think she has the right to say this?",
      "votes": "134",
      "replies": [
        {
          "text": "The word 'shameless' is too inadequate to contain her.",
          "votes": "41",
          "replies": []
        },
        {
          "text": "BNP boycotted themselves. They were not banned.",
          "votes": "3",
          "replies": [
            {
              "text": "Dude, that's cause the way she held elections were a farce. Her \"opposition\" was JP. She took off certain candidates in select constituencies to allow them to get MPs in . Some of the \"opposition\" were also literally AL independent candidates. She also tried to get Jamaat banned. Let's not act like she was a champion of the democratic process",
              "votes": "4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Oh now this piece of shit cares about democracy all of a sudden",
      "votes": "28",
      "replies": []
    },
    {
      "text": "হাতি গর্তে পড়লে Inclusive নির্বাচন চায়",
      "votes": "33",
      "replies": []
    },
    {
      "text": "At this point BAL should just participate in Indian elections. I mean their top mofos are already there.\nI really wish India did declassified documents, so that we can know how much of Indian asset Hasina was, from her taking shelter there in the 70s to her getting kicked out.",
      "votes": "60",
      "replies": [
        {
          "text": "that will never happen not even if congress comes to power, remind u, BDR massacre happened during the Congress administration.",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "this woman is dangerous for the Nation.she can do anything for her power.",
      "votes": "63",
      "replies": []
    },
    {
      "text": "She can s*ck off Modiji all she wants, but the politics of Bangladesh will be decided by Bangladeshis. No place for mass murdering psychopanth blood mother of Amlik.",
      "votes": "32",
      "replies": []
    },
    {
      "text": "Irony",
      "votes": "12",
      "replies": []
    },
    {
      "text": "So India doesn’t consider the elections held under your government to be legitimate?",
      "votes": "10",
      "replies": []
    },
    {
      "text": "India is not Democratic apa",
      "votes": "23",
      "replies": [
        {
          "text": "It is. It's just that their people are fucking stupid. Democracy is dangerous for stupid people.",
          "votes": "16",
          "replies": [
            {
              "text": "I know it is blud. But apa jeita bujhaite chaitese oita to na. Under Modi India isn't, they(Bjp) are systematically designing the dictatorship through people from early 2000s",
              "votes": "10",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "dakini should do an election in India for her followers. Since India already lets her get away with anything, Modiji should approve this too",
      "votes": "17",
      "replies": []
    },
    {
      "text": "Bro she thinks glazing India gonna help her 😭 that shit got her in this situation in the first place",
      "votes": "8",
      "replies": []
    },
    {
      "text": "This bitch is a psychopath",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Didn't she do the same?. Nature's revenge is poetic justice.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "But she does consider 2024 election as legitimate.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Our former prime minister shekih hasina is a certified psychopath. It's the fiend itself within her, a pathological liar who's unable to differentiate reality and imagination. She's still the prime minister in her head unfortunately. Today justice has been served. Sheikh hasina is \"GUILTY\". Now she's punished to death ordered by the tribunal. The question remains, when are we actually gonna witnesse this, the daughter of our father of the nation is being hanged to death for killing the voices her father fought for who also became a dictator later on ? Poetic justice that's what they call , right !! As long as she's the chief of BAL , they got no right to take part in the upcoming election. But there's another opinion going on that, without the participation of the major political parties, it's quite a bit critical to call it a fair election. Awami league should reform and then consider coming back again. Because every member of that party is killers and must be punished. But if they can reform, i think they have a right to do so.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "She missed the Bihar election, but she can still take part in the Tamil Nadu Legislative Assembly election coming up in April-May 2026.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "The lion, the witch and the audacity of this bitch!",
      "votes": "2",
      "replies": []
    },
    {
      "text": "is the nazi party allowed in elections anymore?",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Shit man, she should tell Germany to let Nazi sit for election. Let's see how many people would agree then.\nAlso kinda ironic she the daughter of the guy who banned all other parties cause he wanted one party state is saying all these.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "She can simply come back to Bangladesh and face justice. If she is innocent then she can participate in the election. Seems simple enough.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Why do we have to follow India like they're the saints of this Asian region. The demographically difference is visible man !",
      "votes": "2",
      "replies": []
    },
    {
      "text": "apa apni onek cute. ashar shomoy soan papri anben.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Where was India during past 17 years and those puppet elections? If they are so civil, so mannered then why do they congratulate you! Sheltred you after doing so much crimes. Hypocrites. India is not the largest democracy, it is the largest hypocrite.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "-15",
      "replies": [
        {
          "text": "How many killings would make you understand that they are not a political party?!",
          "votes": "18",
          "replies": []
        },
        {
          "text": "Awamileague is a cult with Hasina at its head. Maybe once it was a party of the people but after 2006 it was nothing more than a cult.",
          "votes": "12",
          "replies": []
        },
        {
          "text": "u sick or what?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-12",
      "replies": []
    }
  ],
  "id": 85
}