{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oxqjxw/how_yunus_deceived_bnp_at_the_last_minute/",
  "hash": "f67a6a46129d7ffbcef56c12d2add5f0",
  "scraped_at": "2025-12-08T17:19:15.863998",
  "title": "How Yunus Deceived BNP at the Last Minute",
  "description": "I think you all know that the Interim Government has finalized the referendum date and its question. However, some of you may not realize that they played dirty with the BNP at the last minute. Let me explain how.\nThe BNP submitted a note of dissent on many of the proposals recommended by the Consensus Commission. The IG and the Commission were not satisfied with the outcome. That's why they initially tried to ignore the BNP's note of dissent by not incorporating it into the July Charter, but they were forced to do so when the BNP stated they would not sign it otherwise. Then they attempted to disregard the BNP's note of dissent again by framing the referendum question in such a way that the reforms desired by the IG, the Consensus Commission, and most parties would have a higher chance of receiving a YES vote. Just look at the options if you don't believe me.",
  "votes": "33",
  "comments": [
    {
      "text": "এরা চারটা প্রশ্নের উত্তর জনগণের নিকট একটা শব্দ চাইছে। তার উপরে সংবিধানের যে 30 টি সংশোধনী প্রস্তাব করা হয়েছে- সেটাও কিন্তু ৩০+ ভিন্ন ভিন্ন প্রশ্নে গণভোটের সময় উল্লেখ করা হবে না। গ নাম্বার প্রশ্নটি পড়ুন। \"এগুলো সহ বাকি ৩০টি\" !!! এটার মানে কি? আমি কোন কোন সংশোধনীর জন্য হ্যাঁ বা না ভোট দিব -- সেটাও জানতে পারবো না স্পষ্ট ভাবে!",
      "votes": "16",
      "replies": [
        {
          "text": "If all 30 parties have indeed come to a consensus on those 30 issues, as they claim, then I don't see any problem with the third option.",
          "votes": "-3",
          "replies": [
            {
              "text": "যদি পলিটিক্যাল পার্টির আন্ডারস্ট্যান্ডিং সবকিছু হয় তাহলে গণভোটের প্রয়োজন কি? গণভোট যেহেতু হচ্ছে - যে জনতা ভোট দিবে তাদের কি জানা উচিত না, কোন কোন বিষয় সংশোধন হচ্ছে? দ্বিতীয়ত 'Note of Decent' বিষয়টা তো এখানে নেই। পলিটিক্যাল পার্টিরা সব বিষয়ে একমত হয়নি",
              "votes": "9",
              "replies": []
            },
            {
              "text": "সমঝোতাতে না আসলে সনদ কেন সই করল? সই তো করেছে।",
              "votes": "-4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "The future of our country should not be left in the hands of these power hungry political parties. We don't trust them to do the right thing.\nWhy so much emphasis on BNP dissent? Other parties have their notes of dissent too. Don't those matter? BNP has been disagreeing on every point of real reform. The concensus commission could have finished the job in 3 months if not for BNP slowing everything down.\nThe final decision should be upto the voters.",
      "votes": "19",
      "replies": [
        {
          "text": "They certainly do, but other parties are mostly not against a lot of the fundamental reforms because they will not be coming to power in the next election. That's why it's easy for them to agree.\nNo, the final decision will be made by the party that comes to power. The decision before that will be made by the voters.",
          "votes": "5",
          "replies": []
        },
        {
          "text": "Do you really think Morjina Begum from Koyra Upazila can read these questions, understand them, and cast an informed vote? If not, then there’s no meaning to this circus. Even I’m having a hard time reading these questions.",
          "votes": "16",
          "replies": [
            {
              "text": null,
              "votes": "1",
              "replies": []
            },
            {
              "text": "I dont think we can deny the right to vote to the uneducated.\nDo you prefer Morjina should be disqualified from all voting?",
              "votes": "1",
              "replies": []
            },
            {
              "text": "How many well-informed voters do you think are in Bangladesh?",
              "votes": "-1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Yunus and BNP are not in a marriage relationship. So don't say that Yunus cheated.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Upperhouse will be represented via Proportion vote? This might become a bad move, if political parties have a sole mindset of sabotaging each others policies...\nWill there be a copy of July Charter policies beforehand for public?",
      "votes": "3",
      "replies": [
        {
          "text": "Most of the bills are financial in parliament, and the upper house will have no say on those bills. The proposed upper house also does not have any say on no-confidence votes. It's main job is to make it difficult to change the constitution. That's it.",
          "votes": "3",
          "replies": [
            {
              "text": "The upperhouse representatives need to be more open-minded instead of having the usual sabotage other parties policies by hook and crook. If they can, then I see a positive change in parliament...",
              "votes": "2",
              "replies": []
            },
            {
              "text": "Ah so unelectable people who will buy the seats from parties will have a say how constitutional amendments will be. so the likes of chormonai pir and his friends who cant win a seat in lower house will have a say how the consitution will be.\nNice. Such a good reform.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "BNP is too anti reform, cause they know they can’t cheat us again if the constitution is updated.",
      "votes": "-1",
      "replies": [
        {
          "text": "The problem with these reforms is that the constitution itself is very weak to begin with. It’s why it’s been changed so many times by various actors to benefit themselves. This is just another shortsighted bandaid on the constitution.\nReal reforms require a new stronger constitution that establishes safeguards for institutions. This alone will not prevent abuse of power, but it can help stand as a bulwark against abuse. The second component is mentality. Society, politicians, and civil servants need to understand and believe in the concept of a “greater good” and not selfish gain.",
          "votes": "5",
          "replies": [
            {
              "text": "what do you mean? are we not discussing the reforming of the constitution here?\nwhy is ‘real reforms’ dependent on ‘stronger’ constitution? the whole point of a reform is to make the constitution ‘strong’.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "ডঃ ইউনূস জনগনের পক্ষ নিয়েছে। জনগনের ভোট নতুন কিছু নীতিমালা প্রণয়ন হবে। এই নীতিমালাগুলো বাংলাদেশের জন্যে জরুরী। ভবিষ্যত বাংলাদেশের জন্যে জরুরী। বিএনপির উপর আস্তা রাখতে পারছে না এই সরকার। এটা অস্বাভাবিক না।\nউচ্চকক্ষের ১০০ জন কেন দরকার বুঝলাম না। ২১ জন বা ২৫ জন হলেই হত। এখন ১০০ জনকে সরকারের টাকাতে পুশতে হবে। শুধু কি সংবিধান সংশোধনকে সর্বজনিন করতে উচ্চকক্ষ? যদি তাই হয় তাহলে এটা চরম অপচয়।\nলীগের জ্বালা হচ্ছে জুলাই সনদ যদি বাস্তবায়নে মানুষ বাধিত হয় তাহলে লীগ আগামী ২০ বছর বাংলাদেশে রাজনীতিতে ফিরতে পারবে না।",
      "votes": "-4",
      "replies": []
    },
    {
      "text": "",
      "votes": "-14",
      "replies": []
    },
    {
      "text": "idgaf about BNP. I will give vote what I wish for and majority will decide the future outcome. BNP can go fuck themselves.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 87
}