{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oxkatt/how_the_election_manifesto_looks_like_for/",
  "hash": "43e845df4cdf64c5abac7866cebbc873",
  "scraped_at": "2025-12-08T17:20:09.749788",
  "title": "How the election manifesto looks like for different parties?",
  "description": "Now that BNP, NCP and Jamaat have all unveiled their manifestos and wow, what a buffet of dreams. I wonder why no one is questioning them already !!\nIf ambition alone built hospitals, Bangladesh would have Swiss-level healthcare by now.\nBNP waves around 5% of GDP for health and education like a magic coupon, with zero explanation of where the cash comes from. Maybe they’ve discovered a secret money tree? The “health card for all” sounds nice—if printers, doctors and budgets fall from the sky.\nNCP goes full sci-fi: new constitution, digital hospitals, village parliaments, STEM revolution—basically a Scandinavian welfare state delivered overnight by vibes. Minor detail: they forgot to mention how any of it happens, unless Elon Musk is secretly joining their cabinet.\nJamaat, meanwhile, skips the messy stuff like funding health or hiring teachers and goes straight to moral engineering. Great—because what Bangladesh really needs in rural clinics is “moral reform,” not doctors, medicine, or electricity.\nHowever the promises are huge, the math is invisible, and the realism is on life support. All three parties want us to believe in miracles, just don’t ask them silly questions like “how,” “who,” or “with what money.”\nI am not a political analyst, tried to google around and took help from chat gpt to find their manifestos, please correct me if I said something wrong. I just think political parties should be accountable about what they promise and what they deliver.",
  "votes": "13",
  "comments": [
    {
      "text": "Because mass people want to dream. And anyone talking sense won't get votes",
      "votes": "13",
      "replies": [
        {
          "text": "Hmm so we want to dream but dont care if the dream is realized or not.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Except for the BNP, it seems none of the parties bothered to use even a fraction of serious thinking when drafting their manifestos. Even the BNP’s manifesto is riddled with major weaknesses, just as your analysis showed. Frankly, it looks like all of them assume the next election will be nothing more than ason vagabagi, so they see no point in putting in real effort.",
      "votes": "7",
      "replies": [
        {
          "text": "Correct. May be in Bangladesh, we dont really care what they promise and what they do!! We just care if our favorite party is in power or not. IMO this mentality should be changed.",
          "votes": "3",
          "replies": [
            {
              "text": "I dont know about you. I have lost all hopes for this country. Its cursed.",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "In Bangladesh, you need to pay attention to what politicians say rather than what is written in manifestos. So far, I have not seen any party talk much about how they are going to fix the economy, ease the cost of living crisis, fix unemployment crisis etc. All they talk about is liberation war, July Charter and stuff like that, which aren't things that ordinary voters think about often.",
      "votes": "4",
      "replies": [
        {
          "text": "Thats the thing. They do not talk about things that they should be talking.\nI saw few talk shows and they only talk about July Charter, Constitution reform that I believe majority of Bangladeshi people do not care. ( or may be they do, I just dont).\nI dont see anyone saying anything about general health, improving road condition, shorter travel time to work, creating new jobs......",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Did you just copy the manifestos and then asked ChatGPT to make a Reddit style post criticizing them?",
      "votes": "5",
      "replies": [
        {
          "text": "haa haaaa, good catch buddy.\nI asked gpt to find out the manifestos and criticize it.",
          "votes": "1",
          "replies": [
            {
              "text": "Now copy your post and ask gpt to make a reply against the post. Let us know what gpt says.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Voting parties on the basis of manifesto is a mistake in Bangladesh. Historically they never fulfilled those promises. I’d vote for a candidate who is comparatively competent and honest in my constituency.",
      "votes": "0",
      "replies": [
        {
          "text": "Good luck finding someone comparatively honest.",
          "votes": "3",
          "replies": [
            {
              "text": "I didn't say \"honest\", I said \"comparatively honest\".",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Meh...gonna vote for BNP, who cares whatever is in the useless manifesto.... they know how to run a government, they also have ideas on how to create a dictatorship....we badly need a new dictator who can beat the shit out of the little shits...BNP seems really promising in that regards",
      "votes": "1",
      "replies": [
        {
          "text": "who can beat the shit out of the little shits - haa haaa.\nwell said.",
          "votes": "2",
          "replies": []
        }
      ]
    }
  ],
  "id": 90
}