{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ouxmly/%E0%A6%B2%E0%A6%97%E0%A6%B0_%E0%A6%A8%E0%A6%B6%E0%A6%95%E0%A6%A4/",
  "hash": "f0ed15e16b14eada99219b77e22118a3",
  "scraped_at": "2025-12-08T17:22:29.709302",
  "title": "লীগের নাশকতা",
  "description": null,
  "votes": "166",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "62",
      "replies": []
    },
    {
      "text": "BALলীগ রে দেখতে পাইলেই জয় বাংলা করে দেবো। সবাই নিজ নিজ এলাকায় প্রস্তুত থাকুন",
      "votes": "36",
      "replies": [
        {
          "text": "লুঙ্গির তলে লুকিয়ে থাকো",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "লীগের পুরানো অভ্যাস এইটা।",
      "votes": "47",
      "replies": []
    },
    {
      "text": "Ei sub er shobai now be like amra ekhn shobai ondho.....madrashar hujur kisu korle amra chokh khulbo",
      "votes": "61",
      "replies": [
        {
          "text": "Iam surprised",
          "votes": "13",
          "replies": [
            {
              "text": "Iam surprised",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "True",
          "votes": "16",
          "replies": []
        }
      ]
    },
    {
      "text": "Interim কে অথর্ব মনে হয়। এখন উচিত ১৩ তারিখে পাবলিক নিয়ে লীগের উপর পালটা আক্রমণ করে উচিত শিক্ষা দেয়া।",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Now BAL bot here gonna put all the blame on the opposition and prove their party is like a flower.",
      "votes": "42",
      "replies": []
    },
    {
      "text": "লীগ যতবার ক্ষমতার বাইরে ছিলো। ততোবারই বাংলাদেশের মানুষকে শান্তিতে থাকতে দেয় নাই। এদের বিচারের আওতায় না আনা হলে দেশে শান্তি আসবে না। ওদিকে ভারত মিলিটারী অপারেশন চালানোর প্রস্তুতি নেয়া শুরু করছে। বিএনপি আছে আওয়ামী লীগ রে ফিরে আনার ধান্দায়। পুরা দেশ।একটা হ য ব ড় ল অবস্থা। দূর্বল ইউনুসের জন্য সবাইকে বিপদে পরতে হবে।",
      "votes": "20",
      "replies": [
        {
          "text": "bhai khomotay thekeo shanti dae nai and khomotar baire thakle to moteo dey nai. Kukur oder cheeo 100 times unnoto prani.",
          "votes": "5",
          "replies": [
            {
              "text": "লীগের কাজই হচ্ছে ভারতের দালালী করা। এরা বাংলাদেশ রাষ্ট্রের সম্পদ ছাড়া আর কিছু চায় না। আমরা অশিক্ষিত জাতি হওয়ায় এরা সুবিধা পেয়ে গেছে। শ্রীলংকার কথা চিন্তা করেন। এক বছরের মধ্যেই দেশ অর্থনৈতিক ও সামাজিক নিরাপত্তা নিশ্চিত করে ফেলেছে। ওদের জনগণ শিক্ষিত হওয়ায় রাজনৈতিক দল ধান্দা করার সুযোগ পায়নি।",
              "votes": "7",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Awami and randian bots can suck my dick and choke on it. These mfs will do anything to suck UpTo their literal sugermommy and daddies. Bunch of losers. When the literal awami leader called for these kinds of terrorism, how can you say that it might be the opposition. Dumbfucking retards.",
      "votes": "27",
      "replies": []
    },
    {
      "text": "Lmfao, Awami fans fighting for their dakini apa in comments already",
      "votes": "24",
      "replies": []
    },
    {
      "text": "সাধারণ জিজ্ঞাসা: নাশকতার দায়ে নির্বাচন পিছালে কার লাভ?",
      "votes": "11",
      "replies": [
        {
          "text": "NCP r JAMAAT er",
          "votes": "7",
          "replies": []
        },
        {
          "text": "Hasina",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "ete amar indian proxy bahinir kono hat nai. Ami nirdosh 😇 chormonai molla bolese ami valo muslim o pir bonsho. Love and peace.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Sub be like : Ekhon chokh bondho ache, Hujur kichu korlei shobai jhapiye porbo",
      "votes": "7",
      "replies": []
    },
    {
      "text": "আসল প্রশ্ন হল, নির্বাচন না এসব করে দেশের নাম খারাপ করে কার লাভ? নির্বাচন আজ হোক আর কাল হবেই। কিন্তু যারা বর্তমানে দেশে রাজনীতি করছে ও ক্ষমতায় আছে তাদের এসব নাশকতা করে কোন লাভ নাই। লাভ আছে আওয়ামী লীগের। তারা ক্ষমতা হারিয়ে এখন যেভাবেই হোক দেশে অস্থিরতা তৈরি করে নিজেদের ক্রেডিবিলিটি প্রমাণ করতে মরিয়া হয়ে আছে। রেডিটে যতই এই লীগের বটগুলো যতই পকপক করুক, সক্ষমতা এদের শুধু নাশকতা করা আর প্রোপাগান্ডা ছড়ানো পর্যন্তই।",
      "votes": "4",
      "replies": []
    },
    {
      "text": "এগুলা ভারতের prescription। উরা হয়তো শেখ হাসিনাকে বুঝায়ইছে যে, lockdown ডাক দিয়ে একটা অরাজকতা সৃষ্টি করুন আর আমরা আমাদের গোদি মিডিয়া দিয়ে এটাকে অন্যভাবে বিশ্ব মঞ্চে প্রকাশ করি। যাতে দুনিয়ার মানুষ বুঝে দেশের মানুষ এখনো শেখ হাসিনাকে চায়। এটাই আর কিছু না। দিল্লিতে যে এট্যাকটা হইলো, ঐটা না হইলে এতোদিনে দেখতেন বিভাবে প্রপাগান্ডা ছড়াইতো।",
      "votes": "2",
      "replies": [
        {
          "text": "Delhi blast ta out of syllabus a silo I guess. Sob attention ekn oikhane 😂😂",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-9",
      "replies": [
        {
          "text": "My awami fanatic relatives are literally openly admitting that it's them who are doing this.",
          "votes": "30",
          "replies": []
        },
        {
          "text": "Present govt. Has zero reason to do this tbh making things unstable. Use your brain ffs 🤦",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "রাষ্ট্রীয় বাহিনী দিয়ে আগুন লাগিয়ে বিরোধীদলের নামে চালানোর রাজনীতি বাংলাদেশে অনেক আগে থেকে চলমান। ক্ষতিটা হয় মূলত জনগণেরই।\nপ্রেস সচিব বক্তব্য দিচ্ছেন - আওয়ামিলীগের কোন বেইল নাই, সব পালিয়ে গেছে। আমার প্রশ্ন হলো সরকার আত্নগোপনে থাকা আওয়ামী লীগকে এতো ভয় পাচ্ছে কেনো?\nবেশিরভাগ লীগের নেতাকর্মীরা দেশের বাহিরে চলে গেছে।",
      "votes": "-2",
      "replies": []
    },
    {
      "text": "well well well",
      "votes": "1",
      "replies": []
    },
    {
      "text": "আওয়ামী লীগ ও কি নির্বাচন পেছাতে চাচ্ছে?",
      "votes": "-1",
      "replies": [
        {
          "text": "আগামীকাল হাসিনার রায় দিবে, তাই নাশকতা করছে।",
          "votes": "12",
          "replies": []
        }
      ]
    },
    {
      "text": "নির্বাচন তো বিম্পি ছাড়া কেউই চায় না। তো আগুন লীগ লাগাইসে নাকি শাপলা কলির দল লাগাইছে কেম্নে বুঝলেন? তাদের তো লুঙ্গির তলে থাকার দীর্ঘদিনের অভ্যেস",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "-5",
      "replies": [
        {
          "text": "Revenge nitese. Nijera desh khaite na parle kawke deshe shantite thakte dibena",
          "votes": "16",
          "replies": []
        }
      ]
    }
  ],
  "id": 98
}