{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ph6nsh/dear_athiests/",
  "hash": "f3c946e8ed04b30e41b36f8af8769e1e",
  "scraped_at": "2025-12-08T19:25:20.595944",
  "title": "dear athiests",
  "description": "are you safe in bangladesh and why did you became one (safe space)",
  "votes": "4",
  "comments": [
    {
      "text": "an infinitely kind god sure has a lot of conditions to not get tortured for eternity",
      "votes": "12",
      "replies": [
        {
          "text": "God can still exist without being infinitely kind though.",
          "votes": "-3",
          "replies": [
            {
              "text": "thats true. i should've clarified that i made that comment based on my experience with islam. the religion i grew up with. if god does exist, i'll have an easier time believing them to be apathetic towards us and our actions.",
              "votes": "8",
              "replies": []
            }
          ]
        },
        {
          "text": "why do you assume god is entitled to make your life easier though? You are not special, everyone is burning and becoming ash in someways, then they are rising up like a phoenix.",
          "votes": "-4",
          "replies": [
            {
              "text": "You can't create something that has the ability to both experience and inflict suffering and then claim you are both omnipotent and omnibenevolent.\nBut then again you don't have to believe God is either of those. But most people do believe God is both omnipotent and omnibenevolent and will consider you an atheist if you deny any of those beliefs.",
              "votes": "5",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "You saw what happened when Muslim bauls get persecuted, and ask if atheists are safe?\nAnd I have been an atheist longer than 14 years, which if you're talking right is your age. Once I started studying and trying to understand science, the need for a deity became unnecessary. Yes, it's that simple.",
      "votes": "14",
      "replies": []
    },
    {
      "text": "Yes I am safe because whenever I am in BD I act as khati mumin. And why did I become an atheist? Because I do study a lot.",
      "votes": "6",
      "replies": [
        {
          "text": "",
          "votes": "-5",
          "replies": [
            {
              "text": "I mean I am a khati mollah in BD so it's expected that I would act similar to them, right?",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Dw guys it IS a safe space and I'll definitely not be snitching to Jamat",
      "votes": "3",
      "replies": [
        {
          "text": "bro i promise im not jaamat e islami and i forgot to tell people NOT to share their personal info or something else including names and shit plus im just 14",
          "votes": "4",
          "replies": [
            {
              "text": "Bhai govt chaile easily track korte parbe, they just don't care",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Obviously safe If they are real atheist.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 1
}