{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pftlqk/hello_bangladesh/",
  "hash": "50b959ce3523760349e51a9b5c52b208",
  "scraped_at": "2025-12-08T19:28:51.400977",
  "title": "Hello bangladesh!",
  "description": "So I'm born in America but I studied in india and have been living in india and Nepal for the past 9 years. Making my first trip to Bangladesh, from December 26-jan 5th so I'll be there for new years.\nI'd love to know where I should spend new years, Dhaka or somewhere near cox's bazaar.\nMy flight arrives to Dhaka 8:30 at night. I Haven't booked a hotel yet, I'd love to know the best area for food, living in Delhi I loved going to jama masjid for food. What are some must try beef dishes in Dhaka.\nI'm a budget traveller, the flight from Dhaka to cox bazaar is not expensive but I'd love to take a bus or train, in india there is red bus, what apps should I be using to get around in Dhaka, and Dhaka to cox bazaar.\nAlso 😅 I think it's pretty dumb how my indian friends hate on Bangladesh, hell I'm not even telling everyone I'm going there, as opposed to nepal or Thailand for my visa renewal. Is the anti indian sentiment common in bangladesh, like should I just avoid the topic all together?",
  "votes": "3",
  "comments": [
    {
      "text": "New year celebration will be better in Dhaka if you want party 🥳. If you like it calm Coxs can be a thing. Try hotel Sayeman they have the best infonity pool.\nIs Anti India sentiment a thing? yes! Better to avoid that discussion since India has currently been very supportive of the previous authoritarian regime and not shaking hands with Dr. Yunus so it is clear if we are in friendly terms or not. Idk why I am writing about India here either lol. But hei, we are neighbours and think about the big picture in long time. This issue will get sorted eventually.\nYour India friends hate on BD is okay. We all hate each other in this subcontinent anyway. All my friends hate both Indians and Pakis but you know what, the reason mostly is stereotypes. Ask them how many Indian or paki they know IRL and are friends with the answer will be zero.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 14
}