{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pdjh4p/female_safety_in_bangladesh/",
  "hash": "7c9c5d30e05e42a869bbbdbe0811bc51",
  "scraped_at": "2025-12-08T19:32:17.227300",
  "title": "Female safety in Bangladesh",
  "description": "Hi, is Bangladesh safe for solo female travellers? It is next to some countries whose rape statistics are not super impressive, but I also understand Bangladesh is a different country with a different culture, so just wanted to check. Thank you for your answers.",
  "votes": "0",
  "comments": [
    {
      "text": "I traveled solo as a woman, it’s generally safe, but you need to stay cautious and plan ahead, including where you’ll stay and how you’ll get around.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Depends... Are you able to blend in or are you a foreigner that will stand out?",
      "votes": "4",
      "replies": []
    },
    {
      "text": "As safe as anywhere in the world. If you follow Reddit solo travel sub unfortunately you will find woman experiencing harassment all over the world even in European countries. Most cases Bangladeshis although curious about foreigner traveller they actually are quite accommodating and helpful as long as you dress modestly and behave modestly.\nApply common sense to be safe ie going to place with local friend/trusted guide. Avoid going out to places with less foot traffic at night, you are pretty safe within Gulshan/banani/dhanmondi as they are frequented by large number of people till late night. Don’t flash jewellery or expensive gadgets.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Currently the country is not in a stable position, being a man I find it risky to go into some places.\nYou should be very aware of the surroundings, try to carry less cash, and avoid risky places after 10 pm.\nBe very careful of pathao, Uber or cng. There's been a lot of complaints about them being aggressive and all that.",
      "votes": "5",
      "replies": [
        {
          "text": "Thanks. Is it because the famous economist got jailed?",
          "votes": "2",
          "replies": [
            {
              "text": "Nah, it's been like that since August of last year.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Nope.I’m a Bangladeshi but grew up as a diaspora in a very protected environment. when I returned to Bangladesh in grade 9, it was one of the hardest time in my life. predators everywhere especially in Bangladesh can somehow smell if they can prey on you easily. idk how people are saying that you are safe, as a woman to woman I would say no you aren’t safe. people are so disgusting that suppose you are badly touched in a publicly situation and you raise your voice, maximum people either won’t bat an eye or they would support the harasser. faced it many times so I would say if you don’t have a male companion, don’t come here solo.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Dress modestly and take the normal precautions you would take wherever in the world that being moving around while the streets are fairly populated ( 10:00 / 22:00 you have people all over the palce ).\nAlso be careful with the transportation. Go for Uber, Pathao and so on rather then random CNGs.\nJust watch your pockets in the markets. And don’t scrool your phone in a rickhshaw in a crowded area where somebody can snatch it.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "don’t go outside in places where there are less people and don’t go out after evening. spend nights at reputable safe hotels.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "there are more chances of you getting catcalled or harrased in new york city in broad daylight than any major city in this country. regardless of where you are getting your grape stats from, bangladesh is obviously a conservative country so just dress modestly stay within city lights and dont go in remote places in the wrong time of the day without trustworthy people, preferrably make yourself a native friend who can help as a guide even via the cell (advice applicable to anywhere on earth) and you'll be fine. we are not unhinged savages ffs, the worst you will experience in public are stares if you look the part of an exotic foreigner",
      "votes": "-1",
      "replies": []
    },
    {
      "text": "A big NO.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "if ur a brown girl and travel in cities in day, then it should be fine",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Yes and no. You'd prolly want a guide or a friend(native) navigating you from the shady places",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Don't go now. Elections in February, lots of protests and violence everyday. Try next summer. There are many vlogs of Asian women traveling alone in Bangladesh- check them out. It's best to have a local with you, to translate and to tell you where to go. Otherwise there are street kids that will bother you for money.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 26
}