{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pc26ej/why_do_some_youtubers_only_show_the_negative_side/",
  "hash": "53d3e6fb2112866b0f4bafc619f19b0f",
  "scraped_at": "2025-12-08T19:35:47.929799",
  "title": "Why do some YouTubers only show the negative side of Bangladesh in their vlogs especially this youtuber?",
  "description": "Not sure if anyone else feels this, but lately I’ve been seeing a bunch of YouTubers (mostly foreigners, but even some desi ones) making vlogs about Bangladesh where they only focus on the worst possible things.\nDirty streets, crowded areas, poor neighborhoods, clickbait titles like “Most dangerous place in Bangladesh” or “I almost died here.”\nBro… come on.\nEvery country has problems. India, Nepal, Pakistan, Sri Lanka, everywhere.\nBut these YouTubers land in Dhaka, point the camera at the most chaotic street, add dramatic music, and suddenly it becomes “content.”",
  "votes": "82",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "This guy is a male karen but still passable. The actual cunts are the ones who pretend bangladesh is the best place to live on earth.",
      "votes": "98",
      "replies": [
        {
          "text": "Exactly. This guy is just being honest. I can’t stand those foreigners who act like bangladesh is the best place on earth for views",
          "votes": "45",
          "replies": []
        }
      ]
    },
    {
      "text": "In other countries, Bangladeshis, Indians and Pakistanis are the same so this content is part of the anti desi stuff we see in different places\nSometimes I wish I was there to give them a piece of my my mind",
      "votes": "38",
      "replies": [
        {
          "text": "Same man these broke foreigners just come to our country for this",
          "votes": "8",
          "replies": []
        }
      ]
    },
    {
      "text": "These type content is called \"poverty porn\". These contents get many views.",
      "votes": "42",
      "replies": [
        {
          "text": "Is there any good places in Dhaka? May be hardly one or two places are good. They’re just being honest. In fact the foreigners who act like bd is the best place are the biggest scammers. They are the ones farming views.",
          "votes": "7",
          "replies": []
        }
      ]
    },
    {
      "text": "This guy has made atleast 3 wholesome videos about Bangladesh. I know he's wholesome too because he's me!\nhttps://youtu.be/zTyGT4XsxmE - Dhakas best kept secrets\nhttps://youtu.be/dtwBqDfnmI8 - interview with my father in law who fought with crack platoon in the liberation war\nhttps://youtu.be/ABEmAiCUaBY - Investing the real Bangladesh\nI've just returned from another trip in Bangladesh and I've got atleast 2 new videos to edit from there.",
      "votes": "19",
      "replies": []
    },
    {
      "text": "He is not wrong at all. May be you should open your eyes to accept the reality about this country.",
      "votes": "22",
      "replies": []
    },
    {
      "text": "You gotta call a spade a spade, i suppose",
      "votes": "28",
      "replies": []
    },
    {
      "text": "I mean, they do need to be called out. Thats disgusting and unacceptable.",
      "votes": "10",
      "replies": []
    },
    {
      "text": "ঢাকা তে আছে টা কি ভাল দেখানোর মত। বিমানবন্দর থেকে নাইমা ইমিগ্রেশন এর গ্যাঞ্জাম এই তো যে কারো মুড খারাপ হয়ে যাওয়ার কথা",
      "votes": "9",
      "replies": []
    },
    {
      "text": "I don’t think there’s any good place in Dhaka. We can’t hide the truth. Most foreigners know dhaka because it’s ranked at the top in most polluted city. We should just accept and be ashamed. And try to fix it.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "First, you gott call a spade a spade, second, there are other YoTubers who praise BD, watch others or change your algorithm",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Content creators have their style that they want to make content about. Everyone will not focus on the good things. Everything is not sunshine and rosy in Bangladesh so it's not wrong to make content about it.",
      "votes": "11",
      "replies": [
        {
          "text": "It is better known as poverty pporn.",
          "votes": "17",
          "replies": []
        },
        {
          "text": "however, this content creator is intent on trying to degrade us. and he doesn’t seem like doing it for the likes, just to feel superior race.",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "The guy in blue bolts knowing your going to die in 5 minutes",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Street food in BD is extremely unhygienic. I saw a news report where lab tests found a huge amount of bacteria in the samples. The problem isn’t the food itself, but the way it’s served. Most street vendors don’t use single-use plates or cups, and that’s where the contamination mainly comes from. In that sense, India has adopted the use-and-throw system much better. All the shops there use this method",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Thik e toh ache, ja negative tare negative bolteche. Positivity'r shugar coating korar chaite tobmh better",
      "votes": "3",
      "replies": []
    },
    {
      "text": "He is right. Not drinkable.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "If there is a negative side and is true. They should be highlighted so we feel bad and correct those.\nI see no flaw in it.",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Try to listen to the background music of this video",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Because that sells",
      "votes": "2",
      "replies": []
    },
    {
      "text": "This guy idolizes Backpacker Ben and Bald and Bankrupt. What do you expect? He and his buddy Jude specifically go to places like India and Bangladesh just to seek out negativity, post online, create a stir, and get paid from the attention.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Clickbait",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Cos That’s the fact",
      "votes": "2",
      "replies": []
    },
    {
      "text": "They are showing exactly what we are.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Positive side ki ase?",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Dhaka’s street food is really unhygienic. Dont see an issue in presenting them.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Also Nepal, India and Sri Lanka have a lot more to offer to foreigners. Just being objective. Nepal - amazing places up in the mountains, Thamel in Kathmandu has fun spots and bars, plus Everest trekking. Sri Lanka - really nice people and beautiful spots and clean. India - Nothing needs to be said.\nWhat does BD really have to offer to foreigners? Cox’s is the least desirable beach town in the world, beaches full of vendors, no bars and nightlife, the beaches are long but don’t offer much more. Outside of Dhaka there are hardly any top quality hotels, not to mention security concerns. And Dhaka is just traffic, overpriced restaurants in gulshan, too many people, heat and humidity most of the year.\nSo it doesn’t help our case when on top of all that, and in 2025 there’s still shit like this. Truth hurts but BD is just not objectively desirable for visitors compared to India, Nepal, Sri Lanka, Bhutan, China and all of east Asia. Not to mention Dhaka is consistently ranked 2nd worst city to live in.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "most people who does travel blogs makes a living out these! obvs they show what would help them get viral! Unfortunately only few people shows a different light! i love drew binsky tbh!",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Ok, while I don't agree that people shouldn't show the negative sides of BD. In the video, I feel like the dude was just kind of being an asshole",
      "votes": "2",
      "replies": []
    },
    {
      "text": "It’s all about the views, man. Why do you think so many vloggers come to Bangladesh? Do you really think they’re genuinely fascinated by the country?",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Indians love content which shows BD or Pak in bad light. They get a lot of views from there so it makes them money.",
      "votes": "-3",
      "replies": []
    }
  ],
  "id": 36
}