{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pbj741/do_you_believe_an_election_is_going_to_change/",
  "hash": "54efa645e5773470c03ec9577ab56573",
  "scraped_at": "2025-12-08T19:36:11.862375",
  "title": "Do you believe an election is going to change anything.?",
  "description": "I was wondering if you guys believe an election and any of its aftermath is going to change anything for real.",
  "votes": "8",
  "comments": [
    {
      "text": "Yes\nbecause then the govenrment can place their control in everywhere , for interim it was impossible because there was no moyor,mp,chairman,members,counsilors",
      "votes": "10",
      "replies": [
        {
          "text": "Yes\nbecause then the govenrment can place their control in everywhere\nThis kinda makes me chuckle thinking of the revolution, since this precisely people wanted to get rid off.",
          "votes": "-1",
          "replies": [
            {
              "text": "Revolution was a joke",
              "votes": "8",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Nothing will change anything but I hope and seek only one thing to change. The thing is I want to get fair election and from now on just give a free and fair election every 5 years. That’s what I only ask for. The rest will change automatically if people get to vote freely and if there is no dummy election. That is what I ask for really. Nothing else. Free and fair election every 5 years.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Nope ! I have supported the movement and only left with major regret! Its is evident now\nwhoever comes there will be some next level corruption\nthe goal remains the same AL/BNP\nNow live in a fear what if jamaat makes it and overnight implement all they are saying! Even being a Muslim, I do not support the goals of jamaat!",
      "votes": "12",
      "replies": [
        {
          "text": "Being a muslim doesn’t mean you have to support jammaicha",
          "votes": "15",
          "replies": []
        }
      ]
    },
    {
      "text": "Country is rotten to its core nothing will ever change",
      "votes": "10",
      "replies": [
        {
          "text": "hi indian!",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Will this election change anything? I think it will but it won’t be some magical fix to the political situation. Change will happen gradually and the attitude of voters must change before politicians change.\nPolitical parties are spending millions of dollars on social media buys for this election. It shows that voters are no longer taken for granted and that parties actually have to woo voters. As voters demand more, politicians will have to deliver. I think the days of using muscle to win elections will be gone within the next 3 election cycles.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Nothing huge will change overnight after the election. But at least people finally get to vote again. If fair elections keep happening, then better leaders and better parties can have time to grow.",
      "votes": "6",
      "replies": [
        {
          "text": "You can't have a fair election when people can buy votes. Even if someone is free to vote, lots of poor people would take money and for sell their votes.",
          "votes": "5",
          "replies": [
            {
              "text": "We can have fair elections where my vote isn’t auto-logged for BAL without my consent. Bribery exists everywhere & repeated fair elections where people choose their candidate are how systems improve. That’s the same process UK you live in went through to become a more stable democracy, as you don’t even live in Bangladesh",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "If fair elections keep happening, then better leaders and better parties can have time to grow\nElectoralism 🤡🤡",
          "votes": "2",
          "replies": [
            {
              "text": "Yes electoralism is better than your cringe do nothing larp",
              "votes": "-1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "So, do you think ruling without any election is the solution?",
      "votes": "2",
      "replies": []
    },
    {
      "text": "when the whole system is fucked what a election is going to change.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Nah, this country won't change. Corruption is in our blood.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Yes and no. Things will not change in one day. It takes time. The hope we are having with Bangladesh will take a minimum of 100 years to become something true.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Yes.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "It will not change a thing. I am a certified change management professional, and I say this without bias. Change is difficult for everyone. However, it is more difficult for those with power. Good news it can be done with proper planning and time. Step number 1 is awareness. A lot of the time I wonder if the general people of our country want any change. Because even after seeing crime and corruption, a lot of educated people still support big-name politicians on both sides. To summarize, to make any meaningful change, we have to change the system. Keeping the same system, we can't expect people not to commit corruption or crime. If we could hold our leaders and government officers accountable, we could see significant change. No one dares to ask a question to those people in power.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Not really.\nThe only bright side is we can vote again.\nEverything else will probably remain the same or worse.\nIf BNP comes to power they will be as corrupt as AL if not more.\nIf Jamaat comes to power we will be in worse position veering towards a failed Muslim state.\nI hoped the younger generation will raise their voice for issues that matters. But seeing the \"leaders\" of the movement it doesn't inspire a lot of confidence as they are busy becoming the corrupt leaders they usurped.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "It will make things stable in a common man's life ...ik many people who are afraid of selling or buying lands and other form of properties because the value even depends on election...then the govt services will have better paces ..also staffs especially who are corrupted are already in cahoots with jamaat or BNP to serve their own interest...they don't give two fs about orders coming from interim govt thinking they are temporary and weak",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Only Bakshali extremists and autocratic BJP supporters will disagree with such a democratic process. The BAL and Indian comments prove my point.",
      "votes": "1",
      "replies": [
        {
          "text": "😆😆😆\nAutocracy is the oxymoron of my political perception.",
          "votes": "2",
          "replies": []
        }
      ]
    }
  ],
  "id": 37
}