{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pai0wt/bangladeshis_what_do_you_think_of_mamata_banerjee/",
  "hash": "fe10425317774f941b38ed6c6a3d7ecf",
  "scraped_at": "2025-12-08T19:38:44.523892",
  "title": "Bangladeshis, what do you think of Mamata Banerjee ?",
  "description": "( PS : Ghoti Muslim from Howrah )",
  "votes": "11",
  "comments": [
    {
      "text": "She blocked the Teesta deal in the 2010s and the river is choked and released when India wishes. She mentioned ‘Bangladesh ke keno pani debo?’ The plight of the people on the other side of the border means nothing to her.",
      "votes": "41",
      "replies": []
    },
    {
      "text": "A bitch",
      "votes": "25",
      "replies": []
    },
    {
      "text": "তেমন কিছু জানি না তবে কলকাতার অন্যদের রাজনৈতিক আচরণ দেখে যা মনে হয় মমতা ভালো নেতা কিন্তু ভালো মানুষ না !",
      "votes": "10",
      "replies": []
    },
    {
      "text": "Better for kolkata. Without \"tista chukti\" she is much better for Bangladesh compare to BJP. Whenever she lose power and BJP make their government in kolkata Bangladeshi people will suffer more then now.",
      "votes": "15",
      "replies": [
        {
          "text": "",
          "votes": "-1",
          "replies": [
            {
              "text": "It’s funny you keep spamming this post on our subreddit & having a modiji obsession crash out 🤣",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Really don't know much about her",
      "votes": "13",
      "replies": []
    },
    {
      "text": "Dear moderators, kindly please do not strike this post down 🙏",
      "votes": "8",
      "replies": []
    },
    {
      "text": "she sends hate to Bangladeshis just to seek approval from BJP gov yet BJP hates Bengalis no matter whichever side of border we are from",
      "votes": "4",
      "replies": [
        {
          "text": "What makes you think BJP hates Indian Bengalis? Don't blabber whatever comes to your mouth. Bd bengalis are not the same as Indian Bengalis.",
          "votes": "-1",
          "replies": []
        }
      ]
    },
    {
      "text": "Dont know much about her",
      "votes": "3",
      "replies": []
    },
    {
      "text": "",
      "votes": "3",
      "replies": []
    },
    {
      "text": "She is the fascist version of India !! incumbent",
      "votes": "8",
      "replies": []
    },
    {
      "text": "She can go fck herself",
      "votes": "4",
      "replies": []
    },
    {
      "text": ". Not a big fan of her minority appeasement politics",
      "votes": "5",
      "replies": [
        {
          "text": "See you not for mind mane ki?",
          "votes": "2",
          "replies": [
            {
              "text": "its from a meme video where a guy attempts to speak in broken english, what he meant by this sentence, that i dont know\nমোহাম্মদ শিহাবুদ্দিন রিয়াজ\nখেজুর ব্যবসায়ী\nকুমিল্লা",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Wh***",
      "votes": "2",
      "replies": []
    },
    {
      "text": "From our pov, it's a mixed feeling. As many mentioned, she single handedly blocked the teesta agreement, when the BJP govt was aligned with it. On the other hand, she's keeping hostility in check, BJP in WB, might just be a tougher cookie to deal with, for Bangladesh.\nI think she's overall a good leader for her people. Otherwise staying elected for this long would not have been possible.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "একজন দেশপ্রেমিক যে তার কলকাতার জন্য সবকিছু করতে প্রস্তুত। বাকিদের ব্যাপারে তার আগ্রহ নেই হোক সেটা বাংলাদেশ কিংবা ভারতের বাকি স্টেটগুলো।।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Good but Corrupted. 🫤",
      "votes": "1",
      "replies": []
    },
    {
      "text": "A failed statesmen in all aspects. WB has been in a slump for so long that is unbelievable to imagine it was once the centre of the indian subcontinent. Hasina was as tyrannical as she was but at the very least we had economic growth. Can't say the same for our twins in West Bengal.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I don't know why you guys still vote for mamta?! You guys should seriously vote for the BJP in WB.",
      "votes": "-3",
      "replies": []
    },
    {
      "text": "What's the difference between Ghoti Muslim and Muslim?\nShe looks OK.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "She's fine i guess i mean you guys got free water and some other stuff so i think she's cool but what's her power anyway like she's been ruling Kolkata for years like a PM",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "khamki",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I didn’t like Mamata Banerjee’s stance regarding the Teesta agreement, but compared to Narendra Modi, I still find her better.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Ghoti Sheikh Hasina basically",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Fazil mohila",
      "votes": "1",
      "replies": []
    },
    {
      "text": "What alternative do you guys have?",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 44
}