{
  "url": "https://www.reddit.com/r/bangladesh/comments/1paeuvb/is_mohammadpur_as_dangerous_as_everyone_says/",
  "hash": "4e75bf6aae6d07a32a335b19e1dc7194",
  "scraped_at": "2025-12-08T19:39:28.714466",
  "title": "Is Mohammadpur as dangerous as everyone says?",
  "description": "I have never been to Mohammadpur. How bad is it really? And how to stay safe? Any advice would be appreciated\nEdit: What about green city and chandrima model town exactly? How bad are these places?",
  "votes": "8",
  "comments": [
    {
      "text": "People who grew up in Mohammadpurr are rarely bothered by local troublemakers as they know each others. However, newcomers might be targeted.",
      "votes": "19",
      "replies": [
        {
          "text": "Cooked",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "what a coincidence, as i spent 3 months there recently and 5 of us got robbed of 3100tk in broad daylight near the culverts at housing limited. apart from that, it was fine. if you take up residence near the main street, it should be safe, but near dhaka uddan and beyond is where we were told to be most careful.\nto give some more info on the robbery itself, it was some local thug who happened to be high at the time and after our \"incident\", we saw that mf hanging out in all sorts of places. we bumped into him couple of times and he had the audacity to say \"ঐদিন ভাইয়ের মাথা ঠিক ছিলনা, তোমরা ঐ ঘটনা কাওকে বলবানা, নাহলে আমাদের দুইজনের জন্যই সমস্যা। যাই হোক, এখন থেকে তোমাদের কেউ ডিস্টাব করবে না, করলে ভাইকে জানাইয়ো, ভাই এলাকাই থাকি।\"\nim just thankful i didnt get shanked and only lost 700tk.",
      "votes": "9",
      "replies": [
        {
          "text": "What about green city and chandrima model town? How bad are these places?",
          "votes": "3",
          "replies": [
            {
              "text": "we had some site visits around nabinagar 9 and bosila during the daytime. nabinagar in particular was developing fast with lots of ongoing construction but even then it felt a lot less safe to us. our internship teacher lived there and he told us on the first or second day that he got robbed once, and later he even bought his current phone from the same robbers for a really cheap price. he said something like, \"ওরা যা চাইবে দিয়ে দিবা। নিজের জীবন আগে বাচাও। কোন পাগলামি করো না।\"\nso yeah, i'd be careful in those spots and i'd say it helps to blend in with how you dress. one of the reasons we got targeted was cause we made it super obvious we were newcomers from pretty well off families, and we always walked around in a big group, which made us stand out even more.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Are nah ki je bolen 5 min hoise aschi shob th",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Depends on the area really, Mohammadpur is a large place.\nResidential and semi-elite places (Adabor, Iqbal Road etc) are usually safe because of good security and less dense streets/infrastructure.\nBut heavily densely populated places (Townhall, Bus Stand) or heavily isolated places (Bosilla, some parts of Chandrima/Dhaka Uddan) can be dangerous given the time of the day, but I feel like this is the same for most areas in Dhaka apart from some very high security localities.\nAnd there's of course the infamous Geneva Camp, a haven for terrorists and robbers. Best to avoid that place at any time of the day lol.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "I was in townhall around 10years ago. The townhall is too dense with buildings. Aside from the short main road where shops are around, it's dangerous to walk in dark alleys. You don't know when some miscreants will attack you. You will hear about hijacking often. The buses last stop is often townhall so its almost empty if you go there after 8pm.",
      "votes": "5",
      "replies": [
        {
          "text": "What about daytime?",
          "votes": "1",
          "replies": [
            {
              "text": "relatively safer since people are out",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "depends on your bhaggo. rakhe Allah mare ke?\nI've never experienced anything like that myself though, and I go there quite often.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Mohammadour is safer than Banani diplomatic zone until you meet the men, the myth, the legend.",
      "votes": "2",
      "replies": [
        {
          "text": "who are these legends? name some",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Living in Mohammadpur since 1994. Real scenario : the old mohammadpur used to be the area between mirpur road and beribadh. back in 2000s, we could even see burigonga river from rooftop. then burigonga river was filled up and new housing areas were created, namely bosila, nobinogor, dhaka uddyan etc etc. these new housing areas are \"real\" dangerous area because they are at the edge of Dhaka city and empty, which is unsafe in many ways due to various reasons. the rest of mohammadpur is pretty good. alhamdulillah, etodine kicchu hoy nai ba kichu chokhe pore nai...",
      "votes": "2",
      "replies": [
        {
          "text": "Is it at least safe during daytime? What about green city and chandrima model town?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Went to school and coaching there from 3rd to 10th grade but that was about 30 years ago. There were parts that were scary even back then and were told by elders to avoid in the evenings (camp), but we still went especially for the food (chaap). Never had anything happen.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Been living in mohammadpur for around 7-8 years. Never heard/faced any of that. It's a popular topic on social media only. Oh btw, some narrow & dark passages are scary though.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Probably worse",
      "votes": "1",
      "replies": [
        {
          "text": "Elaborate please",
          "votes": "1",
          "replies": [
            {
              "text": "Was kidding. Its probably a lot safer than people make it out to be",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Mohammadpur, Narayanganj, Noakhali ,Gulistan, Gopalganj, cumilla, Brahmonbaria,Norshindi, chadpur, Barishal.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Reading all while I am in mohammadpur noorjahan road.",
      "votes": "1",
      "replies": [
        {
          "text": "Are you still alive?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Short ans: yes Long ans: yes",
      "votes": "1",
      "replies": []
    },
    {
      "text": "No, I've been there a lot of times and if you are aware of any typa danger you're good to gooooooo 🕊️",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 46
}