{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p9v5z8/wtf_is_this_real/",
  "hash": "ad95ed64fc5891f583107e3b019fd059",
  "scraped_at": "2025-12-08T19:40:21.038308",
  "title": "Wtf, Is this real?",
  "description": null,
  "votes": "16",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Why is bengali cinema always having the same tropes? I tried watching movies from two years ago, and it never changes.",
      "votes": "5",
      "replies": [
        {
          "text": "Because that's what the village people like. Not everyone enjoys top quality content. Some just want soapy shit.",
          "votes": "1",
          "replies": [
            {
              "text": "Maybe: but the tropes though, let's talk about it.\nThe damsel in distress whose beauty worries those around her-if in the city and rich, it's some girl that wears skirts, and is extremely naive, spoiled, and out of touch, idealistic\nThe self righteous man lacking wit, the good man, good son, the good brother who saves #1. Poetic -usually sakib khan\nMother who cries a lot\nGangsters always present usually tries to dishonor/forcefully take #1 and is saved by #2\nIf they try to make a better character, it's someone with slight more attitude.\nNatoks - funny ones are way better though.\nThen there's always some love affair that's forbidden. Once tried to see the recent ones, and I was surprised it was the same as a decade ago.",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "🤮",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Shakib vampire confirmed?",
      "votes": "3",
      "replies": []
    },
    {
      "text": "🤮🤮.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Someone translate",
      "votes": "1",
      "replies": [
        {
          "text": "The kid in the first scene and the girl in the second scene are the same person.",
          "votes": "3",
          "replies": [
            {
              "text": "What the heck",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "is it that rare a case\ni doubt it is with how brutal the entertainment industry is usually",
      "votes": "1",
      "replies": []
    },
    {
      "text": "not a rare case at all,if not it's very common. For example If i remember correctly in \"Prem ratan dhan payo\" one of Salman Khans girlfriend also acted with him years before as his daughter or something.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "ভাই কি বাংলাদেশের ইন্ডাস্ট্রির কোনো অবস্থাই জানেন না নাকি?",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 49
}