{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p9td63/has_anyone_else_noticed_the_huge_increase_in/",
  "hash": "7b7dfdd18e03bd37b990ef1044b4a44d",
  "scraped_at": "2025-12-08T19:40:45.676033",
  "title": "Has anyone else noticed the huge increase in Quranism/Hadith rejection and Hadith skepticism among Bangladeshi Muslims?",
  "description": "Is it just me or does anyone else feel the same? I noticed a lot of BD Muslims on Facebook and social media in recent times are being skeptical of sahih hadith, and many rejecting the hadiths altogether and becoming Quranists (Quran only). I had no idea that so many Muslims in Bangladesh nowadays have this tendency to dismiss sahih hadiths, I was so surprised to see their huge numbers. What's the reason behind this sudden boom of sahih hadith skeptics and deniers in Bangladesh?",
  "votes": "10",
  "comments": [
    {
      "text": "what I think is, it has a lot to do with the practice of hadith coercion and the religious leaders presenting them in a way that benefit themselves or serve their agenda. This has been going on forever here. For instance, you won't see people talking about lowering gaze as much as women covering up. people who can think will naturally notice this. They are smart enough to understand islam might not be what the local leaders claim it to be and humble enough to understand these inconsistencies are due to ill-intention of people, not islam. Then they start from the basic, read quran on their own, try to understand it. They follow what they have understood. One cannot follow all there is. Once they are convinced that there is this and that obligation from god, they follow it. they are in the process. if the glass of water is impure, you pour out everything, clean the glass and then fill it with pure water. as they keep on learning, their domain of such obligations increases. it has more to do with interpretation of sahih hadith than the hadith themselves",
      "votes": "10",
      "replies": [
        {
          "text": "the religious leaders presenting them in a way that benefit themselves or serve their agenda.\nI heard this is very common in Bangladesh religious communities, to make fake hadith.\nMy own parents, who used to go to bayans, taaleem, those stuffs, especially in the 2000s before widespread internet access used to tell me how Bangladeshi Muslims (even abroad) used to corrupt the hadith (\"Jannah\" is under the mother's feet) and preach the fake version (Jannah is under husband's feet -\"shamir pai\"), especially to women. It was totally acceptable then!\nI think it is still preached now in some places!",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "It's primarily because people have easier access to information and knowledge now. It's easier to find something offensive in the hadith corpus. See this one, for example:\nAnd it's said to be authentic!",
      "votes": "11",
      "replies": []
    },
    {
      "text": "কারন এরা এটলিস্ট স্বীকার করে যে হাদীস অনুযায়ী নবী ,সাহাবি রা অনেক প্রশ্নবোধক কাজ কারবার করছে যার কারনে এদের যদি ওসব জানার পরেও যদি ইসলামরে সত্য আবার সহীহ বলে মানতে হয় তাইলে হাদীস গুলারে অস্বীকার করে নিজেরে বুঝ দিতে হবে। এরা অন্তত নিজের ধর্ম রে জানার চেষ্টা করছে , বাঙ্গুর বেশিরভাগ মুমিনের মতো না :v জীবনে কোনোদিন এসব নিয়া ফিকির করবোনা কিন্তু অনলাইনে বড়ো বড়ো পেচাল পারবো",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Contradictory কথা তো কুরানেও আছে, আর কোনো প্রমান ছাড়া একটা হাদিস বাদ দিয়ে দিতে পারলে তো বাকি হাদিস গুলো নিয়েও কেউ প্রশ্ন তুলতে পারবে।",
      "votes": "1",
      "replies": [
        {
          "text": "Contradictory কথা তো কুরানেও আছে, আর কোনো প্রমান ছাড়া একটা হাদিস বাদ দিয়ে দিতে পারলে তো বাকি হাদিস গুলো নিয়েও কেউ প্রশ্ন তুলতে পারবে।",
          "votes": "1",
          "replies": [
            {
              "text": "Quran e kon verse contradictory? Can you refer to the verses please",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "As someone who falls into the group you described, it’s because I looked at the history and the sheer number of dubious claims made by misleading people like al-Bukhari have caused such permanent damage to Islam that I simply could not continue being in the charade that is Sunni Islam nowadays. However, as someone who believes in Allah, I became a Quranist because the Quran is after all the true unadulterated word of God in Islam unlike the make believe stuff that is hadiths now.",
      "votes": "15",
      "replies": [
        {
          "text": "How do you know it is unadulterated?",
          "votes": "5",
          "replies": [
            {
              "text": "Note where I said ‘in Islam’",
              "votes": "4",
              "replies": []
            }
          ]
        },
        {
          "text": "How do you know it's the word of god?",
          "votes": "0",
          "replies": [
            {
              "text": "That’s why I said it’s in Islam. If you’re not a Muslim, I don’t expect you to believe in the Quran.",
              "votes": "10",
              "replies": []
            }
          ]
        },
        {
          "text": "আচ্ছা আমারে এবার কুরআন থেকে বাইর করে দেখান কোথায় নামাজ কয় ওয়াক্ত পড়তে হবে এটার ব্যাপারে বলা আছে। বা কিভাবে নামাজ পড়তে হবে এটাই বা কোথায় বলা আছে কুরআনে এটাও দেখান।",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "The problem is the interpretations told to us by Islamic experts of our country are considered to be biased..and I feel people are losing trust on them",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Most of the hadiths people post on Facebook are not correct. Many of them are made up and there is no evidence that they are authentic, which is why people reject them",
      "votes": "7",
      "replies": [
        {
          "text": "যেই হাদিসে নবীর যৌন দাসীর কথা বলা তার ব্যাপারে কি বলবেন?",
          "votes": "1",
          "replies": [
            {
              "text": "I don’t read Hadith, I’m not a very religious person. I’m just saying that I feel some people write fake Hadiths on Facebook with the intention of oppressing or controlling others. Maybe those things are not actually written in the Hadith, they just do it for their own benefit, especially when it comes to matters about women",
              "votes": "4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I have also become a skeptic of Hadith in last few years. Women used to lead armies in wars during the time of Prophet Mohammed (sm) & even Khalid ibn Walid (R). Compare that to what hadith preaches about women.",
      "votes": "6",
      "replies": [
        {
          "text": "যেহেতু ইসলামে নারী commander, নারী যোদ্ধা ছিল, তারমানে ইসলামে নারীদের অনেক সম্মান ছিল, এটা association falacyর একটা সুন্দর উদাহরণ, এটা যে একটা হাস্যকর falacy তার প্রমান বাংলাদেশ নিজেই, বাংলাদেশের প্রধান দুটি রাজনৈতিক দলের প্রধান নারী হওয়া সত্ত্বেও বাংলাদেশে নারী নির্যাতনের হার অনেক বেশি এবং বিশ্বে নারীদের জন্য অনিরাপদ রাষ্ট্রগুলোর একটি।",
          "votes": "5",
          "replies": []
        },
        {
          "text": "There was a few exceptions (Nusaybah), but society was pretty misogynistic overall.\nAnd you do realize that Quran is as misogynistic as hadith literature? It doesn't even address women directly. Women are primarily \"wives and daughters of the believers\". It allows men to beat their wives, considers two women's testimony equal to one man and so on.",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "I saw this online, not just Bangladeshi Muslims but even other Muslims like Arab Muslims and others on Twitter, especially. They have studied and debated this and are still doing so.\nPersonally I am not for or against, still learning more on this situation for curiosity.\nThey have given some reasons from their side like:\n- Many hadith were recorded so many years after the Prophet SAWS died. How many are what he really said?\n- Collections of hadith were burnt because of doubts on their authenticity by the hadith compilers back then. So which are real and which hadith are fake? Were some real hadith burnt too?\n- The main reason they say: Some of the sahih hadith are totally bizarre and unbelievable beyond any belief.\nIt's interesting.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "More and more people are realising the truth. They're opening the Qur'an and hadith themselves and reflecting. The so-called ulama, those who want to be gatekeepers of knowledge, stand no chance against the open library of the internet and super-intelligent AI. Take a look at the following hadith, for example, is this not filth and lies:",
      "votes": "2",
      "replies": []
    },
    {
      "text": "The Internet and translations of the Hadith happened. If most people actually knew what those boons contained they’d be pretty shocked.\nWhen debating non-Muslims, there are so many Hadith and Tafsir that non-Muslims bring to debates to make Islam look silly. Believers are then faced with the choice of either denying the Hadith are true and correct yet still saying they’re needed, or they reject and reject until eventually just giving up on them and becoming either quranist or an apostate.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "\"...Whoever does not judge with what God has sent down, then these are the kaafirs.\" (5:44)\nThe Qur'an said it, not me.",
      "votes": "2",
      "replies": [
        {
          "text": "",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "ইসলাম যখন প্রসার ঘটা শুরু করে তখন বিভিন্ন ট্রাইবের লোকেরা নিজেদের সুবিধার জন্য বিভিন্ন জাল হাদিস বানিয়ে সুবিধা ভোগ করা শুরু করে(এখনকার ধর্ম ব্যবসায়ী দের মতো)। যার ফলে যখন হাদিসের ব‌ইগুলো যখন সংকলন করা হয় তখন কন্ট্রাডিকশন ও চেইন অব ট্রান্সমিশন এর উপর ভিত্তি করে সহিহ হাদিস নির্বাচন করা হয়। যেহেতু হাদিসের কোনো লিখিত পান্ডুলিপি ছিলো না তাই ট্রান্সমিশনে কোনো এক জায়গায় ভূল হলেও তা সহিহ হিসেবে গন্য হচ্ছে। এছাড়া আরবের বিভিন্ন অঞ্চলে ব্যাকরণ ভিন্ন ছিলো যার ফলে ব্যাকরনজনিত কোনো ভুল থাকলেও চেইন অব ট্রান্সমিশন সহি থাকায় তা সহিহ হাদিসে থাকবে, এছাড়াও অনেক হাদিস ইহুদি, খ্রিস্টান স্কলারদের থেকে সংগ্রহ হয়েছে। তাই কোনো হাদিস একশভাগ সহিহ কিনা তা শুধু আল্লাহ জানে",
      "votes": "1",
      "replies": [
        {
          "text": "সমস্যা হোলো কোনো প্রমান ছাড়া একটা হাদিস বাদ দিয়ে দিতে পারলে বাকি হাদিস গুলো নিয়েও কেউ প্রশ্ন তুলতে পারবে।",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "My friend, as a Turk, I am truly delighted to hear this. It seems our Bangladeshi brothers share our views.\nI don't know your situation, but Quraniyyon/Quranism is spreading quite rapidly among us, so much so that those who embrace this view have already begun writing and publishing countless new translations and interpretations of the Quran.\nHow are things with you?\nHow are those who embrace this view in your country?\nI've heard that in some countries, those who embrace these ideas have been killed, so I'm curious about your situation.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Honestly I don't know. If anything, I've seen more jihadist genocidal maniacs rise up in facebook, more so than before. Y'know those TMD, madkhali type idiots, basement dwellers? It's genuinely concerning because most of them are in their 18-30s, genz people. Not to mention various other islamist parties, tawhidi jonota etc.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "The amount of made up hadith gurllll that I realized were fake after I grew up (especially in south asia). Like the most ridiculous stuff that men made up for their convenience, not to mention how religiously (pun unintended) the so-called scholars love to say them. Like I'd understand if the common people kept saying stuff like this, but scholars too? Then what are they teaching them in Madrasa? What are they learning? Who are their teachers? And authentic scholars who know all this, why aren't they correcting these fake scholars and stopping these from spreading? These people have turned Islam into a joke and just use Islam for their own convenience. I'm not saying reject hadith completely, the Quran does mention to follow the teachings of the prophet. But these sort of revelations that there are made-up hadith is not helping in any way.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "They're misguided. You can't reject hadith literature.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 50
}