{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p9o9o9/keeping_politics_aside_what_do_you_think_of_nepal/",
  "hash": "9ff04e9e4451f0671a6a63a2a6f7ebfe",
  "scraped_at": "2025-12-08T19:41:21.894818",
  "title": "Keeping politics aside, what do you think of Nepal and Nepalese people as a Bangladeshi?",
  "description": null,
  "votes": "30",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I have had the opportunity to be close and spend time with few of them here in bangladesh. Comparative to us bengalis they seem way more poised and even tempered. They are also very hard working and honest. Overall they seemed solid from my point of view.\nHow ever my sample size for this view is limited to only higher educated expat who arent probably on their natural environment.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "I worked at restaurant as a kitchenhand in sydney for a while and all the chefs there were Nepalese. Really hardworking, friendly, and kind people. Gave me some great recipes and pointers on my cooking as well.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Chill cool people. Enjoyed my time there.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "This post was removed as it breaks reddiquette, which is a set of guidelines that all users of r/bangladesh follow in order to make the subreddit a civil discussion space.\nThis also includes discrimination or offensive language which is not tolerated here. This includes racism, misogyny, xenophobia, homophobia, and/or religious discrimination.\nBe civil. Remember the human that you're interacting with.\nWhile your post may have had substantive content, either right or wrong, we have had to remove this in order to be fair about enforcing the rules. Thank you for understanding.\nRule #1. Follow Reddiquette.\nএই পোস্টটি সরানো হয়েছে কারণ এটি রেডিকেট লঙ্ঘন করেছে। রেডিকেট হলো একটি নিয়মাবলী যা r/bangladesh এর সকল সদস্য মেনে চলে, যাতে এই প্ল্যাটফর্মটি শালীন এবং গঠনমূলক আলোচনার পরিবেশ বজায় রাখতে পারে।\nএই সাবরেডিটে কোনো ধরনের বৈষম্যমূলক বা আপত্তিকর ভাষার অনুমতি নেই। এর মধ্যে পড়ে বর্ণবাদ, নারীবিদ্বেষ, জেনোফোবিয়া, কুইয়ারফোবিয়া, এবং ধর্মীয় বৈষম্য।\nআপনার আচরণে শালীনতা বজায় রাখুন। মনে রাখবেন, যার সঙ্গে আপনি কথোপকথন করছেন, তিনিও একজন মানুষ।\nআপনার পোস্টে হয়তো গুরুত্বপূর্ণ কিছু বিষয় ছিল, তবে নিয়মের প্রয়োগ নিশ্চিত করতে এটি সরাতে হয়েছে। বিষয়টি বোঝার জন্য আপনাকে ধন্যবাদ।",
      "votes": "4",
      "replies": [
        {
          "text": "This post was removed as it breaks reddiquette, which is a set of guidelines that all users of r/bangladesh follow in order to make the subreddit a civil discussion space.\nThis also includes discrimination or offensive language which is not tolerated here. This includes racism, misogyny, xenophobia, homophobia, and/or religious discrimination.\nBe civil. Remember the human that you're interacting with.\nWhile your post may have had substantive content, either right or wrong, we have had to remove this in order to be fair about enforcing the rules. Thank you for understanding.\nRule #1. Follow Reddiquette.\nএই পোস্টটি সরানো হয়েছে কারণ এটি রেডিকেট লঙ্ঘন করেছে। রেডিকেট হলো একটি নিয়মাবলী যা r/bangladesh এর সকল সদস্য মেনে চলে, যাতে এই প্ল্যাটফর্মটি শালীন এবং গঠনমূলক আলোচনার পরিবেশ বজায় রাখতে পারে।\nএই সাবরেডিটে কোনো ধরনের বৈষম্যমূলক বা আপত্তিকর ভাষার অনুমতি নেই। এর মধ্যে পড়ে বর্ণবাদ, নারীবিদ্বেষ, জেনোফোবিয়া, কুইয়ারফোবিয়া, এবং ধর্মীয় বৈষম্য।\nআপনার আচরণে শালীনতা বজায় রাখুন। মনে রাখবেন, যার সঙ্গে আপনি কথোপকথন করছেন, তিনিও একজন মানুষ।\nআপনার পোস্টে হয়তো গুরুত্বপূর্ণ কিছু বিষয় ছিল, তবে নিয়মের প্রয়োগ নিশ্চিত করতে এটি সরাতে হয়েছে। বিষয়টি বোঝার জন্য আপনাকে ধন্যবাদ।",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "some of the most chillest and friendly people in south asia, with the blessing of nature.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "As a Bangladeshi, i feel Nepal is a beacon of positivity in the subcontinent... A hindu nation that hasnt been devoured by hindutva extremism that runs the show now....Nepal is a land of warriors and tough people....i would wish for deeper business and diplomatic ties with Nepal and a good relationship amongst Bangladeshis and nepalese people in general....i would also wish nepal stays free from indian influence....as the akhand bharat project is a common threat to both Nepal and Bangladesh...\nBy road connectivity with Nepal would have been great for tourism and business but india would never allow it....this region would always remain divided bcoz one country just cant be a good neighbour to any other country in south east asia...\nFor any Nepali reading this....do u guys know) Nepal border is about 22km away from Bangladesh's North most point....the Kanchanjangha can be seen from Bangladesh... If only india had allowed a corridor.\nThey only know how to take things....they took land, rail and river corridor/transit whatever...also priority privileges in our ports....but wont allow a corridor to Nepal...\nI wish someday this part of the world could be like european union... Nepal Bangladesh bhutan china pakistan",
      "votes": "3",
      "replies": [
        {
          "text": "You want to be in a union with China?",
          "votes": "2",
          "replies": [
            {
              "text": "Any union in this region without china would fail....they are the world's factory.... I dont have irrational sinophobia...",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Nepalese people are good I think but it feels like they want to be closer friends with Indians for some reason, while Indians don’t care much about them. But I still think Nepalese people are really good",
      "votes": "3",
      "replies": [
        {
          "text": "What I have seen is Nepalese people hate India 😅",
          "votes": "2",
          "replies": [
            {
              "text": "No, you should ask the Nepalese. Many Nepalese go to India for jobs and Indians often make fun of them for it",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Cool guys but hardcore India glazers",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Its kind of a generalization to see all foreign people as nice for us. General people like me don't visit other countries during vacation to make any informed opinion.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Thousand better than indians",
      "votes": "0",
      "replies": []
    },
    {
      "text": "A different point of view. I have classmates from most of Indian neighborhood. Among them Nepali youths hate India most 😂😂and all my Nepali friends are chill dude’s. And almost same mentality as our Gen Z. Dun care about eniye biniye kotha bola or any kinda Voxodi.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Nice hardworking people",
      "votes": "1",
      "replies": []
    },
    {
      "text": "4 Nepalese friends studied with me in the university. We still are in touch. Hope to visit Nepal one day.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Friendly 🗻",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Good people. Met them in my Pokhara trip. Very frindly and kind hearted a resort guy even shared his best taken photos of annapurna range with me. In this subcontinent we are almost the same people you know. Religion and language might be different but the way we think or act or feel the affection for others are very similar. I love Nepal 🇳🇵",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Love Nepal, love Nepalese people. The most beautiful nation I've been to.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "including and excluding politics good people, including sports a little too much competitive.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Very chill people, every Nepalese I met was cool. We have more similarities with them than our closest neighbours for some reason",
      "votes": "1",
      "replies": []
    },
    {
      "text": "i've never been to nepal but i have seen many vlogs of many youtubers and i think Nepalese people are cool and they enjoy every moment of their life. I will try to visit nepal someday",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 52
}