{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p97tr7/what_to_wear_to_my_bengali_friends_wedding/",
  "hash": "b37ee66107e0be958c6af40b2065b530",
  "scraped_at": "2025-12-08T19:41:56.887984",
  "title": "What to wear to my Bengali friends wedding?",
  "description": "Hello! I’m a white British woman and my best friend is from Bangladesh. She lived in Bangladesh when she was young and moved to the UK, we’ve been best friends now since school for 13 years.\nShe is getting married and I was given the invite today, I’m so happy for her! It will be a traditional wedding and she has made a point that me and my grandparents will be the only white people there. I want to surprise her and dress in traditional clothing (I know she’ll love it) — I’m just wondering for people’s advice on what would be best to wear as a guest to the wedding? I want to be respectful. Also, any other things I might not know for the wedding i.e should I bring money/gifts? Anything else?\nThank you so much, I absolutely adore her and just want to make an effort for her special day, and also to be culturally respectful in every possible way.",
  "votes": "8",
  "comments": [
    {
      "text": "Well you can wear Sharee if you are a woman or Panjabi (with kurta) if you are a man. Make sure it has party vibes. You can wear any color beside red (if she cares about that stuff). Also first ask her if they will allow gifts in her wedding then you can gift her anything from home appliances, decorations to jewellery. You can even give money there is no problem.",
      "votes": "8",
      "replies": [
        {
          "text": "If you are a woman and wearing a sharee is difficult for you, go for a salwar kameez (also called kurta pajama by people from other South Asian countries).",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Hi - whereabouts do you live in the UK? I’m also from the UK.\nIf you’re in London take a trip to Green Street (closest station is Upton Park), they have loads of Asian shops with glam kameezes for around £40-50. I’d personally go to Silk which is right at the top near the station. If Birmingham is close by, go to Soho Road, but many major cities with a sizeable Asian population will have some Asian shops.\nYou can also order online. Shiffonz (which is located in Green street but has a good online shop) is really nice, and Memsaab is popular too but I’ve only used the first. But in general, I’d say stick to a kameez (the 3 piece dress, trousers and scarf), keep it glam, full hair and makeup as well as jewellery as Bengalis in the UK go hard during weddings!\nAs for gifts, it’s normally money in a card. Most guests give £50+. But since you are best friends, you could get her a special gift if you know that’s something she would like. Enjoy!",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Go to green street, upton park. There are many shops where you can buy or hire wedding dresses like lehenga or saree. Lehenga would be easy to maintain imo. Fuze rentals is a good option for hire. I remember damini had good dresses with quality fabrics if you want to buy. Cheers.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Heya 👋 If you're comfortable with saree that will be the best option. If not you can go for salwar-kamiz with the most bling✨ on it. For jewelry try big jhumkas or any lengthy earring, stack of bangles & if you have your nose pierced, \"nath\" would look amazing. Finally anklets with little bells or charms would pull the whole look togather. If you're concerned about colour the most easy way would be choosing either gold or silver combo.\nFor gifts, she's your best friend I'm sure whatever you bring her she'll like it.\nYou can find everything at your nearest sout Asian store. Just Google it up or can also ship it from Bangladesh.\nLastly, no one can outshine a Bengali bride 😉 so you can go all out & have fun with your look. We love to see effort. Any questions - you can hit me up.",
      "votes": "1",
      "replies": [
        {
          "text": "For your grandparents, a male attire is usually \"Punjabi\" but formal suit is also common. For elderly women you can tone down the jewelery & go for any comfortable option like embroidered salwar-kamij.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Love the post",
      "votes": "1",
      "replies": []
    },
    {
      "text": "You can get a ready stitched saree that will be fairly easy to wear!",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 54
}