{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pgmqx1/laptop_suggestion_for_cse_major/",
  "hash": "d0ab278b4d74dd5684a695dad180edc0",
  "scraped_at": "2025-12-08T19:26:41.007765",
  "title": "Laptop Suggestion for CSE major?",
  "description": "First of all, i know CSE...yikes Second of all, the budget is <1lakh (better if its not more than 80k). The processor needs to be above 7th gen. All together...a moderate laptop to do all the CSE shit",
  "votes": "1",
  "comments": [
    {
      "text": "Buy a PC instead. Laptops are overpriced, non-modular and difficult to repair.",
      "votes": "3",
      "replies": [
        {
          "text": "Yeah but portability would be a huge headache. If i did have to carry this everywhere then i would have considered a PC",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Get a Macbook, if possible the latest generation. Or, if the latest gen is too expensive, you can buy the previous gen.\nYou can also think of buying a Thinkpad and use linux on it. But, I would suggest you to buy the Macbook, it'd be better for your budget.",
      "votes": "4",
      "replies": [
        {
          "text": "A macbook lasts a decade. Worth every penny.",
          "votes": "2",
          "replies": []
        },
        {
          "text": "Can i trust a macbook for the long run? Cause most of the laptops i used before didn't give a good performance after 4-5 years of use.",
          "votes": "1",
          "replies": [
            {
              "text": "You wouldn't get good performance after 4-5 years of use, in any laptop on earth, because of software updates. I would say if a laptop performs well for 5 years, it has done its duty, you'd have to buy a new one.\nAlthough, there are some people who say that Macbooks are really good and they can last as much as a 7-8 years.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "get a macbook air. M3 or M2, with 16GB ram",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Get a desktop and a tab for notetaking. Or get an ultrabook for portability",
      "votes": "1",
      "replies": []
    },
    {
      "text": "You can study CSE with any laptop really.\nGet a MacBook if you can for the quality, I think an M2 Air 13\" should be within your budget. If you want bigger screen, just get any laptop that has a good latest processor and at least 16 GB of RAM within your budget.\nWhy yikes for CSE though?",
      "votes": "1",
      "replies": []
    },
    {
      "text": "M1 macbook air. maybe used",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Get a macbook AIR. It will be worth every penny. You won't regret.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 6
}