{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p8mp5m/%E0%A6%86%E0%A6%AE%E0%A6%B0_%E0%A6%B8%E0%A6%A7%E0%A6%B0%E0%A6%A3_%E0%A6%9C%E0%A6%A8%E0%A6%97%E0%A6%A8/",
  "hash": "9b0c33bf35602551f18225c9c98c116c",
  "scraped_at": "2025-12-08T19:43:44.792485",
  "title": "আমরা সাধারণ জনগন",
  "description": "আমাদের ভোটের মূল্য কি সত্যিই থাকবে?\nনির্বাচনের পরে কি আমাদের জীবনটাও একটু বদলাবে?\nদ্রব্যমূল্য কমবে কবে?\nচাকরির বাজারে স্বচ্ছতা কবে আসবে?\nরাজনীতিবিদরা ক্ষমতায় গেলে আমাদের কথা মনে রাখবে তো?\nদূর্নীতি কমানোর বাস্তব পদক্ষেপ কবে দেখব?\nআইনের সমান প্রয়োগ কি কখনো হবে?\nআমাদের সন্তানদের জন্য নিরাপদ দেশ কি হবে?\nরাজনীতি কেন সব সময় এত উত্তপ্ত হয়?\nদেশের সম্পদ কার লাভে যায়—জনগণের না বিশেষ গোষ্ঠীর?\nসড়ক দুর্ঘটনা কমবে কবে?\nমফস্বল–গ্রাম এলাকায় উন্নয়ন কখন শহরের মতো হবে?\nহাসপাতাল, শিক্ষা, কৃষক—এদের বাস্তব সমস্যাগুলো কে দেখবে?\nআমাদের ট্যাক্সের টাকা কোথায় যাচ্ছে?\nনেতারা জনগণের কাছে জবাবদিহিতা করবে কি কখনো?",
  "votes": "13",
  "comments": [
    {
      "text": "সব ঠিক হবে সবার প্রথম ঠিক করেন শিক্ষা কে ! মানুষকে শিক্ষিত বানানোর প্রকল্প বাদ দিয়ে কিভাবে শিক্ষা গ্রহণ করতে হয় সেই পদ্ধতি শেখানোর কারিকুলামে বাচ্চাদের আনুন । এরপর ত্রিশ বছর পর পরিবর্তনের বাতাস টের পাওয়া শুরু করবেন । বর্তমান শিক্ষা ছাড়া আর কোন কিছুতে ফোকাস করে আমরা পাল্টাতে পারবো বলে মনে হয় না । স্কুল কলেজে শিক্ষা গ্রহণের পদ্ধতি শেখান এরপর এদেরকে বিশ্ববিদ্যালয়ে নিয়ে দেখুন ওরা কি ফলাফল দেয় । মাঝ পথে গোড়া ধর্মান্ধতা থেকে ওদের দূরে রাখুন , ওয়াজি নামের বাটপার গুলো থেকে ওদের রক্ষা করুন , ইসলাম রক্ষার নামে তৌহিদী জনতা কে নিউট্রিলাইজ করুন । ওদের উপর বাইরে থেকে কিছু চাপিয়ে দিয়েন না শুধু শিক্ষা গ্রহণের পদ্ধতি শেখান । এরপর সেই প্রজন্ম টাকে বড় হতে দেন দেশ পাল্টে যাবে ।",
      "votes": "7",
      "replies": [
        {
          "text": "Absolutely 100% this.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "NO",
      "votes": "6",
      "replies": []
    },
    {
      "text": "lol all these questions and the only answer is NO ahaha",
      "votes": "3",
      "replies": []
    },
    {
      "text": "A solid NO",
      "votes": "2",
      "replies": []
    },
    {
      "text": "জনসংখ্যা বাংলাদেশের প্রধান সমস্যা। বাংলাদেশের যত সমস্যা সব কিছুই অতিরিক্ত জনসংখ্যার কারণে সৃষ্ট। কাজেই বাচ্চা কম পয়দা করুন।",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 60
}