{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p88tuc/found_these_hidden_in_a_ziplock_bag_in_my/",
  "hash": "90a0ceef42c73021731780d0fc6ea964",
  "scraped_at": "2025-12-08T19:44:17.935502",
  "title": "Found these hidden in a ziplock bag in my cupboard, protection or something bad? Please help.",
  "description": "I recently found a small ziplock bag hidden deep in the top cupboard of my house. I definitely did not put it there. Inside the bag were:\nA small folded piece of paper with a hand-drawn grid/table\nA rusty nail\nSmall dark pellets/seeds\nTwo yellowish-brown resin-like stones\nI don’t have a clear picture because my mom threw it away immediately — I only managed to take a quick video before it got discarded.\nSome people told me it might be a protection or good luck charm, while others claimed it could be something meant to cause bad luck or “bandish.”\nA few bad things have been happening recently, but I’m also aware it could just be coincidence or my mind overthinking.\nI’m not trying to assume anything supernatural. I just want to know what this kind of bundle is normally used for, culturally or symbolically.\nHas anyone seen something like this before? Is it a protection charm, a folk ritual item, a harmless totka, or something else entirely?",
  "votes": "18",
  "comments": [
    {
      "text": "Nothing will happen if you don’t believe in this shit. If you believe, you’ll get sick over time.",
      "votes": "33",
      "replies": [
        {
          "text": "Being close to people that actively want to harm you is a bit concerning though.",
          "votes": "18",
          "replies": []
        },
        {
          "text": "How does that work bro? Belief gives it power?",
          "votes": "5",
          "replies": [
            {
              "text": "There’s no such thing as black magic. They have no power to do anything. It works based on the belief system of the targeted people. If they believe in it, ‘nocebo effect’ takes place and they start feeling physical symptoms. On the other hand, when they go through some rituals (destroying black magic, jhar fuk), ‘placebo effect’ takes place and they start feeling better gradually, though those rituals have no real effect.\nIn other words, if you believe in something and have anxiety, the anxiety will have physical symptoms eventually. You’ll have burning sensation in your body for example.",
              "votes": "13",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Most likely it's black magic. Best advice take it to a sheikh just to be safe, even if you don't believe in these",
      "votes": "20",
      "replies": [
        {
          "text": "Curious, what do sheikhs do with it?",
          "votes": "3",
          "replies": []
        },
        {
          "text": "hahahah !shikh ? the local BD mullah kno anything ! only hearsay",
          "votes": "-4",
          "replies": []
        }
      ]
    },
    {
      "text": "I thought it was hash haha",
      "votes": "6",
      "replies": []
    },
    {
      "text": "if someone wanted to protect you then there's no reason to be being secretive",
      "votes": "3",
      "replies": []
    },
    {
      "text": "This is black magic (Sihr). Its to curse the person living in the household but some also misguided into thinking its for protection.",
      "votes": "10",
      "replies": [
        {
          "text": "One man's curse is another man's protection!",
          "votes": "8",
          "replies": [
            {
              "text": "🤣🤣🤣",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Typically these are thought to be black magic items… can be used for either the good or the bad. Most cases they are bogus and people are duped out of money by pretentious spiritual personality.\nIf you guys are pious and follow guideline of Islam you should be okay seeking protection from Allah",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Looks like magic square which they use for black magic. You should prolly take it to a proper sheikh they'll know what to do.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "tasty, mix with tea to enhance the flavor.\nsomeone is looking out for you <3",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Remember, there are no such things like Black magic or white magic . magic is magic . it is a pure science & mathematics. what is the definition of magic ? when something happen right before your eyes & you do not have any clue how does it happen ! this is called magic . when you learn the secret of that mechanism ,for you it becomes science .\nwhen you use something to harm others it is black magic\nwhen you use same science to do good for others , it is white magic .",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Take some water in a bowl, recite 3 quls and ayat al kursi, and put these things in the water. It wont affect you anymore by the permission of Allah",
      "votes": "0",
      "replies": []
    },
    {
      "text": "count the number of taweej in total . i guess it is actually for protection.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "ব্ল্যাক ম্যাজিক না, তাবিজ এবং কুসংস্কার মনে হচ্ছে। ঘর বন্দিশা টাইপ কিছু। পেরেক রাখা হয় জ্বীন থেকে সেইফ রাখতে, জ্বীন নাকি লোহা ভয় পায়। বাকি দুইটা সাবস্টেন্সও সেই রকম কিছু হবে।",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Whether you think you it's white magic, or you think it's black magic--you're right.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Seems like dark arts",
      "votes": "1",
      "replies": []
    },
    {
      "text": "There's no such thing that you would need a nail for any Islamic ritual approved by hadiths. But reading Surah like Fatiha and blowing on skin or water is allowed.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 62
}