{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p82sdb/whats_your_opinion_on_the_bangladesh_cricket_team/",
  "hash": "3842060f70199bea3e92eff308742e9c",
  "scraped_at": "2025-12-08T19:44:55.694828",
  "title": "What’s your opinion on the Bangladesh cricket team?",
  "description": "That’s basically it.",
  "votes": "4",
  "comments": [
    {
      "text": "Bunch of motherfuckers sucking valuable resources of a poor country without giving anything. Players don't have the minimal love towards the game, to them it is a way to make money.",
      "votes": "8",
      "replies": []
    },
    {
      "text": "Don't take too seriously. It's an inconsistent team. It was always inconsistent and will be inconsistent.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Inconsistent and driven by politics\nThe batch of 2005-7 gave us some of the naturally talented players, that last decade couldn’t give",
      "votes": "6",
      "replies": []
    },
    {
      "text": "Been following Bangladesh cricket since 1999. Honestly, the only real high I’ve ever enjoyed was Shakib Al Hasan’s 2019 World Cup performance montage.\nSeen them throw so many games away. I have now stopped following them since last world cup.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Dog shit.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Most consistent inconsistent performance in cricket.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Same as our country, when people are good, good things will follow.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Mayer Doya Cricket Team sums it up",
      "votes": "4",
      "replies": []
    },
    {
      "text": "The stadiums have been almost empty for a few years now because people know that this team is garbage.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Laziest unprofessional team in the world. We are lucky only handful of countries participate in Cricket.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "They suck!",
      "votes": "3",
      "replies": []
    },
    {
      "text": "A lot more professional and spirited than they used to be. Probably in need of good coaching. A lot of their losses seem to be related to mental break downs.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Stop following them",
      "votes": "1",
      "replies": []
    },
    {
      "text": "That’s a fucking cricket team. They don’t deserve any support.The cricketer failed to repay the supporters love.The national cricket should be banned temporarily.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "What is it?",
      "votes": "0",
      "replies": []
    },
    {
      "text": "greatest cricket of all time...",
      "votes": "-2",
      "replies": []
    },
    {
      "text": "Without shakib al hasan,its nothing anymore",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Sometimes maybe good, sometimes maybe shit.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "It's a reflection of how the country runs. lol",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Baller rai wicket nei Baller rai run nei",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Bangladesh's cricket franchise is a blood-sucking key-jiggle that exploits the seemingly neverending love and pride the unfortunate gullible good-hearted people of this country have for their motherland and her flag but leaves them with NOTHING in return but heartache and embarrassment. Someone has already pointed out how cricket has become a \"wage job\" with huge income for this country just the way we treat professions like doctor or engineer. Man, we used to be such a lively and brave people once.\nHas Bangladesh ever won an international tournament in the entirety of cricket history?\nIn fact, let me give you my two cents opinion on cricket as a whole as well: why do we even play cricket? Bengalis are historically a footballing people. We just married cricket because our lovely indopak brothers chose that britisher sport. We took attention away from our passion but we are still in love with football, just under foreign south american colours. What a despressive petty! If we put all our shrom and bhalobasha towards football for the last 3 decades we couldve at least been a strong and reputed contender in Asia, instead we've been pouring all our passion and money into Indian Cricket Council's pockets for a lame sport no one in the world but 2 bazillion indians and their morubhumi neighbours to the west care about.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 64
}