{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p7z5s7/clinical_psychologist_counselor_as_career_in/",
  "hash": "fc71eb8b2a98367e874bd709c913c226",
  "scraped_at": "2025-12-08T19:45:16.266699",
  "title": "Clinical Psychologist/ Counselor as career in Bangladesh",
  "description": "I've always loved psychology and have considered pursuing mental health therapy as a career. But mental health & illnesses still aren’t very well addressed in the country, so I'm not sure if it'd be a good decision, still I'd like to give it a try. I'm putting this out here to learn more about how to become one as I got very little idea of it. Eg-which uni to get into, what degrees are required, whether they would be eligible in other Asian countries in case I ever settle somewhere else, how's the paycheck & work environment, what no one talk about being in this line of profession–stuff like that. I would also love to hear your experiences as a psychologist.\nSo, clinical psychologist & non-clinical psychologists folks here who has a grasp on the topic, do let me know. TIA",
  "votes": "3",
  "comments": [
    {
      "text": "Not an academic psychologist, but my honest opinion is that, there is minimal chances of any development of mental health in the future.\nLets talk about education. Our education is divided into three divisions - science, arts, and commerce. And people, even some of the most intellectuals see science students superior to other two, while it just might be the case of how a person's cognition works.\nWhat I am discussing does not even come to the light of psychology, as we are still stuck to issues like depression or anxiety, which aren't addressed either.",
      "votes": "1",
      "replies": [
        {
          "text": "Yeah growing up the domain of options seemed so narrow, it's like you have to choose either to be a doc or to be an engineer and if you go for any other profession, apparently it's because you failed in your main goal\nGiving importance to what others think when it comes to career paths is pretty dumb in this aspect in my opinion. So that's not my priority, however, there simply aren't much job opportunities for it—that's what my concern is.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Yes, you can definitely choose this as your career. But the university options are limited. The education is subpar. You have to be more self-learned if you want to be good at it. The pay and demand depends. If you are self-employed and a private practitioner, your income will depend on how desirable you are. Counsellors on average can charge 1500-2000 per hour in a session. But if you work a job, the salary won't be that good, maybe 40-60k, depending on the institution.",
      "votes": "1",
      "replies": [
        {
          "text": "Well let's discuss the uni opt, which places should be my target? And could you name some well known institutions with decent pay and if we are talking self-employed, how does one even start?",
          "votes": "1",
          "replies": [
            {
              "text": "DU, CU, JU, NSU, BRAC...there are others that offer psychology programs. I'm not updated on which ones are good, you have to search that a bit.\nSelf-employment means private practice, just like a doctor. No other institution will pay you a decent salary.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 65
}