{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pgj74n/%E0%A6%86%E0%A6%AE%E0%A6%B0_%E0%A6%A8%E0%A6%B0_%E0%A6%AC%E0%A6%A8%E0%A6%A7%E0%A6%A6%E0%A6%B0_%E0%A6%AC%E0%A6%AF_%E0%A6%B9%E0%A6%AF_%E0%A6%AF%E0%A6%93%E0%A6%AF%E0%A6%B0_%E0%A6%AA%E0%A6%B0_%E0%A6%95%E0%A6%AE%E0%A6%A8_%E0%A6%B8%E0%A6%AE%E0%A6%AA%E0%A6%B0%E0%A6%95_%E0%A6%AC%E0%A6%9C%E0%A6%AF_%E0%A6%B0%E0%A6%96_%E0%A6%89%E0%A6%9A%E0%A6%A4/",
  "hash": "1bb92189ca009e725bb4d8971fb5d486",
  "scraped_at": "2025-12-08T19:26:58.426728",
  "title": "আমার নারী বন্ধুদের বিয়ে হয়ে যাওয়ার পর কেমন সম্পর্ক বজায় রাখা উচিত?",
  "description": "শীতকাল চলে এসেছে, মুষলধারে বিয়ে হচ্ছে, আমার কয়েক বছরের নারী বন্ধুদের বিয়ে হয়ে যাচ্ছে, তো আমি ভাবছি ওদের বিয়ের পর আমাদের সম্পর্ক এবং বন্ধুত্বটা কেমন হবে, হ্যাঁ, আগের মতো আর গভীর সম্পর্ক থাকবেনা , এটা আমি মেনে নিয়েছি , এই ত্যাগ মেনে নেওয়া ছাড়া আর কোনও উপায় নেই , কিন্তু আমি চাচ্ছি প্রত্যেক বছর এটলিস্ট দুয়েকবার তাদেরকে টেক্সট দিয়ে খোজ খবর নিব (টেক্সট দিব কারণ বিয়ের পরে প্রায় সবাই অনেক দূর চলে যাবে , কুমিল্লার বাইরে ) এটা করা কি ঠিক হবে , নাকি আবার আমাদের সামাজিক প্রেক্ষাপট চিন্তা করলে ধরে নেওয়া যেতে পারে যে ওদের জামাই-শশুরবাড়ির লোকজন ঝামেলা করতে পারে? কারোর বৈবাহিক জীবনের সমস্যার কারণ আমি হতে চাইনা ।\nমোহাম্মদ শিহাবুদ্দিন রিয়াজ\nখেজুর ব্যবসায়ী\nকুমিল্লা",
  "votes": "3",
  "comments": [
    {
      "text": "Depends on a lot of factors. If their in-laws are very conservative, don't even bother. It's not worth it.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Oi bandhobi r shathe apnar friendship kemon shetar upor nirbhor kore. Apni jodi majhe majhe khobor nite text koren, bandhubi jodi oirokom e hoy je bujhbe apni kono jhamela toiri korben emon na, tahole toh kono problem howar kotha na. Karon shey toh apnake chenei, apni kemon. Tar husband er mentality kemon parle sheta jene koiren, onek lok thake tara abar onek possessive hoy. Oirokom lok hoile ektu distance maintain korai amar mot e bhalo hobe, tara ei jinish ta bujhbe na je apni emni khobor nicchen.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 7
}