{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p5x4u2/shia_community_in_bd/",
  "hash": "03b6a4d61a3e36282b4e4dc4e2bd47c3",
  "scraped_at": "2025-12-08T19:48:30.995099",
  "title": "Shia community in BD",
  "description": "Where are communities? How many are there? Any well known public persons who are Shia ?",
  "votes": "8",
  "comments": [
    {
      "text": "Apne Shia masjid a giye dekte paren",
      "votes": "3",
      "replies": [
        {
          "text": "shia masjid kothai ache?",
          "votes": "2",
          "replies": [
            {
              "text": "Mohammadpur",
              "votes": "3",
              "replies": []
            }
          ]
        },
        {
          "text": "it does not really answer my questions...",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "all the Bihari camps are Shia communities.",
      "votes": "2",
      "replies": [
        {
          "text": "completely or partially",
          "votes": "1",
          "replies": []
        },
        {
          "text": "Not at all , Not at all, I spend my entire youth in Mirpur 10, 11 , So once again i am saying not at all. Bihari's are flowwing the authentic essence of Islam. all 4 layers . & rituals.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "The Shia Muslim community in Bangladesh is very very very small, almost non-existent because the vast majority of Muslims here are Sunni Muslim or just Muslim (if they refuse and also don't want to identify as Sunni, Shia, other groups etc).\nI always heard the Bihari camp are all Shia.\nI have also heard from elders that the Ispahani group tycoons are (secretly, they never say openly because otherwise people will not buy their products) actually Shia because they're of Iranian origin ancestors who came here and most Iranians are Shia Muslim.\nIspahani = \"from Ispahan\" = from the name Ispahan , which is actually Isfahan, a city in Iran.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "They are highly spritual of all muslim, & closer to God . that is why they become enemy of isra@@ , & this is israili are openly saying . not common israili but israili minister & rabbi . check out youtube. for video .",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 76
}