{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p5c2sq/there_are_so_many_large_computer_shops_in_dhaka/",
  "hash": "fc8c506ab7200af32a5be52a318797d4",
  "scraped_at": "2025-12-08T19:49:04.339177",
  "title": "There are so many large computer shops in Dhaka like StarTech, Ryans, Techland, etc but which one is the best in your opinion?",
  "description": "I had a bad interaction with StarTech where they literally stole something from my PC so now that I'm about to buy some necessary accessories but don't know if I'm being sold previously used things or something. Are all these the same? Is there a better place to buy tech stuff in BD?",
  "votes": "4",
  "comments": [
    {
      "text": "I used to always buy from Ryans. Something about startech just feels like scammy. But it's always better to buy pc stuffs from small shops if you know them, that way you can get some discount and much better customer support than you would get from any of the big stores.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "None. I lost hope in all Computer parts in BD personally. Garbage RMA & business minded support as always. I personally import whatever I need from Thailand. If I need anything in particular on the run, I get it from PC Builder Bangladesh for the moment.",
      "votes": "3",
      "replies": [
        {
          "text": "How do you import from thailand? Are you an importer yourself or do you have a guy?",
          "votes": "1",
          "replies": [
            {
              "text": "Mostly use Gadget Import to get whatever I need.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Go to Ryan's, they are good.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 78
}