{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p4kaf8/which_sim_card_is_cheapest_right_now_banglalink/",
  "hash": "2d2c087b0e2030008ed9d091fb05fbea",
  "scraped_at": "2025-12-08T19:51:21.520710",
  "title": "Which SIM card is cheapest right now? Banglalink became too expensive.",
  "description": "Banglalink recently removed the custom plan I used to buy (100 Minutes / 30 Days for 110 Tk). Now, they are charging 177 Tk for the same 100 minutes! That's nearly a 60% price hike. On top of that, without a pack, they are charging me 0.46 Tk for just 2 seconds on a call. This is too expensive for me. I'm looking to switch. Does anyone know which operator offers the best value for minute packs right now? I usually need around 100 minutes a month.",
  "votes": "90635",
  "comments": [
    {
      "text": "Teletalk",
      "votes": "2",
      "replies": [
        {
          "text": "Specially internet packages. Other network provider charge almost double for same volume/meyad.",
          "votes": "2",
          "replies": [
            {
              "text": "Airtel Tong offer serves me great. Pretty strong and consistent connectivity as well.",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "but network khub e baje. airtel seems the best. tong offers onek joss for internet.",
          "votes": "4",
          "replies": [
            {
              "text": "Yap, not the slightest improvement in Teletalk's network. Conversely, Airtel and their Tong offer is a great choice to have.",
              "votes": "4",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "By far, Teletalk is the cheapest for both data and minute packages.\nBanglalink is an asshole sim company. I used to buy a data pack of 2GB and around 30-40 minutes at 110 something, for 30 days validity. It was a so-called \"my offer\" package, only for me. I was a regular for that package. But after a few months, they increased the price to 140 something. I still used to buy that, cause compared to other sims, that was way cheaper. And they kept on increasing the price, to the point it was around 250 something. Then I realized how they're scamming customers if they find out you're getting used to some package. I've stopped spending any money on banglalink since then.",
      "votes": null,
      "replies": [
        {
          "text": "Real bhai.. just birokto hoye gesi oder ei kaje",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": null,
      "replies": []
    },
    {
      "text": "Ryze check out kore dekhte paren and apni jehutu bnglalink user no. transfer krte parben",
      "votes": null,
      "replies": []
    },
    {
      "text": "A few days back i got a new ryze connection for cheap internet now only to find out that airtels one is way cheaper. Can i switch my ryze connection to airtel anyhow?",
      "votes": null,
      "replies": []
    }
  ],
  "id": 86
}