{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p3t08g/dhaka19_nafsin_mehanaz_azireen_bihari/",
  "hash": "383a2a33f2b78b44ab526b32b1eeb7e8",
  "scraped_at": "2025-12-08T19:53:13.327921",
  "title": "Dhaka-19 : Nafsin Mehanaz Azireen - Bihari?",
  "description": "Is that rumor true? - similar to Faham Abdus Salam\nThis might explain partly her Pakistan advocacy",
  "votes": "1",
  "comments": [
    {
      "text": "চুপ্পু আমাদের পাবনা এলাকার, ও বিহারি হতে যাবে কোন দুঃখে, একইসাথে খালেদ মাসুদ পাইলটও বিহারি না।।",
      "votes": "8",
      "replies": [
        {
          "text": "চুপ্পু আমাদের পাবনা এলাকার, ও বিহারি হতে যাবে কোন দুঃখে, একইসাথে খালেদ মাসুদ পাইলটও বিহারি না।।",
          "votes": "4",
          "replies": [
            {
              "text": "i am telling u , 100% Bihari, they speak hindi inside home. have you heard the name BSRM , the entire company is owned by Pakistani , Yellow & Beximco owned by Salman F rahman is pure Pakistani, Chairman of Beximco group Sohel Rahman living in Pakistan & blood brother of Salman f Rahman . i can tell u 100 more name .",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "Tamil iqbal having non Bengali origin is well known. But the others I do not believe you… you mean Elias Hossain ?",
          "votes": "2",
          "replies": []
        },
        {
          "text": "President Chuppu is a freedom fighter. What's the source he's bihari?",
          "votes": "2",
          "replies": [
            {
              "text": "",
              "votes": "0",
              "replies": []
            }
          ]
        },
        {
          "text": "Akram Khan, Tamim Iqbal’s uncle too",
          "votes": "2",
          "replies": []
        },
        {
          "text": "This post was removed as it breaks reddiquette, which is a set of guidelines that all users of r/bangladesh follow in order to make the subreddit a civil discussion space.\nThis also includes discrimination or offensive language which is not tolerated here. This includes racism, misogyny, xenophobia, homophobia, and/or religious discrimination.\nBe civil. Remember the human that you're interacting with.\nWhile your post may have had substantive content, either right or wrong, we have had to remove this in order to be fair about enforcing the rules. Thank you for understanding.\nRule #1. Follow Reddiquette.\nএই পোস্টটি সরানো হয়েছে কারণ এটি রেডিকেট লঙ্ঘন করেছে। রেডিকেট হলো একটি নিয়মাবলী যা r/bangladesh এর সকল সদস্য মেনে চলে, যাতে এই প্ল্যাটফর্মটি শালীন এবং গঠনমূলক আলোচনার পরিবেশ বজায় রাখতে পারে।\nএই সাবরেডিটে কোনো ধরনের বৈষম্যমূলক বা আপত্তিকর ভাষার অনুমতি নেই। এর মধ্যে পড়ে বর্ণবাদ, নারীবিদ্বেষ, জেনোফোবিয়া, কুইয়ারফোবিয়া, এবং ধর্মীয় বৈষম্য।\nআপনার আচরণে শালীনতা বজায় রাখুন। মনে রাখবেন, যার সঙ্গে আপনি কথোপকথন করছেন, তিনিও একজন মানুষ।\nআপনার পোস্টে হয়তো গুরুত্বপূর্ণ কিছু বিষয় ছিল, তবে নিয়মের প্রয়োগ নিশ্চিত করতে এটি সরাতে হয়েছে। বিষয়টি বোঝার জন্য আপনাকে ধন্যবাদ।",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "there are lots of us having one side of their parents tied to bihari origin. Its pretty spread out. 15/20 years por Rohingya origin niyeo same jhamelay amra porbo. Either give them full recognition or force them out. Make a clear path how to naturalize them. My proposal is they sould be made to take oath infront of a judge about upholding our Bangladeshi culture, history and Liberation war.",
      "votes": "3",
      "replies": [
        {
          "text": "Interesting take - but agree liberation war is non negotiable",
          "votes": "2",
          "replies": []
        }
      ]
    }
  ],
  "id": 93
}