{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p3o7zm/is_the_news_of_bangladeshi_exodus_from_india_true/",
  "hash": "38cc88ec299a7e11087a1c12384b7459",
  "scraped_at": "2025-12-08T19:53:46.820050",
  "title": "Is the news of Bangladeshi exodus from India true ?",
  "description": "Most major news channels are displaying this news and its also followed by interviews and apparently the flow is too large that they have to wait for days until they pass Is this true ? Or propaganda ?",
  "votes": "6",
  "comments": [
    {
      "text": "Bangladesh and India’s per capita GDPs are almost the same. Why in the earth will Bangladeshis migrate to India other than for religious reasons? Indians don't want to stay in India, the Indian government is talking about Bangladesh. Economically it doesn't make sense.",
      "votes": "20",
      "replies": [
        {
          "text": "",
          "votes": "-6",
          "replies": [
            {
              "text": "There are many people from Bangladesh who go there for shopping too. I'll not be sure that the people whom you are thinking Bangladeshi are illegal Bangladeshi.",
              "votes": "7",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "No, thats just another propaganda from delulu indian media.",
      "votes": "12",
      "replies": [
        {
          "text": "https://youtu.be/K9Zgg-0_GzA?si=6NBA6FIBHmPwQGsq\nWhat do you think about those interviewed here ?",
          "votes": "3",
          "replies": []
        },
        {
          "text": "i live in west bengal its true - too many ppl from bangladesh - i get your point but why they come even then is beyond me",
          "votes": "0",
          "replies": []
        },
        {
          "text": "Are y'all Bangladeshis absolutely unaware of the new SIR bill. Don't live under a rock. Its insane how y'all just say we are in delusion, while the real delusions are in your own head. Ofc our media might be bullshit(BD isn't any better), but its not about the media, its the ground reality. We are more democratic than your country, our legislature has literally passed bills and had debates, this isn't some propaganda circus. I can provide tons of videos of illegal immigrants originally from Bdesh. They are in insane numbers. One can easily spot their communities in either WB/NE or some tier 1 cities of western mainland.",
          "votes": "1",
          "replies": [
            {
              "text": "Give us back Sheikh Hasina first",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "It is interesting that the illegal BD immigrants became a hot topic as soon as the previous regime fell in August 24.\nThen, the \"influx\" illegal BD are primarily BAL criminals. So if your country can kindly handle them over so we can judge and that would be nice, starting with their queen of terror.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Not entirely true!!!\nOnly pushing in happens.\nThe bulk of them reroute to southern Indian states, Sri Lanka, and Nepal.\nCurrently, the India-Bangladesh border is heavily guarded, although Sri Lanka to South India, Nepal to Uttar Pradesh, or Bihar is more accessible.\nThose who can make an attempt to reach Dubai\nRohingya are primarily rerouted to north Indian states, although some try to reach Indonesia.\nsealdah and howrah railway station",
      "votes": "0",
      "replies": []
    }
  ],
  "id": 94
}