{
  "url": "https://www.reddit.com/r/bangladesh/comments/1nltwvk/what_if_i_dont_choose_du_or_buet_for_cse/",
  "hash": "dc9ace88b88074e84ce118bcad961f13",
  "scraped_at": "2025-12-10T01:19:43.856844",
  "title": "What if I don't choose DU or BUET for CSE?",
  "description": "Yes, you got it. I'm an admission candidate(Male) and extremely passionate for Computer Science. Since BUET and DU offers good academics in BD on this sub, but considering health hazards, every spheres of pollution, bad living standards with a high cost, heavy metals-microplastics and poisonous food, bad people here and there, no security of life, traffic jam and many more (yk)...\nIt just feels swimming inside a pool of hazards which feels much heavy mentally and make huge workhour losses.\nAs I'm passionate guy on CS, I prefer focusing on AI/ML, Blockchain Technology, IoT and relevant stuffs sitting on my PC in a corner.\nIf I admit to KUET or Khulna University, would it be a major loss?\n(Remember I'm a self learner, less focused on varsity curriculum as it lacks upgradibility by default)",
  "votes": "2",
  "comments": [
    {
      "text": "Buet. But yes, u need to adjust a lot. Especially environmental wise.\nBut a lot of ppl cn do it.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Well, u know dhaka's university are very good for learning and learning environment.\nAlso u cn get best of ppl in those places. U will meet aspiring professors. So yeah u will miss a good deal. Especially for buet.\nDu te, especially at junior yrs e atto valo paba na. Karon du te standard ektu outdated. Avoid du unless its iba or fbs.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Also brac and aust are also very good. Better teaching professionals.\nAnd also better part of dhaka city. With plants an greens.",
      "votes": "1",
      "replies": [
        {
          "text": "I think private unis are better than public unis. Except bckruet",
          "votes": "1",
          "replies": [
            {
              "text": "This depends on specific uni. But yeah, as long as u r from top 5 for specific subs, u r good.",
              "votes": "1",
              "replies": []
            },
            {
              "text": "Public uni wld be ten times better and even asias rank. If there was no uni politics. Politics ruin everything. And also a lot of outdated curriculum.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 101
}