{
  "url": "https://www.reddit.com/r/bangladesh/comments/1nl53i4/this_may_be_a_bit_of_a_silly_question_but_im_very/",
  "hash": "00f1017774f57cb4c5df93f7ea29c547",
  "scraped_at": "2025-12-10T01:20:15.883531",
  "title": "This may be a bit of a silly question, but I'm very anxious about this. Would retaking courses for better grades in University impact future prospects?",
  "description": "I'm currently a uni student about to enter into my 4th semester. My first semester was a typical 6 month semester, however, 2nd semester on , our university has decided to revert back to 3 semesters a year, which has been causing some problems for me.\nIn my second semester, I received a C+ in one course and retook it during my 3rd sem, where I was able to raise it to an A. During my 3rd semester, I received a C- in a course and am planning to retake that during my 4th semester.\nWill any of this have an impact on applying for further education abroad or even for job applications, or will the people in charge just look at my final Cgpa and decide whether or not they accept me based on that? ( I am aware jobs will look at my skillset and Masters/PhD hosts will look at other extracurriculars, but I am strictly talking about grades here.)",
  "votes": "1",
  "comments": [
    {
      "text": "No, but it is difficult to raise a grade unless you do really well, I.e. average of c(2) and a b(3) is c+(2.5). Only in specific cases like joining in university or applying for higher education may there be some effect but not significant if you do not do it regularly.",
      "votes": "2",
      "replies": [
        {
          "text": "Thank you. I'll keep this is mind.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Nope, not a problem. Your final transcript will only have one grade per course. Retake them as many times as you want and as many times your uni allows...",
      "votes": "1",
      "replies": [
        {
          "text": "Thank you for your insight.",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 103
}