{
  "url": "https://www.reddit.com/r/bangladesh/comments/1nbpfdi/cse_vs_cs_which_is_better_for_jobs_and_for_a/",
  "hash": "2d33cabc3587b3463103387498eb1155",
  "scraped_at": "2025-12-10T01:22:50.009054",
  "title": "CSE vs CS — which is better for jobs and for a master’s in the US/Europe?",
  "description": "I’m doing my undergrad in Computer Science & Engineering (CSE) and considering switching to Computer Science (CS). In terms of job demand in Bangladesh and abroad, and for future master’s opportunities in the US/Europe, which one would be a better choice?",
  "votes": "6",
  "comments": [
    {
      "text": "It's all the same unless you go to government services that requires you to have an engineering degree for promotions after a certain age. Most importantly, learn how to code. That's all that matters, specially when it comes to work.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "CSE. The syllabus is very widely accepted and you can't go wrong. It has a mix of both theoritical and engineering subjects, you can choose specialization later if you want to do Masters.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Can't speak for jobs, but for postgrad in the US, EU, go with the one which has more math and statistics training.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "the difference ain't that much, most people use it interchangeably",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 113
}