{
  "url": "https://www.reddit.com/r/bangladesh/comments/1nautt9/anyone_studying_in_hong_kong/",
  "hash": "1ee7e1c8669d2b088cb71fb7cbbb4dcb",
  "scraped_at": "2025-12-10T01:23:25.610425",
  "title": "Anyone studying in Hong Kong",
  "description": "Anyone here studying in Hong Kong from NCTB background in unis like (HKU,CUHK, CityUHK,PolyU) and got a full scholarship. What are the requirements to get in to business related major like finance,Quantitative finance,Fintech .Can someone manage his own living cost even if he doesn't get that much help from family. Feeling really confused about that as there isn't much information I could find about it .",
  "votes": "4",
  "comments": [
    {
      "text": "Hey, I'm currently in HKUST. From what I know NCTB isn't that well recognized within the big 3 (HKU, CUHK, HKUST), so you need to look for CityU, PolyU at best. In fact most NCTB people, IF ANY, are there. Unless you have an international Olympiad achievement, the big 3 doesn't have any scholarship to offer.",
      "votes": "2",
      "replies": [
        {
          "text": "It shows this when I go to unis like HKUST, CityUHK, and CUHK so I was confused bcz lots of people say they don't admit from NCTB . I'm also going to give the SAT is that going to compensate for my NCTB background.",
          "votes": "1",
          "replies": [
            {
              "text": "These are MINIMUM requirements, to get just the admission. Scholarship criteria are vastly different, and usually very high.\nAnd in fact you shouldn't be aiming for the minimum anyways. When I applied to HKUST, the \"minimum requirements\" were ABB or something, but the average applicant had an AAA, so it's hella competitive.\nYour best bet would be to get gpa 5 and then apply for early round to polyU or cityU. You may consider HKBU as well. But as it stands now, UST and CUHK aren't options for you. You may try HKU, I heard there are a few NCTB ppl",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 115
}