{
  "url": "https://www.reddit.com/r/bangladesh/comments/1nasldy/why_did_you_miss_your_chance_in_medical_admission/",
  "hash": "a77a3f7165c30b1d4a035bb0a361c6a0",
  "scraped_at": "2025-12-10T01:23:56.102451",
  "title": "Why did you miss your chance in medical admission?",
  "description": "Tell me mistakes you've made during your admission journey that caused you to not get into medical.",
  "votes": "7",
  "comments": [
    {
      "text": "poralekha korinai.sobsomoy vabsi kal theke thik hoye jabo, kintu shei kal ekhn projonto ashenai",
      "votes": "7",
      "replies": []
    },
    {
      "text": "By the time I took medical admission exam, I already got into good position in buet. I overslept and didn't go to DU exam, but had to go to medical exam due to family pressure. Without any preparation, got a chance to go to Rongpur medical, didn't take it.",
      "votes": "6",
      "replies": [
        {
          "text": "That's insane. Good for you dude, can't imagine how smart you'd have to be to only get into buet but also medical without any effort. Do you have any tips? For admission generally?\nAlso if you chose to study in buet, what are you studying in?",
          "votes": "3",
          "replies": [
            {
              "text": "Welp, I was a good student, at least in school and college, studied on time and even liked some of the subjects. Studied electrical engineering in buet. But it was a long time ago now.",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Prep nei nai kintu ammu pathaisilo exam dite",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Though my target was Engineering, I wanted to be selected in medical as a backup( because there was no assurance of cracking BUET) The worst mistake was underestimating and poor preparation. I never took any model tests or practice exams to practise. So what happened in the first few minutes of the exam I misplaced 3-4 answers. Like for 21 22 23 24 question, I filled the circle of 22 23 24 25. Secondly, I always avoided biology throughout both years in college. I only took prep for biology with 5 chapters of botany and 6 chapters of zoology to pass hsc exam. That seems outrageous but it was true. So as a result when I started taking prep for the medical exam there was not enough time to go through all the chapters of botany and zoology. I also underestimated English and GK. So as a whole, the preparation was way too low. Though I secured a place on the waiting list and later got called in to Netrokona Medical, the exam was a nightmare for me.\nSo I will suggest taking things seriously and not leaving any stones unturned while preparing.\nBest of luck",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Umm. I wasn’t interested at all!",
      "votes": "2",
      "replies": []
    }
  ],
  "id": 117
}