{
  "url": "https://www.reddit.com/r/bangladesh/comments/1n8hrua/need_advice_on_english_spoken_proficiency/",
  "hash": "e98d9879a3f0f8b1e280dc5ab227ac94",
  "scraped_at": "2025-12-10T01:24:11.899173",
  "title": "Need advice on English spoken proficiency",
  "description": "Hi,\nI am working with an overseas company remotely. My work is like doing backend tasks. I mean I have assigned tasks via a platform then submitted my tasks when its done. The task requirements are written well, if need clarification then discuss with the team.\nRecently, I have to conduct meeting with the business holder or clients. There I need to conduct presentation, share demos, gather requirements etc.\nThe problem is I can understand what they say, I mean my listening skill is good but not the spoken skill. I can manage short conversion or meeting without a problem but when it takes long time then I am out of words or struggle to manage words. Sometime my struggle got noticed easily. Besides I have pronunciation problem as well.\nI have noticed that because of spoken proficiency, at many important meetings I did not get invitation for the presentation, although the task was done by me. I am feel very disappointed.\nAs a Bangladeshi, I think its a common problem for many of us as we don't have much places for practicing.\nI have heard about spoken course, IELTS etc. Should I enroll one of them? Are those really helpful?\nOne of my juniors shared his experience like these are not that helpful instead I can practice at home at regular basis.\nSo can you guys suggest me what can I do? I am reside at Dhaka.",
  "votes": "4",
  "comments": [
    {
      "text": "Find someone, preferably someone with near-native English skills, to practice regularly with. Avoid IELTS speaking courses, they will simply teach you tips and tricks to get a good IELTS speaking score, it won't help you improve your natural conversation skills.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Unis like nsu and brac have English speaking courses. I strongly urge you to join those.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 118
}