{
  "url": "https://www.reddit.com/r/bangladesh/comments/1n7d7ai/some_questions_regarding_on_ahsanullah_university/",
  "hash": "7866f8f3637e0da6057fbd13c2fa06f7",
  "scraped_at": "2025-12-10T01:24:42.372663",
  "title": "Some questions regarding on Ahsanullah University",
  "description": "So this year I've finally finished my CAIE A levels and I'm planning to apply for Ahsanullah University(AUST). Now my questions is that how is the environment of AUST? Is the quality of education good? Are the academic services better? How good is the research faculty for undergraduation? How good are the courses for CSE, EEE, ME & CE? Just be brutally honest. I'm a person who barely has any idea about this University. Also, people who are currently studying in AUST for undergraduation(bachelors) should answer these questions.",
  "votes": "3",
  "comments": [
    {
      "text": "I studied CSE at AUST and graduated in 2023. AUST follows BUET’s curriculum, though back then it was based on the 2011 version. Now it has been updated. As far as I know, it is still a fixed credit system, not open credit.\nSome professors are really into research and encourage students to get involved from 2nd or 3rd year. You can check their published papers if you want to see the quality.\nSome profiles:\nhttps://www.aust.edu/cse/faculty_member/prof_dr_md_shamim_akhter\nhttps://www.aust.edu/cse/faculty_member/mr_faisal_muhammad_shah\nhttps://aust.edu/eee/faculty_member/prof_dr_bobby_barua\nhttps://aust.edu/eee/faculty_member/prof_dr_md_meganur_rhaman\nI also know students from EEE, ME, CE, and IPE, and the workload is heavy in all departments. You are always under pressure, so if you prefer a relaxed approach, AUST may not be the right place.\nAdmission is tougher compared to Brac or NSU. I got into those too, and their exams were much easier. For AUST, you need to practice past engineering admission questions from BUET, CUET, and RUET.",
      "votes": "2",
      "replies": []
    }
  ],
  "id": 120
}