{
  "url": "https://www.reddit.com/r/bangladesh/comments/1n5huc9/i_got_a_verified_foreign_masters_degree_without_a/",
  "hash": "a4301e678b3b2d4cfd3a82102571a561",
  "scraped_at": "2025-12-10T01:25:14.049036",
  "title": "I got a verified foreign Master's degree without a Bachelor's degree. AMA.",
  "description": null,
  "votes": "2",
  "comments": [
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "How'd you do it?",
      "votes": "1",
      "replies": [
        {
          "text": "Prior relevant work experience, persistence, autodidactism and convincing SOP.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Does your MS certificate says it is online?\nHow much did it cost for you?\nMS is it s specialization? Useful? Given you might not have the core understanding?\nHow did you clear the prerequisite courses? As some universities i went dont allow core subjects to be transferred.\nDoes WES mention about it being an online degree?\nDoes Canadian evaluation gives you 15 even it is online?\nAny good luck",
      "votes": "1",
      "replies": [
        {
          "text": "No, no such distinction was made. But I did part-time, and that is evident on the transcript.\nAt the time it was half the cost of the on-campus, 10K GBP less developing world discount 8k GBP. Plus the Aussie PGCert course I did around 3k AUD (just for one course!) No discount there. So total for my specific situation still came to around 10k GBP. Forgot what the BDT exchange rate was at the time (2016) but definitely lower than now. Another unfortunate thing is that this specific course is no longer offered, and tuition fees in the UK have definitely risen.\nWell not specifically specialization but just advanced level studies of a discipline. I was able to prove \"core understanding\" with my proof of prior work.\nThere was no formal prerequisite in this particular programme aside from the requirment of a Bachelor's degree in the same field \"or equivalent\". This of course would vary case by case, country by country. In some cases a formal recognition of prior learning (RPL) may be conducted by either the uni or third party (in Australia for e.g. the ACS does this vetting for IT professionals but I don't have direct firsthand experience).\nNo, WES makes no statements other than equivalency. They do transcript evaluation and know what corresponds to what in their (Canadian) system. Not sure about the US. ACS in Australia however requires Bachelor's degree in the standard application (not RPL). I do not yet know if they will accept the Master's alone.\nYes, full Express Entry points for Master's degree.",
          "votes": "2",
          "replies": [
            {
              "text": "Good for you!",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Help you into a good university, it matters",
      "votes": "1",
      "replies": [
        {
          "text": "Help you into a good university, it matters",
          "votes": "1",
          "replies": []
        },
        {
          "text": "I forgot to also mention in the OP that I am a high school dropout. As in, I did very badly. In addition, I was a former NRB. So in my experience, it mattered less and less the older I grew and the more experience I had. I started my career online, so I cannot talk about the local BD job market. When starting out, especially in certain fields, unfortunately it does matter. In tech, however, you will see that recruiters in even India are no longer asking for degrees. But the Asian mentality is still around, so you are more likely to be judged in this part of the world for poor results when you are just starting out. But give it some time, persevere, and show people what you can do.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "which university and what subject?",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 122
}