{
  "url": "https://www.reddit.com/r/bangladesh/comments/1n3wl3s/help_needed_hsc_student_wanting_to_apply_in_the/",
  "hash": "f363d1081940a3841e886bc04b44f300",
  "scraped_at": "2025-12-10T01:25:31.462259",
  "title": "Help needed (HSC student wanting to apply in the USA)",
  "description": "I am currently studying in the Higher Secondary Certificate (HSC) program in Bangladesh. I have completed my first year of HSC. Am I eligible to apply to US universities using my first-year results along with predicted grades for the second year, or do I need to complete the full HSC program before applying?",
  "votes": "5",
  "comments": [
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "It would be possible if you had International Olympiad achievements. Can’t assure in other cases. But they still want you to complete your education in BD",
      "votes": "1",
      "replies": [
        {
          "text": "I haven’t done any international olympiads, but I’ve done an exchange program and a few funded project programs overseas, I am trying to gather all my EC’s together to make a compelling application for myself, I just wasn’t sure if I could apply with my 1st year results + predicted results to US universities. Thank you very much for answering. And of course, I do plan to finish HSC before I go since that’s a prerequisite to get admitted. Would you think it’s better to apply after completely finishing HSC or should I apply with 1st year results + predicted results if I have a good application?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Even if you secure a offer letter and scholarship, chances are 99% that visa would be rejected.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 123
}