{
  "url": "https://www.reddit.com/r/bangladesh/comments/1muqfsr/second_time_the_admission_lore/",
  "hash": "5b67e6860228aeb149a440573d2320d3",
  "scraped_at": "2025-12-10T01:27:38.624981",
  "title": "Second Time: The Admission Lore",
  "description": "Getting into Jahangirnagar University on my second attempt was the turning point of my life. I got into Accounting. I also got English—but hey, I’ve already been reading that for over 15 years. I could’ve even gotten Law if I’d stayed for the migration.\nThe second time opened doors that the first attempt didn’t even let me imagine. My first admission journey didn’t just fail me—it broke me. I was already struggling, but that year tore apart whatever was left.\nWhen I was 13 or 14, I discovered Tony Stark. A nerdy genius with all the power in the tech world. Like every kid, I wanted to be like him. But unlike most kids, I wanted it desperately. I dreamed of becoming a CSE engineer like my cousin, believing it would bring me closer to Tony. The truth? I didn’t know anything about coding or programming. My entire idea came from TV screens.\nThen in college, we were made to study C+ programming. Just the basics. But even then, I realized—I wasn’t getting it. I wasn’t cut out for this. Forget building an arc reactor, I could barely make sense of simple code.\nLike every other student, I ended up at Udvash, chasing engineering. My parents had wanted me in varsity, but I was stubborn. I hated them, so why obey? I wanted to prove everyone wrong—to prove how glorious I could be. But the first weekly exam hit, and reality slapped me in the face: engineering wasn’t for me. By then it was too late. Too much money, too much ego was already invested. I stuck it out until the end, but I got nothing. Not even a place on a waiting list.",
  "votes": "2",
  "comments": [
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 131
}