{
  "url": "https://www.reddit.com/r/bangladesh/comments/1mt8vaw/legal_notice_seeks_removal_of_darwins_theory_from/",
  "hash": "36149f650205316ed3d29d5726f35535",
  "scraped_at": "2025-12-10T01:28:26.682720",
  "title": "Legal notice seeks removal of Darwin's theory from Class 9-10 science textbook",
  "description": null,
  "votes": "32",
  "comments": [
    {
      "text": "This is ridiculous",
      "votes": "20",
      "replies": []
    },
    {
      "text": "wtf? Secondary tei to manush Evolution theory sikbe. Actual science o ki porano jabe na?\nFucking Clowns.",
      "votes": "22",
      "replies": [
        {
          "text": "",
          "votes": "-25",
          "replies": [
            {
              "text": "it's the most scientifically backed and well accepted theory. And these are supposed to be taught in School.",
              "votes": "22",
              "replies": []
            },
            {
              "text": "Its nicknamed Darwin’s theory of evolution because obviously people like you will play with semantics all day",
              "votes": "6",
              "replies": []
            },
            {
              "text": "Darwin's theory IS evolution",
              "votes": "11",
              "replies": []
            },
            {
              "text": "If you don't know how foolish that comment is then you've probably got pigeon DNA in your chromosomes as they're the dumbest bird.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "They are straight up lying about the Cambridge curriculum. The theory of Darwin is present clearly in the GCSE biology curriculum. The government is now full of liers. Always has been. I'm done with this country.",
      "votes": "17",
      "replies": [
        {
          "text": "Government? It's a lawyer, they throw all sorts of shits as legal notice.",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "How do you learn biology and not study evolution some of these people dont even understand the concept maybe for them manush banore theke crap",
      "votes": "5",
      "replies": []
    },
    {
      "text": "So he states that the theory of evolution is a strain for kids minds (which is dead simple to be taught to SSC/equivalent level students), and then goes on to further back it up with\nSarwar further stated that the notice was sent in public interest as Bangladesh is a Muslim-majority country.\nWhile also suggesting that people can learn it at later stages of education. So is he admitting that Darwin's theory is still useful? While also saying that Islam says it's false and hence should be discarded?\nthe theory was included in the curriculum during the previous Awami League government\nOkay, and? How is this relevant to the part of Evolution being \"irrelevant\" to the syllabus? Almost feels like dude's trying to scapegoat it to AL, or trying to say \"remove Evolution from Syllabus, cuz AL introduced it and they're bad\".\nAlso apparently Cambridge IGCSE Biology Specification doesn't mention \"Darwin's theory\" or the term \"evolution\" but it does include variation and selection (pg 39). I'm not sure how Cambridge goes on about Darwin and evolution in their book or exams. But I can say that Edexcel IGCSE biology has mentioned Darwin in similar sections though. And also Evolutionary concepts mentioned in the question papers",
      "votes": "2",
      "replies": []
    },
    {
      "text": "I feel sorry for the future generation of our country.\nI really feel sorry for all the people who were groomed as a child and brain washed to do this.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Darwin's theory is literally the foundation of evolution. It is not that complex for secondary studies. Bro is just lying at this point to get his work done. And just because is a muslim-majority country doesn't mean you can teach topics that doesn't aling with Islam. That's not how education work. Its such a stupid demand which surprisingly a lot of people agrees with. Are we really this much allergic to intelligence?",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Well well well",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 134
}