{
  "url": "https://www.reddit.com/r/bangladesh/comments/1mo74hy/how_much_do_alevels_actually_cost_business_stream/",
  "hash": "a2bbac656ffadc0cf5ee76d8828601b5",
  "scraped_at": "2025-12-10T01:29:48.188719",
  "title": "How much do A-Levels actually cost?? (Business stream)",
  "description": "Heyy, so I’m planning to do my A-Levels in the business stream and I’m kinda lost about the expenses. Like… from the subject course fees i mean tuition, to exam registration, to the per-exam fee how much does it all add up to? And also, how many subjects are actually “core” for the business stream? Basically I’m trying to figure out how much I’d need to cover the whole A-Level thing from start to finish. If anyone here has done it, especially in business, can you drop some numbers or your own experience? Thanks in advance, you’d be saving me from a budgeting nightmare lol.",
  "votes": "4",
  "comments": [
    {
      "text": "I only did CIE exams so this is all I can help you with:\nThere are no 'streams'. You pick whatever subjects you like.\nI remember each exam being about 20k and you have to do at least 3 (can do 2, but I wouldn't recommend it), so at least 60k to 80k for exam fees.\nCoaching costs (if you choose to do this) - roughly 3k but subject per month, so about 10k ish per month. I think it's a bit lower if you only do mock exams at a coaching center instead of full lessons.\nBuying question papers and textbooks - question papers you can probably still get online, so unless you prefer physical papers, you can skip this. Otherwise I'd budget about 600 for each QP set (can be more expensive if a book has way more QPs than expected). For textbooks I'd budget at least 1,500.\nHope this helps!",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "A-Levels are split into two years; AS and A2 (CAIE wise). Expect to spend upwards of 40k+ taka for each subject in both years. Commerce subjects tend to be a tiny bit cheaper than Sciences. If you take Accounting, Economics and Business then you'd be around 65-70k ballpark for AS.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 139
}