{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p9m1ug/being_a_doctor_after_bsc/",
  "hash": "5dccf363a7f36b364851e862d1079936",
  "scraped_at": "2025-12-10T00:56:50.355807",
  "title": "Being a doctor after BSc?",
  "description": "I wanna know if i complete my bachelor in Genetic Engineering/Chemistry /Biochemistry from BD , then is there any way to complete MD degree or become a doctor in abroad at post graduate or masters level.",
  "votes": "3",
  "comments": [
    {
      "text": "Yes you can. You can get admitted to a MBBS/MD program abroad after finishing BSc, but it's not possible in BD.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "na hobena. Italy germany howa jete paare but the real problem is that you wouldn't be able to practice in bd as a doctor. BMDC theke exam e boshe min 40 pete hoy. Eta thakle you can go for it. But still, make sure that you're not doing it for anyone else or any sort of validation. Medicine should be pursued only if there's endless dedication.",
      "votes": "2",
      "replies": [
        {
          "text": "Parbe to. Baire theke graduation kore ashle bd te licensing exam diye practice korte parbe.",
          "votes": "2",
          "replies": [
            {
              "text": "your info is not updated for 2025. med admission test e boshe 40 peye pass kore bmdc cert nite hobe. Tarpor abroad theke course kore eshe ekhane licensing exam e boshte parbe, but in OP's case jabena guessing that he didnt take MAT.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "(Disclaimer: not doctor, not my field)\nThe MD or MBBS degree is a separate lengthy degree by itself. In the US, students normally have a bachelor degree before studying medicine instead of studying medicine straight away from finishing high school/secondary school like here and other countries.\nBut yes, you could apply for MD/MBBS admission abroad and study to become a doctor. For example, let's say you apply for 6 year MD program (to become doctor) at some European university, for example in Hungary or Czechia. I heard of many international students from many countries studying there. After you graduate you can work as full-time doctor in Europe or even UK.\nEDIT:  Just for clarification, many MD graduates from universities in European countries who come from Asian and African countries are successfully working in places like UK NHS after graduation.\nAlso, both UK and Europe have a dentist shortage (very difficult to impossible to register in many clinics as first time patient for tooth care due to severe shortage, very long months-year wait) and UK and US have (in general, all specialties) serious doctor shortage, so they need doctors.",
      "votes": "1",
      "replies": [
        {
          "text": "Are they taking in applications? How can I apply 🥹",
          "votes": "1",
          "replies": [
            {
              "text": "It's a lot of information all over the place so you will have to Google.\nYou have to search for universities in Europe that offer medicine programs to non-European/international students.\nYou have to look at the length, how much time it takes? 6 years or less or more. Can you also do a residency to practice what you studied and is it included in the program or you have to pay extra money because it's separate?\nYou have to look at the costs. The universities in South Eastern Europe and Central Europe are very popular for international students because tuition fees are cheaper and living costs are lower compared to other (Western) countries. And check for any scholarships or tuition waivers.\nSince these countries (but even other European countries anyway) can be really racist you want universities that has a good international student population or attracts many international students.\nYou have to also look at the rankings of the universities you're interested in.\nAnd also you have to contact the international office and talk to student ambassadors online with questions that you have, whether they are taking applications and in which intakes, like September or January or whenever.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 14
}