{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ml1eko/want_to_teach_math_or_eng/",
  "hash": "44eb302106ef4155201f4bbd385e4273",
  "scraped_at": "2025-12-10T01:30:54.603138",
  "title": "Want to teach (math or eng)",
  "description": "I come from a well off, prestigious family.as a boy im kinda introverted. However my family's financial condition isnt up to the mark.im in class 9th ideal school & college motijheel dhaka. Science division.i want to teach maths to juniors i love maths yet my result is bad😔.ill try teaching for 1 month for free only math and if u like me hire me and if u dont its okay. Looking for 500tk/month.my dad got really sick from the tension i just want to do something.",
  "votes": "3",
  "comments": [
    {
      "text": "try looking for juniors in your own school, no one is gonna professionally hire a 9th grader with bad results",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Will you be able to teach online, my 7 year old son? If yes DM",
      "votes": "4",
      "replies": []
    },
    {
      "text": "",
      "votes": "2",
      "replies": [
        {
          "text": "Good idea! But im pretty sure kids are fluent already",
          "votes": "1",
          "replies": []
        },
        {
          "text": "Uhhh no? Their English is sub-par plus he's too young",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "2",
      "replies": []
    },
    {
      "text": "What is the relevance of ur family background to this post?",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 143
}