{
  "url": "https://www.reddit.com/r/bangladesh/comments/1mhgh35/does_brac_university_allow_more_than_3_years/",
  "hash": "49ba10fb0a96380adccbb234dfc0d3b7",
  "scraped_at": "2025-12-10T01:32:15.055900",
  "title": "Does BRAC University allow more than 3 years study gap?",
  "description": "I completed my HSC in 2022. I couldn't get into any public Universities inside Dhaka. Outside Dhaka was not an option because of family restrictions as I am a female. I got into one of the top Private Universities and a very good subject. But realised after 1 semester that it was not for me. I hated every bit of it. Finally got the courage to persuade my family to let me change my Department. Now my current University allowes student to take admission upto 5 years after HSC. So I can give admission test again and change Departments. But I wish to give admission test in BRAC as well as I started being interested in a subject during this time that will be better at BRAC. Now their admissions page says that normally they allow upto 3 yrs study gap but they also allow 3+yrs study gap by individual review. HSC 2022 was able to sit for admission test in their last test that was for Fall 2025. Next one is Spring 2026. HSC 2022 was held in November and December 2022. So my study gap will cross 3 yrs. I called their admissions office and they said before the next circuler admissions committee will decide whether HSC 2022 will be allowed or not. I plan to request for individual review if they don't allow but wanted to know if anyone was ever allowed to give admission test based on individual review. Like is it just there in the rules or they actually take these seriously. Any suggestion is appreciated. Thank you.",
  "votes": "2",
  "comments": [
    {
      "text": "How can we advise you? This can only be decided by admission board.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 148
}