{
  "url": "https://www.reddit.com/r/bangladesh/comments/1mfo91j/how_is_ib_curriculum_for_english_medium_students/",
  "hash": "952d330556dcc35fd398b8db09c620ee",
  "scraped_at": "2025-12-10T01:32:30.311085",
  "title": "How is IB curriculum for English Medium students?",
  "description": "I am considering enrolling my daughter in a school that follows IB curriculum. I am wondering if IB graduates can enroll in the top public universities like DU, BUET, if they want. Does anyone know of any IB graduates studying in public universities in Bangladesh?",
  "votes": "3",
  "comments": [
    {
      "text": "Former IB student here\nYes she absolutely can I know of people who went into Ivy League schools so DU or BUET shouldn’t be an issue\nEdit : IB emphasizes on critical thinking and applied knowledge which don’t fit into the traditional “boxed” narrative of our educational system so there might be a bit of a gap or struggle.",
      "votes": "4",
      "replies": [
        {
          "text": "Thanks for your answer. Could you please tell me more about how grades in MYP and DP would appear in certificate? I see the curriculum has groups like science, maths, arts, etc. So are grades awarded per group (like science - A, Math - A) or per subject (Physics - A, Chemistry - A)? I have no idea about their grading system, so I would really appreciate your input here.\nI am asking this as BD universities often have requirements grade requirements on individual subjects (like As in Physics, Chemistry, math). I have no doubt about the standard of education with IB. I just want to make sure that these technical eligibility requirements wouldn't be an issue.",
          "votes": "1",
          "replies": [
            {
              "text": "MYP & DP are graded based on numbers (7 being the highest) and you have to take well rounded subjects (this is relevant for DP) meaning 1 from arts, 1 from science (or 2), 1 from humanities, and so on. 3 Higher & 3 standard level with CAS (community service) & TOK (theory of knowledge) There’s one exam at end of grade 12\nAs far as grades being transferred over to a local university (transcripts) it should be fine (given then universities do require entry exams and such) but I think that depends on the university itself. It would be an issue if the university itself does not recognize IB certification or credentials",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "They should be able to. You 100% should enroll your kid in an IB school. It will open doors for them, even overseas",
      "votes": "1",
      "replies": [
        {
          "text": "The only problem is that they are damn too expensive compared to other traditional english medium schools.",
          "votes": "2",
          "replies": [
            {
              "text": "Yea I know but expense wasn't being asked by OP so I assumed it was ok with them.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 149
}