{
  "url": "https://www.reddit.com/r/bangladesh/comments/1mbbchb/bracnsuaiub_for_cse/",
  "hash": "6d95f823a0348fd5e203cdaed8ed3759",
  "scraped_at": "2025-12-10T01:33:51.536643",
  "title": "BRAC/NSU/AIUB for CSE?",
  "description": "Hello!\nI'm an expat looking at unis in BD. From what I've looked at.\n- BRAC seems to be the best choice for CSE\n- NSU has harsher grading\nCan someone compare all three? I've looked up many posts online but brac er student bole brac e jaisna, nsu bole nsu jaisna, aiub bole aiub jaisna😭\nI also have an SAT score of 1470, from what it seems, I can skip the admission test for NSU/AIUB. Not sure about BRAC. Can anyone clarify?\nThank you!",
  "votes": "2",
  "comments": [
    {
      "text": "I don't know which one is the best amongst these, but I can maybe add something in regards to the grading. NSU grading being harsher is one of the stupidest myth paddled by people who have never ever opened a book. It's pretty damn easy to get good grades in NSU. I am someone who rarely ever attended any classes, used to prepare for the xms just before the xm day, but still managed to get pretty good grades.\nIn my opinion if higher studies is something you are concerned about I would say go for one of BRACU / NSU as you would get better peers in those regards in these two uni but other than that I think the quality of education is most probably same in all of these.",
      "votes": "2",
      "replies": [
        {
          "text": "BRAC also seems to have a stronger CS program so yeah. Do you know anyone who was in my place? (like an expat who came back to bd to study?)",
          "votes": "2",
          "replies": [
            {
              "text": "I knew few people who grew up in the middle east and then studied in NSU. But was never close to them so don't know if they faced any issues while studying here.",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "How do you do it? Give tips",
          "votes": "1",
          "replies": [
            {
              "text": "you mean about getting grades? I graduated quite a long time ago at this point. But while I was studying there, I would basically go over the lecture slides as I found that was more than enough to get the top grades in the class as most of my peers wouldn't even know what's in the syllabus, so professors rarely asked questions from the reference books. I still remember in one of the stat course I basically just glossed over the the notes 2 hours before the finals and somehow ended up getting very close to the full marks.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "2",
      "replies": []
    },
    {
      "text": "What about aust cse ?",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 154
}