{
  "url": "https://www.reddit.com/r/bangladesh/comments/1mamnq3/why_am_i_getting_low_marks_in_bangla_cq_even_when/",
  "hash": "876eada22c42fd50805e38a7c2921519",
  "scraped_at": "2025-12-10T01:34:40.869953",
  "title": "Why am I getting low marks in Bangla CQ even when I study hard?",
  "description": "I’m a Class 9 student in Bangladesh, and I recently got really low marks in Bangla CQ (creative questions), even though I studied and answered 40–45 marks worth of questions. I got highest in MCQ, so I know my concepts and memory are good.\nBut my teacher said my writing “didn’t follow NCTB structure,” even though I wrote what I learned from the textbook. I didn’t copy guide answers word-for-word. One English teacher told me that in order to get full marks in Bangla CQ, I have to memorize and write board question answers exactly like the guide books (like Panjeri, Lecture, etc.).\nIs this true? Is the system really this unfair? Is there any way to get full marks in CQ without copying guide answers? Or do I just have to accept that creativity or original writing doesn’t work in Bangla exams?\nIf you’ve faced this or know how to deal with it, please help. I really want to improve before the annual exams, but I’m frustrated and confused right now.",
  "votes": "8",
  "comments": [
    {
      "text": "Cq lekhte gele structure thake, jemon gho er jonno 4 para, prothome gyan then onudhabon then proyog then dokkhota, hoyto tomar oitay vul, prothome boier kotha likha lage then uddippker kotha, evabe agano lage\nKo likhba 1-3 line, kho half page, go 1.5 page and gho 2 page. Para,lines and spacing and margin shob jeno thik thake\nIt also depends on handwriting. Amar handwriting er karone valo likhleo jara kharap likhto tader thekeo number kom dito.\nShob jodi thik thake tahole teacher er dosh thakte pare. Onekei achen jara guide er moto na hoile number deyna.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "You have to follow a specific structure to write each of the answer (ko, kho, go, gho). But you don't have to write the whole thing by memorizing. You just have to follow the structure and get the main concept right.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 157
}