{
  "url": "https://www.reddit.com/r/bangladesh/comments/1m883s2/14_km_travel/",
  "hash": "f5950fc51413b784bad2f6b31df35a24",
  "scraped_at": "2025-12-10T01:35:46.011204",
  "title": "14 KM Travel",
  "description": "Hey Guys, I recently got my SSC result and It's pretty good I would say (1156). With this number I can easily get into Birsheshto Munshi Abdur Rouf Public College but the the problem is I live in Chittagong Road, most of you probably haven’t heard of it. It's basically at the end of south side of Dhaka and starting of Narayanganj. The college is around 14km away and it isn’t much hassle to get there but the jam of Dhaka could be a problem. Most of you might say that I don’t need to go that far blah blah and I agree but the only college I have near my home is a chapri one and I don’t want to go there and since I used to live in Mohammadpur I always wished to get into Noor or Rouf and I have the chance now.\nSo The Question is, Will travelling (14km+14km)28km for a college really hamper my studies? Should I do it or reconsider? Please Help these chotobhai!! TaTa",
  "votes": "8",
  "comments": [
    {
      "text": "Bhai. College does not matter (if you are not from NDC or DRMC)\nDaily etokkhon travel korle porar energy e chole jabe. Try choosing a decent college in your proximity.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "reconsider ur options, college doesn't matter that much. college e temon kichu poray na, ghure fire tomake sir der kase tution e porte hobe or coaching korte hobe. so it will time and health consuming if u travel 28km daily.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Isn't Mahbubur Rahman Mollah College and Samsul Haq College nearer?\nThat's too much journey to me.",
      "votes": "2",
      "replies": [
        {
          "text": "I actually studied from Shamsul Haque but their college is only for Girls and Mollah is shit from inside they literally insult your parents if you miss college even for 1 day They charge extra coaching fee as well.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "It will hamper your studies. Not a wise decision. From my personal experience I can say it. I did the same thing since there weren't any good colleges near me. I spent almost 4-5 hours on the road. I was too wiped out to study after coming home. It did affect my studies badly. So I'd suggest either go for a college close to your home or stay at a hostel near Jigatola if you really want to study in Rouf.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "college is not that much of big deal honestly, but your energy is and 14+14km everyday with added jam, it will sap your mental and physical energy. Although I am not a big advocate of coaching center(never did any during my HSC), if you think you would learn more from coaching center compared to college, i suggest choose something that is near.\nAlso, on a side note, have some reliable friends that you can take to wherever you choose to go. It will help you out in the long run both from a exam e dekhdekhi perspective(Don't do this if you don't have people who are quick witted) or even from a motivation perspective",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Vai, jekono sorkari ektai vori ho ar class e jai oo na, neje neje poro, Online+Offline. Pick your teachers wisely. At the end of the day, college won't matter as much as your own efforts",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Don't go for 28 km. Either rent a shared stay near the college or change the college preference",
      "votes": "1",
      "replies": []
    },
    {
      "text": "i literary thought u were planning to travel from chitagong to dhaka at first",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 161
}