{
  "url": "https://www.reddit.com/r/bangladesh/comments/1m7d27l/i_got_1147_marks_on_ssc_science_id_like_some/",
  "hash": "617e894a4cc3357ce88e746b9969fb36",
  "scraped_at": "2025-12-10T01:36:03.085306",
  "title": "i got 1147 marks on ssc (science) id like some college suggestions",
  "description": "i live near malibagh, dhaka. unfortunately i got no idea about the colleges near me, it'd be incredibly helpful if someone could kindly tell me about some colleges with good reputation within ramna, motijhil and khilgaon thana. im willing to travel up to 3 kilometers for college\ni got golden gpa5, im in science, my total marks are 1147, female.",
  "votes": "5",
  "comments": [
    {
      "text": "নটরডেম। ঢাকা সিটি কলেজ। ন্যাশনাল আইডিয়াল। যাতায়াত থেকে শুরু করে লেখাপড়া, তিনদিকেই সুবিধা হবে।",
      "votes": "4",
      "replies": [
        {
          "text": "i heard dhaka city college is really strict about attendance, it's the only thing making me hesitate abt applying there tbh",
          "votes": "2",
          "replies": [
            {
              "text": "আমি আপনাকে যে তিনটা নাম বললাম, এরমধ্যে তুলনামুলক ফ্লেক্সিবল সিটি কলেজ। আগে শনিবারও ক্লাস হইতো এখন সম্ভবত পাঁচ দিন হয়।\n৭৫% রাখবেন, খুব বেশিও না। মালিবাগ থেকে একটু সামনে আবুল হোটেলে গিয়ে ভিক্টরে উঠবেন, এরপর কাকড়াইল নেমে রমজান। যাতায়াতেও সুবিধা।",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "NIC e porle jibon tejpata 💔",
          "votes": "2",
          "replies": [
            {
              "text": "ARE THEY THAT STRICT?? 😭",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Try for Notre Dame, Search in google college near me.",
      "votes": "3",
      "replies": [
        {
          "text": "helppp im a girl and i needed to prepare for it too😭",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "How about Vikarrunesa or Motijheel Ideal College?",
      "votes": "3",
      "replies": []
    },
    {
      "text": "My suggestion:\nIf u can focus on online classes never go to a college where u need attendance. Go to a govt cllg. Never go to cllg except exams. Enroll in courses of ACS or whatever platform u like. But study regularly. Try to finish syllabus as soon as possible by watching archive classes. New live classes are not really necessary.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "reddit pmo sb like syfm let me post, im crashing out over college here and reddit is crying over karma points bffr 💔",
      "votes": "2",
      "replies": []
    },
    {
      "text": "SAGC or Adamjee would've been really good option but since distance is an issue . Go for national ideal college. City college if u like being in strict environment:v .\nAnd definitely try for holy cross..",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Nice... Amio hsc 27. English version, marks 1238. Kushtia theke dhaka te move korbo. College suggestions dao",
      "votes": "2",
      "replies": []
    },
    {
      "text": "If you can get to ramna and motijhil, you can go to farmgate and try for holy cross",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "2",
      "replies": []
    },
    {
      "text": "city clg, motijheel ideal,national ideal. (bro im literary living in malibagh as well)",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Sit for the NDC admission test!",
      "votes": "2",
      "replies": [
        {
          "text": "suureee they'd def take me in asap seeing tht im a girl 💗",
          "votes": "1",
          "replies": [
            {
              "text": "Oops sry!",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Apply to colleges near your home for time efficency",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 162
}