{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p8pn3t/a_picture_that_shows_exactly_how_broken_our/",
  "hash": "e46a58380c38309426fce8dbca0bbc78",
  "scraped_at": "2025-12-10T00:57:38.368819",
  "title": "A picture that shows exactly how broken our education system is",
  "description": "The Daily Star published a photo from a government primary school in Dumuria, Khulna, and honestly it’s one of the clearest examples of how badly our education system has decayed. The classroom floor has been under ankle-deep water for five months because a nearby river is clogged with silt. Instead of fixing it, benches were stacked together to make a platform where 15 kids sit cramped, trying to study. Students from 22 nearby villages are going to school on boats every day. When winter comes, many will have to wade through waist-deep water, risking fever, infections, and other diseases. Yet exams start on December 1. Imagine preparing for PSC, JSC, or SSC like this.\nIn just one upazila, 45 educational institutions are affected by waterlogging. Across the country, the numbers are worse: around 22,000 primary schools are dilapidated, risky, abandoned, or unusable. And that doesn’t even include the schools that go underwater every monsoon.\nAt the same time, more than half of Bangladeshi students don’t finish secondary school. Teacher shortages are massive — over 34,000 head teacher posts and 24,000 assistant teacher posts are vacant. Even if recruitment starts, corruption and political influence will make it another slow, messy process.\nThe saddest part? Bangladesh has had eight education commissions since independence. Governments changed, recommendations changed, political interests changed — but nothing meaningful was implemented. Education became a political battlefield instead of a national priority. As a result, we kept producing mediocre students.\nInstead of building on the work of previous commissions, every new government threw the old recommendations away. No unified long-term plan, no stable authority, no accountability. Ministries overlap, bureaucracy stalls, and reforms only happen when donors fund temporary “projects.” When projects end, the progress disappears.",
  "votes": "92",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "এটা শুধু একটি ছবি নয়—এটা একটি সতর্কবার্তা।",
      "votes": "4",
      "replies": []
    },
    {
      "text": "A picture that lays bare the decay of our education system--the daily star",
      "votes": "2",
      "replies": []
    },
    {
      "text": "I believe we have the same condition in public health sector.\nNobody talks about that.\nIf people have their basic rights and they are educated, they will not follow those shit loaded politicians and their lies.\nGovt. comes and goes, our fate remains same.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 17
}