{
  "url": "https://www.reddit.com/r/bangladesh/comments/1m22bd8/should_i_shift_to_english_version/",
  "hash": "710ed648b3a5dd23652f3aee4c628af7",
  "scraped_at": "2025-12-10T01:38:41.467750",
  "title": "Should i shift to English Version",
  "description": "I've been a bm student from the beginning, but i feel like i should change to ev. So im currently studying in bm and my ssc is next year and im planning to shift but I don't know if its a good idea or not. I've been taking advice from chatgpt and following it. But i wanted to hear from someone who has gone through this transation. So what im doing is: Ive downloaded all of my books in english version and reading it, memorising it and writing creative questions answers. And what I noticed is terms are easier in english to memories and write than Bangla Medium. And its easier to understand the concept in english because BM books uses hard terms for concepts and words that we dont use in daily life . So now sometimes i open my EV books first to understand any concept. And this is why im planning to shift. Since I'm going to study everything in english after hsc anyways it'll be better if i start from now so it doesn't get harder after hsc. So i wanna know if its a good idea or not and the prons and cons.",
  "votes": "3",
  "comments": [
    {
      "text": "As an English Version student, I would advice you against it. If you really want to switch, switch to English Medium.\nIf you read the English version books for more than a few minutes you will notice the countless spelling, printing and translation errors. This is not only limited to the books, exam questions are the same. I wasted a lot of my time during SSC and HSC just trying to understand what the correct translation for an obviously incorrect question was. That wasted time cost me marks in other questions.\nAlso, most of the free resources online for nctb are tailored for Bangla version students. There are tons of free classes and notes for BV students and almost none for EV students. I didn't do any offline coaching so I had to learn Bangla terms for PCM topics in order to do the free classes available online. You could also watch foreign classes made in English but those are not organized according to nctb syllabus so you have to look up classes for individual topics, which is extra effort.",
      "votes": "6",
      "replies": [
        {
          "text": "Thanks for your honest opinion. it was really helpful how you pointed out the cons so clearly.\nActually, I really wanted to shift to English Medium at first when I found out that after HSC, I’ll have to study everything in English. I felt like it would be really hard for me to understand the terms if I wasn’t used to academic vocabulary.\nBut due to financial problems, I couldn’t choose English Medium that’s why I started thinking about shifting to EV instead. After that, I started reading EV books, and surprisingly, they felt easier than BV. I understood the content better.\nBut now that you’ve pointed out the downsides so clearly, I’ll definitely reconsider my decision. Thanks again!",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "bm gives you a lot of advantage when it comes to admission, ev students suffer a lot due to lack of resources. outta nowhere, you need to change your whole terminology for writing. But tbh again in some cases you might need to learn bangla stuffs. yt classes, biology books are officially in bangla. overall this whole ev thing is horrendous. Been suffering for 11 years in ev, I dont recommend doing this same shit to somebody else. some ppl from ev tend to sit for admission exams after studying bangla terminology cz banglay admission dewa lot safer cz ev questions are full of errors some cases e. So best of luck if you choose ev. But definitely english terminology a bit easier",
      "votes": "3",
      "replies": [
        {
          "text": "Thanks for your honest feedback from your personal experience. And i was almost preparing to shift until i decided to ask online and literally everyone is advising me against it. So I don't think I'll shift. Thanks again , You probably saved me from a big disaster.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "As an English version student, I'd suggest not to. Imo, English version does not even teach you proper English. The books are messed up, lots of info missing, broken English that gives you a headache. The board questions will have lots of mistakes because they could not bother to properly translate the Bangla version one. I'm in HSC, and I need to study the Bangla version books of biology because the Ev has so less info. Maybe try English medium if you have the means, but never English version.",
      "votes": "2",
      "replies": [
        {
          "text": "Thanks for sharing your opinion, It was helpful to see from another perspective.\nActually i wanted to shift to English medium too before because i was worried that it would be harder for me to get used to academic vocabulary in university because in uni i will have to study complex and harder content, broader concepts with lots of academic vocabulary. However i couldn't go with this for my financial limitations. So i thought EV might be a good alternative so i started reading EV books and surprisingly it came easier to me than BV.\nBut now that u have pointed out the downside from your own experience like about the broken english, mistakes in board questions and books and the limited infos and your struggles in ssc and hsc, I'll seriously reconsider my decision but thanks again for your honest feedback.",
          "votes": "2",
          "replies": [
            {
              "text": "No worries. Your english sounds pretty good. If you are worried about academic vocabularies, try reading English books. They'll help building confidence In Sha Allah.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "if your school offers ev then yes why not",
      "votes": "1",
      "replies": []
    },
    {
      "text": "But you only have like 2 years left in this curriculum anyway. I think it's better that you complete HSC before going through this transition. I mean don't get me wrong. It's very much doable but I just think that it's better that you complete your HSC in your current curriculum. You are right that you have to study everything in English in university. Not everybody finds that transition comfortable but they eventually get used to it.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "As a BM student who was in your phase, I would advise against it. The thing is that our brain likes new things, and after a few days, everything gets boring. So, the EV books you are reading now and feeling like you can understand and memorize everything wouldn't last long. From what I have heard from seniors, in HSC you have to actually read BV books and write questions in EV because of the lack of resources. It's not worth it.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 172
}