{
  "url": "https://www.reddit.com/r/bangladesh/comments/1m0f1t6/medical_or_engineeringvarsity/",
  "hash": "3075d6b9f15f087045d0119b7c50f9a5",
  "scraped_at": "2025-12-10T01:39:46.129731",
  "title": "Medical or Engineering/varsity",
  "description": "I am from hsc 25 batch. I am confused on what path i should go for after hsc. [Plz ignore any grammatical mistake]\nI watch a lot of series/dramas on medical stuff and i like them a lot. They look so cool. Ik its fiction bt still...cool. I also watch medical students vlog and those are cool too. I admire this profession a lot. I am not sure if this is a passion for me or just a short timed admiration. Confused. Another thing is my memorising skill sucks. I straight up forget what I read yesterday.\nNow about math...I LOVE IT. Whenever i think that i wouldn't be able to solve mathematical problems in med school I get kinda upset. I am also pretty good in math. In ssc exam I scored 99 on general math and 96 on higher math.I hope I can get good marks in hsc too.\nAs you can see this year the govt. is making it harder for students to get a good result. So far i was gonna go for medical admission test. But now i am confused AGAIN. I like math a lot whereas in bio i am very weak. I never got satisfactory result on bio. I am afraid i won't get enough grade to sit for medical admission test.\nIt would be great to get another pov :)",
  "votes": "1",
  "comments": [
    {
      "text": "ভাই আগে কলেজে ভর্তি হও।ক্লাস কর,পড়াশনা শুরু করে দেখ।দেন ডিসাইড কর। লাইফ ড্রামা আর ভ্লোগের মত এত ইজি না।তোমার মত অনেক বালপাকনা আমার ব্যাচমেট ছিল এমন কলেজে উঠার আগেই ডাক্তার ইঞ্জিনিয়ার সব হয়ে গেছে।তারা এখন কোথায় আছে সেটা ওরা নিজেও জানে না",
      "votes": "-2",
      "replies": [
        {
          "text": "he's passing college bhai",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "One thing I always tell my juniors, don’t come in the medical sector. Life will be better if you listen to me.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Go for engineering and leave bd",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 176
}