{
  "url": "https://www.reddit.com/r/bangladesh/comments/1lzth2c/from_aust_to_tesla_samiha_mustabin_begins_new/",
  "hash": "9eeb1aed217842d3ea6f0ec2987fec92",
  "scraped_at": "2025-12-10T01:40:03.078883",
  "title": "From AUST to Tesla: Samiha Mustabin Begins New Role as Process Engineer.",
  "description": "Samiha Mustabin Joygirdar, a graduate of the Industrial and Production Engineering (IPE) department at Ahsanullah University of Science and Technology (AUST), has recently joined the renowned American tech giant Tesla as a Process Engineer.\nShe was appointed to this prestigious role in May 2025, following a successful tenure of 1 year and 2 months as an Associate Process Engineer at Tesla.\nSamiha began her professional journey at Ha-Meem Group as a Management Trainee Officer. She then moved on to work at Singer Bangladesh Ltd. for nearly three years, serving as a Production Officer and later being promoted to Senior Officer. Her contributions in the areas of industrial production and process improvement were notably impactful.\nShe completed her Bachelor’s degree in Industrial Engineering from AUST in the session 2015–2019. Prior to that, she passed both her SSC and HSC from the Science stream at Viqarunnisa Noon School and College.\nWith clear goals, strong self-confidence, and sharp analytical skills, Samiha Joygirdar is proudly representing Bangladesh in the global tech industry.",
  "votes": "31",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "proud that a bangladeshi is getting into the big world tech companies, but tesla leaves a bit of a sour mark as a canadian-bangladeshi. still, we should applaud her for her hard work and determination",
      "votes": "6",
      "replies": []
    },
    {
      "text": "I am happy for her. The picture does, however, seem to distort her face especially her lips. AI filter?",
      "votes": "10",
      "replies": []
    },
    {
      "text": "I am happy for her ...but this is hyped up news ... process engineer is a level 1 position ... unless the news is not presenting her position correctly ... even that is a great achievement ... but is it worthy of a news headline ????",
      "votes": "3",
      "replies": []
    },
    {
      "text": "একমাত্র বাংলাদেশেই মিড লেভেল ইঞ্জিনিয়ারিং পোস্টে চাকরি পাইয়া নিউজে আসা সম্ভব । টেসলার ওয়ার্কিং কালচার বাজে হওয়ার কারণে কোন স্কিল্ড ইঞ্জিনিয়ার এইখানে কাজ করতে চায় না আদতে ।",
      "votes": "3",
      "replies": []
    },
    {
      "text": "",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Great news",
      "votes": "5",
      "replies": []
    }
  ],
  "id": 177
}