{
  "url": "https://www.reddit.com/r/bangladesh/comments/1lztccx/need_posthsc_admission_guideline/",
  "hash": "dfe5689f5c37527a57f2bac72d54637b",
  "scraped_at": "2025-12-10T01:40:19.642918",
  "title": "Need post-hsc admission guideline.",
  "description": "I'm sitting for HSC 2025 exam.I need post hsc admission phase guideline. Mainly aiming for DU or SUST or any prestigious/decent uni preferably in CSE. Now im not gonna sugarcoat and be completely honest I didn’t have the best preparation or routine during my academic life. So far exam's has been going pretty decent. So inshallah. Buet is already out of reach since i have 4.94 in my ssc. Due to post-pandemic burnout,depression and just lack of discipline I went from a straight A student(barely ever missing A+ in school) to failing mostly and barely passing.My biggest issue is procastination and perfectionism combo which paralyzes me into not being able to even try. I still see glimpse of my own potential which is what makes me keep standing up after a bad day. I'm self-aware enough to be able to say I can do it or at least get closer if I really gave my best. The main problem is starting for me. And maintaining consistency. Anyways the interest in CSE didn't come from societal pressure or anything actually i haven't even told anyone my dream properly cz what if they judges me and thinks \"im not cut out for it\" which is a thought that keeps haunting me too. I did research days after days to find if I was really interested or not same way I did research about medical to see if I was actually NOT interested in it. In both case I seemed to be right. Now enough with babbling. I'd say my fundamental basic is pretty decent but there are lackings mostly due to lack of practice and procastination. So back to my point I do have genuine interest and determination to do this to prove myself to make something out of myself. To create a life worth living where im not constantly surviving day to day of self-hate,low self esteem, guilt and regret. Mainly focusing on hsc now of course..however my question is what should be my next step after 6th aug. Or 20 august(till practicals). If anyone managed to read till now just drop your thought or any sort of guideline. To avoid making my life harder I have decided and have been term with the fact that even if I don't get into CSE my life won't be over. So getting into any decent uni would be my main priority and goal. However I have genuine interest in CSE and would love to make something out of it.And i guess in some sense aiming for cse could be foolish given my academic situation. So If you have any other suggestions for majors please drop them below!!!!!I am not that aware about the whole admission process since during my academic year when my friends were doing pre-medical courses I couldn't even dare to dream ab a big uni cz i was barley passing in exams still. If I don't mess up and manage to get A+ in all the rest 6 exams I will surely get GPA5(at least my calculation says so but well luck can always play funny games given i missed my gpa5 in ssc by 3 marks) Pray for me so i can do well enough in HSC to be able to at least APPLY. Thank you.",
  "votes": "6",
  "comments": [
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Have you given any thought about going abroad?",
      "votes": "1",
      "replies": [
        {
          "text": "i mean maybe after im done with undergrad but not right now",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 178
}