{
  "url": "https://www.reddit.com/r/bangladesh/comments/1p7qsde/confusion_about_continuing_cse_and_considering_a/",
  "hash": "5ff8a1a7f4a3d23afd563872922f6e16",
  "scraped_at": "2025-12-10T00:57:53.971916",
  "title": "Confusion About Continuing CSE and Considering a Shift to EEE",
  "description": "I am currently studying in the 2nd semester of my BSc in Computer Science, but I’m always confused about whether it’s actually the right subject to study in this era of AI and such intense competition. That’s why I sometimes feel like switching to EEE. Would it be a better choice if I shift to EEE?",
  "votes": "0",
  "comments": [
    {
      "text": "Switching from CSE to EEE won’t magically protect you from competition or artificial intelligence. Both fields are competitive. Both are getting reshaped. Ekhon jodi tomar intention hoy shudhu certs niye table e boshbo amake mukhe tule job khaway dibe taile bolbo ektateo enter koiro na. The question should be, which one fits how your brain likes to solve problems? Pick the hard you can tolerate because you like the outcome. And just to remind people, CS isn't only about software engineering smh. And emniteo you should have considered different career paths before deciding to enrol.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "If you don't have passion for any of these subjects, which is implied from this post, you should not study any of them. Any engineering subject requires the ability to learn for the rest of your life. Without passion, it becomes unbearable after certain times.",
      "votes": "3",
      "replies": [
        {
          "text": "not just engineering, healthcare too, every sector requires you to keep learning for the rest of your life. The market is just so cooked, it's not the early 2000s unfortunately.",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Context: I graduated in CS 15 years ago, take my advice with grain of salt.\nNobody knows how the job market will look like in the future. But one thing is certain, your domain knowledge matters. Take any subject you want, but if you don't have deep understanding of the domain, you will suffer in the future. AI cannot replace domain knowledge, only people with domain knowledge can utilize AI's potential.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Don't study CSE/EEE without passion. AI will eat you :')",
      "votes": "1",
      "replies": []
    },
    {
      "text": "CSE is like a river tide",
      "votes": "1",
      "replies": []
    },
    {
      "text": "🥱 job nai bro. Ja iccha poren.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 18
}