{
  "url": "https://www.reddit.com/r/bangladesh/comments/1lzlacl/will_it_be_ok_if_i_write_arabic_hadith_and_ayats/",
  "hash": "185e27462c6a9fec938962596ce10b2a",
  "scraped_at": "2025-12-10T01:40:52.467167",
  "title": "Will it be ok if i write arabic hadith and ayats in arabic script without diacritical marks in islam exam in SSC?",
  "description": "Also, if i add the hadith number as well as the book, which is not in the board book, will it be ok? It actually became a habit of mine niw that i study in Ideal school and college, mainly consisting the followers of jamat shibir.",
  "votes": "5",
  "comments": [
    {
      "text": "The teacher won't gonna understand, you have to translate it into bangla",
      "votes": "4",
      "replies": [
        {
          "text": "Of course, duh.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "You can. I did the same when I gave my SSC examination years ago. Make sure they are written correctly though because many Islamic studies teachers do understand Arabic and point out the mistakes.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Just don't make shit up. I have seen people do that.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "প্রথমত সরাসরি আরবি আয়াত ও হাদিস লিখা উচিত না কারণ পরীক্ষার খাতাগুলা পরে বিভিন্ন জায়গায় ফেলে রাখা হয় বিক্রি করা হয়।\nদ্বিতীয়তঃ আপনি আরবিতে ভালো এক্সপার্ট না হলে আর আয়াত ও হাদিস পরিপূর্ণভাবে আপনার মুখস্ত না থাকলে লিখতে যাওয়া উচিত না। কারণ, আপনি একটু যদি ভুল করেন তাহলে অর্থের বিকৃতি ঘটবে।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Don't bother! People can't really read Arabic. Just write it sura and ayat in Bangla. You'll get full marks if you translate it as well!",
      "votes": "1",
      "replies": []
    },
    {
      "text": "You can but you still have to include the translation. I made stuff up and there wasn't any hint of arabic on my exam and still ended up getting 94 so I don't think it makes much of a difference.",
      "votes": "1",
      "replies": [
        {
          "text": "I know, it’s just a habit of mine.",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 180
}