{
  "url": "https://www.reddit.com/r/bangladesh/comments/1lyqoex/is_my_future_ruined/",
  "hash": "41f4b3c48b2478d8a4c0fe0fd462cc82",
  "scraped_at": "2025-12-10T01:41:09.203500",
  "title": "Is my future ruined?",
  "description": "I am a student that gave ssc and I got gpa-5 but my total marks is only 1076. After seeing every video on collages I can't seem to find any that will accept me. Could anyone tell me what collage would be good for me",
  "votes": "5",
  "comments": [
    {
      "text": "Literally have 3.53 gpa.Ur future isn't ruined when People like me exist",
      "votes": "2",
      "replies": [
        {
          "text": "😭na bro my total marks only 1076 I can't seem to find any collage that I could enter and when ever I ask my previous batch brother they say I am not getting any good collages",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Try BAF shaheen",
      "votes": "1",
      "replies": [
        {
          "text": "Everyone is saying I need minimum 1160 marks to get in it😭",
          "votes": "1",
          "replies": [
            {
              "text": "Still try it! Plus akhono circular ber hoynai. You can also try BN",
              "votes": "3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Kinda",
      "votes": "1",
      "replies": [
        {
          "text": "😭",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 181
}