{
  "url": "https://www.reddit.com/r/bangladesh/comments/1lwyk15/is_my_life_ruined_for_not_getting_gpa_5_in_ssc/",
  "hash": "8695425510bd3db2469db87df5875310",
  "scraped_at": "2025-12-10T01:42:12.820287",
  "title": "Is my life ruined for not getting GPA 5 in SSC",
  "description": "Hi guys, I really want to know if my life is ruined.I failed to get GPA 5 in the SSC exam with a gpa of 4.44. Everyone is telling me I won't get chance in any good colleges so my life is basically ruined. But how true is that and is there anything I can do in the future to make a comeback. The amount of troll and hatred I'm getting from my own people for a gpa is insane as if I've committed a crime or anything. I've basically turned into a laughingstock to my relatives because their kids got gpa 5 but I did'nt. And it's hurting my parents reputation real bad. I am so embarrassed it's just never ending shame that's breaking me from inside. They say I will only get ''khat colleges''.",
  "votes": "19",
  "comments": [
    {
      "text": "You are fine. It will last maybe 1 month at max. I also got 4.67 and now giving hsc. Life doesn't stop. Ignore those who make fun of you and distance yourself from them, they will not be a good influence on your life.\nAs for your future, you will have a slight disadvantage during admission but it can be handled if you do well in HSC and try hard in admission (if you want to sit for any).  You can get good private colleges with your result or govt ones if you are in business or humanities. If money is an issue or you don't want private then I suggest going for some less reputed government college where attendance doesn't matter and you can study at your own pace.\nDon't worry much about it but try your best in HSC. Goodluck",
      "votes": "7",
      "replies": []
    },
    {
      "text": "",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Like the advice everyone else have given its same focus in yourself, learn practical skills, there are thousands jobless, with big degrees at the same time many successful people with hardly any education , nobody has time to see their gpa, if youre decent enough, and lucky anything is possible, also these relatives must be dumb as hell",
      "votes": "1",
      "replies": []
    },
    {
      "text": "it's been a year since i came outta college aka the khet collges, now none gives a shit what college i studied in . believe u just gotta , the only bad side of no so good collges r environment, it's not that competitive. so u gotta push yourself alone , dont slack looking at others . so brother try on, life's ahead.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I think from now on GPA 5 starting to gain more value rather than necessity. Although this depends on next government too.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "there's more to life than getting gpa 5, tune out those dumbasses who think lesser of you just cause you didn't get their version of success and fulfilment.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Think of it like this way.\nYour life is a road, you are cruising in a car on the road. It is not a race, it is a journey which you want to enjoy. All of a sudden, you jumped across an unexpected bump on the road. What do we do when we mistakenly jump across the bump while driving? We start focusing on the road more, we slow down a bit, hold the steering wheel a bit harder, and we move on!! We make sure this doesn't happen again.\nMove on kiddo.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "bro you 15-16 y/o kid , life just starting man . get over it people gonna talk shit anyway . relatives , neighbours just want an excuse to look down on people closest to them that way they get the feeling that they are doing better\nfrom now on dont listen to any shit talk from your parents or anyone else , leave your shit talker friends cuz they aint your friends.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Only one suggestion: DO NOT BELIEVE ANY OF THEM, DO NOT EVEN OVERTHINK ABOUT THEIR OPINIONS, YOU ARE TOTALLY FINE. IT DOESN’T MATTER. From now on focus on yourself and stop worrying. Make sure you learn the basics very well in college for your future admission(even if you get into a private make sure you learn everything well in college). And try to learn something besides academics, it could be programming, it could be video editing or 3D modeling!",
      "votes": "1",
      "replies": []
    },
    {
      "text": "There is sea food festival going on in sheraton Hotel, just go there And treat yourself . 4.44 is also a great result.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I think your family has many relatives who didn't get GPA5 in SSC and still shining brightly.\nSo it doesn't matter.\nSSC result is only a ticket to get into top colleges. Nothing else.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Hey kiddo, University Senior here. NO ABSOLUTELY NOT! Soon you'll realise that too. Just Have patience for now.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "If anyone trolls you for something as stupid and irrelevant as SSC result, then slap their face.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Definitely",
      "votes": "1",
      "replies": []
    },
    {
      "text": "after 10 years ssc,hsc results wont matter anymore.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "10 years ago, I was just another SSC candidate and honestly, I didn’t even come close to the result what you got. Unlike many others, I didn’t have a startup dream or a big plan either. I just kept moving forward at my own pace. I graduated with an average CGPA. But despite all the odds, today I’m earning over 60k per month, and I’m just getting started.\nYour journey doesn’t need to be perfect to be meaningful. Just don’t stop.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 185
}