{
  "url": "https://www.reddit.com/r/bangladesh/comments/1lw903o/is_this_a_decent_gpa/",
  "hash": "a5f2e34de4d16dba11af1b3d9160d23f",
  "scraped_at": "2025-12-10T01:43:13.721064",
  "title": "Is this a decent GPA",
  "description": "I got 4.39 on my SSC exam\nHere's a proof I bottlenecked on BGS\nIs this a decent GPA also what colleges should I apply to? I'm considering arts or commerce Still science is in the table but really having second thoughts",
  "votes": "62",
  "comments": [
    {
      "text": "ssc gpa doesnt matter unless you get below 4. i wouldnt worry. and you got A in all science subject, why do you want to change it?",
      "votes": "19",
      "replies": []
    },
    {
      "text": "Got 4.94,missed GPA 5 cause of 1 marks.So fking annoying.",
      "votes": "8",
      "replies": [
        {
          "text": "you should do a board challenge",
          "votes": "6",
          "replies": []
        }
      ]
    },
    {
      "text": "It doesn't matter, trust me. Science gives you the opportunity to select any field. After college, you may choose as you like. Don't be upset. What matters most is what you get in your Bachelor's & how you prepared your portfolio over the years",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Averages Gpa is around high 3's. That's above average. Not exceptional but good",
      "votes": "13",
      "replies": []
    },
    {
      "text": "",
      "votes": "4",
      "replies": []
    },
    {
      "text": "I guess u don't like Bangladesh very much 😄",
      "votes": "6",
      "replies": []
    },
    {
      "text": "How tf did you get so low in bgs",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Crazy how a 40 in BGS is pushing you to take commerce/arts",
      "votes": "3",
      "replies": [
        {
          "text": "Bruh 40 in BGS and he wants to take art's 🙏🏽 He will be cooked, I'll suggest him to stick to science",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": null,
      "votes": "3",
      "replies": []
    },
    {
      "text": "What happend during the BGS exam 😭",
      "votes": "2",
      "replies": []
    },
    {
      "text": "",
      "votes": "2",
      "replies": []
    },
    {
      "text": "No",
      "votes": "2",
      "replies": []
    },
    {
      "text": "No, you are doomed in this country. Take preparation and try abroad.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "Hey try commerce in next seems bgs ain't for you so arts won't be good what's your number anyway ?\nMost college curricular ar based on number not gpa anyway",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Go to commerce if u want to change the subject id tell think about it alone dont take others opinion cuz im guessing u already know enough what science has what it doesnt weigh it yourself dont listen to ur parents nor anyone . Come to a conclusion then take others opinion weigh the pros and cons . If i knew thus before i most definitely wouldnt be giving hsc from science",
      "votes": "1",
      "replies": []
    },
    {
      "text": "NO. Even getting 5 alone doesn't quite cut it anymore. You missed out on chem and bio,which implies to half of the group subjects.. Donno particularly about this year,but in the recent years,people are scoring so high in board exams,getting a decent college allotted is being increasingly difficult",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Is it possible for me to get into a government college with 90% marks??",
      "votes": "1",
      "replies": []
    },
    {
      "text": "My gpa 3.72",
      "votes": "1",
      "replies": []
    },
    {
      "text": "If u got least in BGS,then u must be BAKSHAL hater😁\nBTW congratulations, don't think about best because the best creates own way",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Yes this is decent enough. But you need to bring your A game in HSC if you wanna apply in the top-tier public universities. But if your family situation is decent enough, even with similar result in HSC you can get into any top private universities. When you are in uni this results really don't matter anymore, not even the institution. what matters is the subject you choose to be in. Science is still in your cards but external circumstances will determine your future.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "For science no.It will effect.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "goood enuf honestly.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 187
}