{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ltntda/date_of_ssc_result_published/",
  "hash": "35484ba99b7eb9436038c6aec44a9f02",
  "scraped_at": "2025-12-10T01:44:55.167381",
  "title": "Date of SSC result published",
  "description": "So according to news, ssc results are gonna be published on 10 th July. How are you guys holding up?\nPersonally, I read a story about a guy who missed A+ by just 1 mark and this has me TWEAKING cuz I'm pretty sure I'm gonna get 81 in higher maths, but you never know what the teachers will do",
  "votes": "4",
  "comments": [
    {
      "text": "ssc results dont matter in the long run, missing just 1 mark is totally okay. college life got more interesting things for you to cry on. save your tears for inter life. ssc teh konorokom gpa 5 is more than enough, college selection o khub matter kore temon na. you still have a lot of time to make a good comeback in hsc and admission phase. never cry over ssc results, start hsc syllabus otherwise you will be crying just like me and my friends",
      "votes": "4",
      "replies": []
    },
    {
      "text": "79 in islamic studies is what I got.\nThat made me extremely sad that time but it really didn't mater.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "১০ জুলাই । 😭",
      "votes": "2",
      "replies": []
    },
    {
      "text": "missed golden by 1 mark aswell 3 din pore bhule jaba",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Lol. Same here for the worries. My h.m, bio, bgs is goner lol. I got tyserious typhoid the day before h.m",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Wait they dont let 1 marks slide anymore?\nI got 159 in bangla and still got A+ back when i gave ssc.",
      "votes": "1",
      "replies": [
        {
          "text": "eibar news e deklam je eibar kono grace marking deya hobe na, plus jodi karo 1/2 mark er jonno A+ miss jay tao kono mark dibe na",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "I got 39 in Ict And missed A+. Back thenI cried a lot as I was expecting GPA5. But blv me ssc result doesn’t matter in higher level. It has very lesser effect in higher studies or admission test.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 193
}