{
  "url": "https://www.reddit.com/r/bangladesh/comments/1lseah8/chat_am_i_cooked/",
  "hash": "47f46c425b09c56034f9796637617611",
  "scraped_at": "2025-12-10T01:46:01.583026",
  "title": "Chat am I cooked?",
  "description": "Am gonna lose roundabout 13-15 of grammar in English 2nd paper this HSC, can I hope to get 80 there?\nFor a bit more info, my handwriting was chicken scratch too. I did do kinda good on English 1 but idk how much they give on average.\nSo can I get a bit of help?\nHow much do they give on average in composition parts?\nHow much do they give in short questions in English 1?",
  "votes": "5",
  "comments": [
    {
      "text": "Seems like we both are cooked",
      "votes": "-1",
      "replies": [
        {
          "text": "Won't they take pity on us and give 5 marks more on paragraphs 😭",
          "votes": "2",
          "replies": [
            {
              "text": "Bhai Ami college er shob exam a paragraph a 6 paitam out of 15, 3 pages lekhar por o, tai ei exam a first ta 6 or 7 ar 2nd ta 5 page likhe ashchi number na dile seriously I'm gonna lose it",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I am sorry to say this. You are probably going to be stuck on 77 or 78 type number.",
      "votes": "1",
      "replies": [
        {
          "text": "Won't they take about of pity and give 2-3 marks 😭 Are they actually gonna ruin a life like this 😭",
          "votes": "1",
          "replies": [
            {
              "text": "Hsc result ruins life ?",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Well, it's common to miss out A+ in HSC English and Bangla anyways. I mean even if you had given a very good exam there would've been a high possibility of you missing it out lol. Good thing is, it doesn't matter in the admission phase so chill out",
      "votes": "1",
      "replies": [
        {
          "text": "What's worse is I was one of the better English ppl in our group 💀",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 197
}