{
  "url": "https://www.reddit.com/r/bangladesh/comments/1lpz2is/extremism_in_educational_institutions/",
  "hash": "97d395b71efdd6fd25d8bd0c982132ef",
  "scraped_at": "2025-12-10T01:46:19.180583",
  "title": "Extremism in Educational Institutions",
  "description": "Okay so I usually lurk in this sub without an account, but I came across a post of someone saying that they were kind of being forced to wear hijab. And I thought I need to address something.\nI'm SSC 25 batch student. After the revolution, the dress code of our school uniform was changed back to the old one. But since we only had a few months left, we were spared from this change. Before that, the mandatory things were like average high school uniform for female students. Salwar, Kamiz, and cross belt. But even before that, there was a time when the longer scarf (boro orna) was also mandatory, and teachers used to prefer all students having their heads covered. Anyway, I didn't had to deal with that cause I got enrolled after that era was gone.\nBut now they got reinstated again, even kids of 4-5th grades are supposed to wear those long sleeved dresses, with those long scarfs along with cross belts. I just don't understand like some of them don't even have that much physical changes why start it from 4-5th grade? And what's the point to make them mandatory? Cause even in my time, many girls used to wear burka, hijab, long sleeved dresses. Nobody said anything to them. And what's the point to make long sleeves mandatory in a country like ours?\nAnyway so I did not come here to rant about the dress code, I came here to address the speech we had to hear in our farewell ceremony.\nSo our principal, our Asst. headteachers said many things regarding how to navigate complexities in exam hall. But the last speech was just, I don't know it was basically a Wuaz. That teacher started by telling every girl to cover up their heads first. Done, then he continued how religion and morality is important, how afterlife matters more, etc etc. Everything is fine, since there were mostly muslim girls, surely he can give them life advices.\nBut at the end of his speech, he went like, \"অমুসলিম মেয়েরা, তোমাদের আল্লাহ্‌ গ্রহণ করবে না। ......... মা-বাবাকে বুঝিয়ে ইসলাম কবুল কর\"\nNow who on earth would like to get Dawah in a farewell ceremony? Unfortunately I didn't have any phone with me then. That's why I couldn't record it. If anyone from that school of our batch is here, please confirm this.\nThe thing that hurt me most is, nobody told him to stop, nobody stood up. Everyone was silent, I wish someone at least recorded that part so that I could use it. But nah, no on did from my section.\nI don't know what to say but, no matter what you say about facebook, extremism is even at school level, specially in schools like ours. Even in my previous school, our Islam teacher used to say stories which would create hatred towards other religions. Even hatred towards our ethnic minorities.",
  "votes": "59",
  "comments": [
    {
      "text": "Forcing women to wear certain clothes and teaching hatred in schools? Not a good future for the country..",
      "votes": "31",
      "replies": []
    },
    {
      "text": "Ei molla gularei Allah grohon korbe na",
      "votes": "14",
      "replies": []
    },
    {
      "text": "From the educational institutions to work places I have faced the same, surely there were some good people but no one stand upfront when shit talk starts from someone.\nI’m requesting OP to not share identifiable details, mob can do anything with any reason.",
      "votes": "12",
      "replies": []
    },
    {
      "text": "And now people will say, it was just that one teacher and not everyone supports him.\nIn that case, why didn't anyone tried to stop him? Because, deep inside the majority doesn't mind and actually supports these arguments. \"Mounota Sommotir Lokkhon\"\nAnyways, thanks for at least acknowledging the issue while the majority just skipped it.",
      "votes": "11",
      "replies": []
    },
    {
      "text": "I have noticed that too... in general meeting or gathering everyone is trying to force upon their belief...",
      "votes": "6",
      "replies": []
    },
    {
      "text": "I really like how during the July protest, one of the mottos were protesting together against government regardless of religion.\nNow that the protest is successful, “What do you mean religions other than Islam?”\nEdit: Every time I saw someone posting from FB here and worrying about huge support for jamaat and/or shariah, everyone would be pointing out how FB does not represent reality. Unless these are mostly bots, FB absolutely represents BD reality. Majority BD people are on FB. Why would they express different opinion there?\nI had junior glazing shariah, workplace glazing everything Islam (whether deserving or not), coworkers who accept the evidence that support their claim while rejecting anything opposin as fake news.  These are typical FB mentality, but it’s literally how a lot of people around me think.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 198
}