{
  "url": "https://www.reddit.com/r/bangladesh/comments/1lpo0xt/just_finished_sscshould_i_choose_hsc_or_diploma/",
  "hash": "d50f92eb6601e8ff1c2a8031c032e2b4",
  "scraped_at": "2025-12-10T01:46:36.116181",
  "title": "Just Finished SSC—Should I Choose HSC or Diploma for Studying Abroad?",
  "description": "Hello everyone,\nI’ve just finished my SSC exams, and I’m waiting for my results, which should be published on July 17th. Now I’m torn between two paths: pursuing an HSC or enrolling in an engineering diploma program. My ultimate goal is to go abroad and build a solid career.\nFrom what I’ve gathered, HSC might let me head overseas more quickly. The downside is that as an HSC student, I’d likely only qualify for non-skilled, part-time work at first, before I can move into a full-time role.\nOn the other hand, doing a diploma in engineering and then applying for a BSc abroad could improve my chances of securing an internship—or even a job—right away. I also like the idea of developing hands-on skills in product design during my diploma years, and I expect the study pressure to be lighter than that of HSC Science.\nHas anyone faced a similar choice? How did you decide, and what do you wish you’d known before making your decision? Any advice or personal experiences would be hugely appreciated!",
  "votes": "7",
  "comments": [
    {
      "text": "I am planning of developing some skills and taking part into some government youth development proggrams during the session. Which I won't be able to if I go for HSC. Should I go for it?",
      "votes": "4",
      "replies": [
        {
          "text": "I am planning of developing some skills and taking part into some government youth development proggrams during the session. Which I won't be able to if I go for HSC. Should I go for it?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "if you want to go to japan. You can choose diploma",
      "votes": "2",
      "replies": [
        {
          "text": "But why??!",
          "votes": "3",
          "replies": [
            {
              "text": "Amar 2 bondhu japan jacche. Se amk eitai bollo.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "of course HSC",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Go for diploma",
      "votes": "0",
      "replies": []
    }
  ],
  "id": 199
}