{
  "url": "https://www.reddit.com/r/bangladesh/comments/1lp812s/how_can_i_boost_my_chances_for_a_us_scholarship/",
  "hash": "99139b7291e5215ba10be2dcfba5706b",
  "scraped_at": "2025-12-10T01:46:52.655866",
  "title": "How Can I Boost My Chances for a US Scholarship as an Undergrad?",
  "description": "Hi everyone,\nI'm currently a 3rd-year engineering student at a well-known public university (non-CSE major, but passionate about CSE). Like many others, I dream of pursuing higher studies in the USA after graduation - ideally with a scholarship.\nMy CGPA is around 3.00, which is not terrible, but I know it's not considered very competitive either. I’m involved in undergraduate research, but so are many of my peers. I want to go beyond that—do something that helps me stand out among the thousands of other applicants chasing the same dream.\nAlthough I’m not from a computer science background, I’ve developed some solid skills in areas like web development and competitive programming. I also run two small businesses - nothing huge, but they’ve taught me a lot about leadership, problem-solving, and time management.\nSo my question is:\nWhat can I start doing now to strengthen my profile and boost my chances of getting a scholarship abroad, especially in the US?\nI would deeply appreciate any advice, insights, or personal experiences - whether it's about test scores, standout projects, internships, volunteering, publications, or anything else that really matters in scholarship selection.\nThanks in advance for your really really valuable responses!",
  "votes": "4",
  "comments": [
    {
      "text": "Things to work on\nCGPA: Keep it as high as possible\nGRE: Higher the better\nPublications: at least one solid publication in the field you want to pursue\nSkills: learn Python\nProfessional Experience: similar field always adds value.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Decent unis not care about you or your CGPA. They just look at your name and access you based on your SATs for your scholarship. Remember:\nCGPA and ECAs: required for acceptance into uni SATs: required for scholarship IELTS: required for visa",
      "votes": "2",
      "replies": []
    }
  ],
  "id": 200
}