{
  "url": "https://www.reddit.com/r/bangladesh/comments/1lnnm6g/bracu_eee_vs_ece_for_bachelors_is_it_really_as/",
  "hash": "f5a4ecab8d36fa5babe431bcaf8868e8",
  "scraped_at": "2025-12-10T01:47:08.499374",
  "title": "BRACU EEE vs ECE for Bachelor’s – is it really as bad as seniors say? Need real advice.",
  "description": "Hey, I’m F19 and currently planning to do my undergrad at BRAC University. I’m stuck between choosing Electrical & Electronic Engineering (EEE) or Electronic & Communication Engineering (ECE), and I’d really appreciate some genuine, unbiased advice especially from seniors or current students who actually know how things work in these departments.\nMy long-term goal is to go abroad for a Master’s in Aerospace Engineering, and more specifically, I want to specialize in Space Systems Engineering. So right now, I’m just trying to figure out what would actually serve me best in the long run both academically and GPA-wise, and not just get me stuck somewhere I’ll regret.\nSome BRACU seniors told me to avoid EEE entirely. They said the department has one of the worst faculties, a bad internal reputation, and that it’s unnecessarily difficult to do well in. Basically, not worth the stress. Instead, they suggested CSE (Computer Science and Engineering) or even Microbiology (which I’m not interested in at all).\nTo clarify, I don’t hate coding. I’m actually thinking of taking CSE as a minor, just not as my major. I’m not trying to become a software engineer. My goal is still aerospace, and I want my studies to reflect that path. So I’m leaning toward ECE over EEE, but I honestly don’t know how big the difference is between the two at BRACU. Curriculum-wise, faculty-wise, future opportunity-wise, I’m trying to weigh everything.\nAlso, how realistic is it to take CSE as a minor with ECE or EEE as the major? Has anyone done that combo and managed well? What’s the process, and is it actually worth it for someone with my goals?\nI know no department is perfect, but I’d really appreciate insight from people who’ve seen things from the inside who know how each department runs and what makes sense if someone wants to go abroad for postgrad.",
  "votes": "2",
  "comments": [
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 201
}