{
  "url": "https://www.reddit.com/r/bangladesh/comments/1lje0bm/best_private_university_for_humanities_students/",
  "hash": "21404ce470a77a1982f8a4ce010c3ed7",
  "scraped_at": "2025-12-10T01:48:11.229414",
  "title": "Best private university for humanities students?",
  "description": "I am from a Humanities background, and boy, it is hard to find subjects you like in Private universities. Being from the cursed and dumb HSC24, my luck hasn't been kind to me as I missed DU by one mark, and didn't get a good position in RU or GST due to my horrendous knowledge in Bangla [ Bangali hoye Bangla pai na lmao ]. Frankly, I wasn't that into public unis as I would rather have a politically free space, which might have played a role, anyway.\nI would like to study Economics, while I know BRAC and NSU are probably no-brainers, but I would like to assess the other options. The cost of Eco in BRAC is 12.5L, and 9L in NSU. I'm thinking about East West as a better option cost cost-wise, around 7.5L, but would it be good?\nAlso, can someone tell me about Southeast University? While it is definitely lower in terms of quality than the three mentioned above, the cost is significantly lower, and since I'm from outside Dhaka, it might be cost-efficient. Or are there any better options? Apparently it's around 4.5L for Eco.\nI will put EWU as top priority, but might also go for BRAC and NSU, and then decide. Frankly I'm confused. The previous admission exams did affect me, I was thinking, what if I fail to secure a spot there, what then, another 3/4months gone? [ Already in a weird state where all my friends have gotten into Unis be it private or public or abroad, and Im also feeling abit burnt out, plus parents er taka nosto korar iccha nai, sure they wont backdown from funding but man the tuition cost plus living cost will add up sooner or later, and the economy sucks wouldnt want to put much burden even if we are somewhat well off, but i also don't wanna study in a bad uni, plus I have no wish to study in National Uni, thus didnt buy the form ]",
  "votes": "2",
  "comments": [
    {
      "text": "",
      "votes": "2",
      "replies": [
        {
          "text": "I do plan on to go Abroad sooner or later,",
          "votes": "1",
          "replies": [
            {
              "text": "",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "You can try EWU because they do have a merit based scholarship system. Keep your CGPA high, and you might pay a lot less.\nOr there's another way,\nYou could start at a cheaper uni (like Southeast), then transfer to BRAC/NSU after 2–3 semesters if your results are good and budget allows.",
      "votes": "2",
      "replies": []
    }
  ],
  "id": 205
}