{
  "url": "https://www.reddit.com/r/bangladesh/comments/1lioe7l/i_just_had_a_thought_when_i_saw_a_news_about_the/",
  "hash": "cc4bef537a28f2853718dfb18d3a3454",
  "scraped_at": "2025-12-10T01:48:57.535143",
  "title": "I just had a thought when I saw a news about the education system.",
  "description": "So, I am in ssc batch 27 (class 9) and, while watching the somoi TV news from a few days ago I saw that, they are trying to implement another new education system for Bangladesh starting 2027. I just had a thought while watching the news, couldn't they just modify some things with the new curriculum? Like, I remember how the the ICT book was really good there. Now, the the book seems to me that it's 10 to 12 years behind. So, couldn't we do something like where, ever subject has some class work and, everything you do in class is counted on your marks? If we did something like that, because, then people would have pressure to study all year. Plus you have examination life half monthly and finals. So, people would study. And learn all the time. With books that are updated every 3 years or so. And, even if the gov doesn't do something like this, they should do it not within two years. I think, they should give them selves minimum of 5 years. Us class 10 and 9 are doomed. We wasted our grade 7,8,9s. Now, most of us are really under prepared for the ssc examinations.\nI was just wondering things like this while watching the news. And I wanted your guy's thoughts on this. And, what do you think would be a good sort of implementation? Here's the somoi TV news that I was watching: https://youtu.be/ji5HbJGK9Nk?si=uzxwE-DYmty37izj",
  "votes": "4",
  "comments": [
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "i have to be honest why aernt we implementing this next or this year?",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 208
}