{
  "url": "https://www.reddit.com/r/bangladesh/comments/1lfgzqr/guys_are_there_theory_questions_too_in_buet_and/",
  "hash": "2a1d1074430d1fe7a9f564dc31cde062",
  "scraped_at": "2025-12-10T01:49:28.515810",
  "title": "Guys are there theory questions too in BUET and CUET admissions test? Or only mcq?",
  "description": "I asked chatgpt and it got me all confused",
  "votes": "6",
  "comments": [
    {
      "text": "Don't rely on chatgpt for this kind of information.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "See past papers.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Yes theory questions but only for chem. And the admission test is written based exam.for buet there is a preliminary exam which is mcq",
      "votes": "1",
      "replies": [
        {
          "text": "So the theory questions in chem are for both buet and cuet ryt? And besides that everything is mcq for both buet and cuet ryt?",
          "votes": "1",
          "replies": [
            {
              "text": "Mcq exam hoy just buet preliminary te main admission test both cuet and buet e written exam.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "BUET takes exam in 2 stages. First one is MCQ. The next one is written theory exam. From what I remember CUET takes combined exam with RUET & KUET. And it is mcq only",
      "votes": "1",
      "replies": [
        {
          "text": "Thank youu",
          "votes": "1",
          "replies": []
        },
        {
          "text": "The cluster broke up in 2024, they take separate exams now. KUET takes mcq, CUET mcq+written, RUET is similar to BUET; first mcq then written.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "BUET: Shortlist (based on HSC results) --> MCQ(Preliminary) --> Written Exam (mostly mathematical questions but you'll get theory based questions in chemistry)\nCUET: Shortlist --> Written (At least that's how it went in the latest CUET admission exam)",
      "votes": "1",
      "replies": [
        {
          "text": "I am an A level student. How will I get shortlisted? And in cuet is there mcq and theory both in written or just theory?",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 210
}