{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ldp6yb/is_our_education_making_us_smart_or_just_trained/",
  "hash": "0f114e52476744cea5709365bffc7013",
  "scraped_at": "2025-12-10T01:50:50.067744",
  "title": "Is our education making us smart Or just trained to say 'yes, sir' to the system?",
  "description": null,
  "votes": "90710",
  "comments": [
    {
      "text": "",
      "votes": null,
      "replies": []
    },
    {
      "text": "Bangladeshi education isn't even theory based. It's completely useless",
      "votes": null,
      "replies": []
    },
    {
      "text": "BD education isn't theory based tbh. It's \"Whatever we can teach you with our limited focus and budget on education, a significant part of which is gobbled by corrupt administrative authorities on top of it\"-based.\nEven compared to a neighboring country like India, our education system and our universities are lagging far, far behind. At this point I wouldn't even think about comparing it to UK education system.",
      "votes": null,
      "replies": []
    },
    {
      "text": "'Yes, sir' to what system? For someone who's been working half my life I'm really not sure if there is a system.\nWe have students who have the gall to actually demand auto passes. Parents who protest when there's the slightest changes made to the HSC exams curriculum.\nNow we have the IG who I had hopes for, cut the primary education budget and boost the islamic education line, albeit conservatively (pun also intended).\nOne of the primary roles and income models for any university is to conduct paid research for the private and public sector alike. Apart from BUET and Agricultural University, all other universities absolutely rely on education fees, and public ones rely 100% on government subsidies. How will industry in this country innovate with this crap?\nMinus one or two DU departments, almost all the candidates I interviewed for a job can't even do a proper undergraduate level of research. Smh.\nMoreover, with these silly kids getting interested in nonsensical politics even more these days, we as a nation collectively should invest taxpayer money properly into education so that we can at least have basic spatial awareness and not trip out like fools at this point.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Source: Image seen on Facebook story, original creator unknown. Shared widely across social media.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Ja likha ase oitao toh hoyna. Hoy shudhu pa chatachati naile sojon priti",
      "votes": null,
      "replies": []
    },
    {
      "text": "Except for the fist one everything is on the point",
      "votes": null,
      "replies": []
    },
    {
      "text": "",
      "votes": null,
      "replies": []
    },
    {
      "text": "",
      "votes": null,
      "replies": [
        {
          "text": "How is this Islamophobic? Would you rather hire or work with someone educated in the UK or Bangladesh?",
          "votes": null,
          "replies": []
        },
        {
          "text": "First islamophobia is just a way used by Muslims and western liberals to suppress criticism of the religion, second where the hell do you even remotely find any connection between this post and islamophobia?",
          "votes": null,
          "replies": [
            {
              "text": "",
              "votes": null,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Need lot of improvement",
      "votes": null,
      "replies": []
    }
  ],
  "id": 215
}