{
  "url": "https://www.reddit.com/r/bangladesh/comments/1la6sz1/anyone_planning_or_moved_recently_to_study_abroad/",
  "hash": "86c2b645c7c4a3d01f1ffaffe96fe590",
  "scraped_at": "2025-12-10T01:53:01.408207",
  "title": "Anyone planning or moved recently to study abroad especially in Europe?",
  "description": "So, I am 34 now, completed my post grad like in 2015, have more than 6+ working experience. Although I have a decent job here, I don't feel like staying in BD because of the society doesn't very much supportive towards a single woman. Though my family is not very supportive about my decision, and knowing this will be a tough journey, I still want to do it.\nAt the moment, I am thinking about doing a second masters preferably in a english speaking european country. Data analytics/ business analytics is my preferable domain. My budget is like 15 lac for tuition fees. Any insight regarding the process and job market would be helpful. Also, I would like to be connected if you are going through the same process.",
  "votes": "4",
  "comments": [
    {
      "text": "Screw what people say but if you are earning decent, stay there.\nEconomic situation is horrible in english speaking countries.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "In general screw what people say but invest in education which will still give some return in Bangladesh in case you dont make it in Europe",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Yes. I am also planning for ms is data science!",
      "votes": "4",
      "replies": [
        {
          "text": "Aha! Interesting. So which countries you have in mind?",
          "votes": "1",
          "replies": [
            {
              "text": "Dm?",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "This feels like a very broad question. You could begin your search with chatgpt to narrow down a few countries and then deep dive into each to decide.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Yes, I have been staying in Germany for around the last 1.5 years.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Are you financially independent? If you are then don't worry too much about others' opinion on you. Your life is nobody else's business",
      "votes": "1",
      "replies": [
        {
          "text": "I am financially independent. However, I really want to move.",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 223
}