{
  "url": "https://www.reddit.com/r/bangladesh/comments/1l7j7tg/is_it_possible_for_bangla_medium_students_to_get/",
  "hash": "5e5c5c63930411483831126edf2d64df",
  "scraped_at": "2025-12-10T01:54:22.292012",
  "title": "Is it possible for bangla medium students to get accepted in English medium colleges?",
  "description": "Okay so basically, im a bangla medium student (Ssc 26). After i pass 10th grade with ssc, is it possible for me to apply to CESC (Cantonment English School and College)?\nThe reason i want to switch to english medium after ssc is because i want to take A Levels. and the reason i want to take A levels is because my dream university, Oxford, doesn't accept undergraduates from Bangladesh with HSC certificates. They accept bangladeshis who've taken A Levels.\nTLDR: i need to take a levels but i haven't taken o levels and am a bangla medium student - is it still possible?",
  "votes": "3",
  "comments": [
    {
      "text": "Afaik CESC is English version, not medium, unless they have added a new curriculum.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "CESE doesn't teach a levels afik since they're English Version not medium.\nYou can't enroll in English Version school after giving SSC from Bangla Version schools directly anyways.\nI would suggest finding a place nearby that'll prep you for the exam.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "if you cant find a school that lets you do a levels you can do them as a private candidate which a lot do from what ive seen and this would mean youd generally just be studying through coaching or tutoring instead of actual schooling. as your school doesnt have o levels (or something considered as a GCSE equivalent), you should email the uni to see if theyll accept ssc since it's not as important as the higher qualifications or if you need alternate ones, which may mean you have to sit for certain required o levels as well privately, but only the admissions department can say for sure.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "It is extremely difficult if not impossible.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "It is possible, best of luck tho cause it’s a huge shift from BM",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 228
}