{
  "url": "https://www.reddit.com/r/bangladesh/comments/1l3piak/uni_comparison/",
  "hash": "ce374a269df22808f323babb88e36f90",
  "scraped_at": "2025-12-10T01:54:54.917407",
  "title": "Uni comparison",
  "description": "BA in Economics er jonno Stamford University, Asian University and Presidency University r modhe konta valo hobe, karo dharona thakle pls let me know.",
  "votes": "6",
  "comments": [
    {
      "text": "BA in Econ e ki temon kichu Shekhar ache? Why not BSc? BSc kaaje dibe",
      "votes": "2",
      "replies": [
        {
          "text": "Economics e BA and BSc duita korar option ache?",
          "votes": "1",
          "replies": [
            {
              "text": "idk about other unis but East West offers BA in Econ",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Stamford foul, Asian aro foul, Presidency motamuti nam ase. But I'd suggest go to better uni. I understand you don't have budget to afford Brac/NSU. Perhaps look at Southeast / BUBT? If they're out of reach and you have only these 3 options, then go to Presidency.",
      "votes": "1",
      "replies": [
        {
          "text": "Amar Germany te jawar icha, Germany r ekta website ache called Anabin and you can see which universities are recognised by Germany there, and Southeast Uni has a rating of H+/- which is means something like 50/50 chance of getting German uni's offer letter/visa.\nIt happened because I think UGC might have blacklisted Southeast uni for sometime because of not having a good enough campus or some other reason. Funnily enough even NSU has a rating of H+/-.\nH+ rating is considered safe.",
          "votes": "1",
          "replies": [
            {
              "text": "Well, then Presidency is the best option among those 3. Though I'm not sure if its worth waiting for 1-2 years to get German visa",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I prefer Presidency University",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Stamford BSS.  Course is easy enough if you know decent English.  Has extracurricular activities.",
      "votes": "1",
      "replies": [
        {
          "text": "Does it? Are you an student of Stamford?",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 230
}