{
  "url": "https://www.reddit.com/r/bangladesh/comments/1l2j4h2/phd_at_private_university/",
  "hash": "3b737a37d49abd7afc2f02e7b46c1d3c",
  "scraped_at": "2025-12-10T01:55:27.029872",
  "title": "Phd at private university",
  "description": "What is your opinion on this? Right now, some banks require an MBA for junior-level officer positions. If a PhD was earned from a private university, a DBA might be needed to work as a cash officer.",
  "votes": "2",
  "comments": [
    {
      "text": "some conversations",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I am all for it, public unis(except buet) been producing garbage phds for what almost 4 decades now? privates cant do worse than that.\nBut for now the right should only be granted to nsu/brac, with the condition that other unis would get their eventually. Right now other than these two rest of them have trash faculties.",
      "votes": "1",
      "replies": [
        {
          "text": "Lmao, UIU is more research oriented than NSU or Brac. Also, Daffodil is recently putting efforts to be more research oriented.\nResearch conducted by agricultural universities has had a greater impact on Bangladesh than anything BUET has ever done. THE rankings reflect that. I never take QS rankings seriously because a third tier private uni like Stamford can get ahead of JU only because they enroll LGBT folks with full scholarship, doesn't take research or faculty quality into consideration. THE rankings, however, only take academic status into consideration.\nNext time you talk trash about uni, at least research a bit so you don't sound like a moron.",
          "votes": "0",
          "replies": [
            {
              "text": "Holly mother of sun and moon, I don't have a ball in this game my dude. Forgot about agriculture, my bad, they are great.\nWhy do you think I care about the ranking? one simply needs to go to these schools faculty list, look up the kind of research they are doing, the journal they are publishing on. I have done exactly that before writing out my opinion.\nNo needs to go offensive about that. Uiu/ewu/aust whatever, I have just visited these unis faculties, trash, trash and trash.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 232
}