{
  "url": "https://www.reddit.com/r/bangladesh/comments/1l0fwxv/bangladeshi_schools_are_hella_underfunded_and/",
  "hash": "0c88159ebb0400d99166814347f33802",
  "scraped_at": "2025-12-10T01:56:50.315025",
  "title": "Bangladeshi schools are hella underfunded and backdated",
  "description": "When I was in 8th grade, a kid got caught with weed (or some form of narcotics I forgot) and instead of getting him rehabilitated, the school did some petty drama for a few days. They called his parents, threatened expulsion and stuff but his dad is a powerful person so it was all swept under the rug and he was allowed to come back to school by the next week.\nHe ended up dropping from school by the end of the year. Addiction might’ve got the best of him.\nThe kid not getting proper help in time is a systemic failure. Some has to be done. This happened in a posh English medium school, I can’t even imagine what it’s like in rural areas.",
  "votes": "26",
  "comments": [
    {
      "text": "This doesn’t happen in rural areas.People get stabbed in rural areas",
      "votes": "4",
      "replies": [
        {
          "text": "Stabbed why?",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "This, followed by kids protesting, demanding and then obtaining an auto pass for their high school/college (deshi college) graduation - we're pretty much doomed.\nNo wonder these children can't get jobs with an ever increasing youth unemployment rate and then the fools are literally joining politics and engaging in rampant extortion. What a joke.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Lol most english medium schools don't have corporal punishments. That kid would've been hit with a bamboo stick if he were in rural areas.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Yes, schools are not for his drug addiction. It's the parents who should have a close eye and now they are responsible.",
      "votes": "0",
      "replies": [
        {
          "text": "schools have the fundamental and moral responsibility. Not all parents have the time and resources. We don’t live in a perfect world. I think addiction is a big enough problem among teenagers that schools should address it.",
          "votes": "2",
          "replies": [
            {
              "text": "Do tuition fees include drug addiction treatments? Are teachers qualified drug rehab specialists? No.\nKick out the troublemaker. Maintain your standards as a school.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 237
}