{
  "url": "https://www.reddit.com/r/bangladesh/comments/1kyuln7/admission_for_em_people/",
  "hash": "1e81e473518e0110df17af616a8dcec1",
  "scraped_at": "2025-12-10T01:57:06.932256",
  "title": "Admission for EM people",
  "description": "Hello everyone,\nOver the past few days, I’ve noticed quite a few posts regarding admission tests for EM (English Medium) students. Many of you seem confused about what to do, where to go, and how to start preparing.\nSo, I’ve decided to summarize everything to help clear things up.\nBroadly speaking, admission tests can be categorized into three groups:\nMedical\nEngineering\nScience and Technology Universities\nIn this post, I’ll be focusing on Engineering admission tests, specifically BUET. If you need information or guidance about other categories, feel free to inbox me.\nBUET Admission Test Overview\nBUET’s admission process is divided into three main stages:\nApplication Submission",
  "votes": "6",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "-6",
      "replies": [
        {
          "text": "The family's financial situation changes (speaking from experience).",
          "votes": "7",
          "replies": []
        },
        {
          "text": "See the past few days post, then you will get the idea.",
          "votes": "4",
          "replies": []
        },
        {
          "text": "Lots of Parents don't think long term or know less about managing finances...some Parents also send their children lots of time to English medium school for a better environment, make better connections....you've been out of touch with reality if you never saw people like this",
          "votes": "2",
          "replies": [
            {
              "text": "Lmao that doesn't change the fact that it's a dumb move",
              "votes": "-3",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "They hate us coz they ain't us",
      "votes": "-1",
      "replies": []
    }
  ],
  "id": 238
}