{
  "url": "https://www.reddit.com/r/bangladesh/comments/1kyflcz/which_coaching_centre_to_join/",
  "hash": "36b391ed00068aef7f1f48db22bfe837",
  "scraped_at": "2025-12-10T01:57:24.266775",
  "title": "Which Coaching centre to join?",
  "description": "I want to prepare for the medical entrance exam in bangladesh, but I don't know much about good coaching centers. I need English medium as well since Idk how to read or write bangla ( I am bangali but living in other country). Should I learn Bangla now? I have been suggested , but I am not sure if there's English medium coaching done. Please Help",
  "votes": "3",
  "comments": [
    {
      "text": "Hey man I am also a CBSE student ..day before yesterday I went to retina ... apparently they have only one batch of English . It's around 24k taka in the state I am in ( chittang)....but a small thing which was fishy is the guy at the admission counter ( a real business man ) said the teachers for bangla and English are same but then I talked to a sir and he told me few teachers are dif .....so just make sure u get all info ...another is udvash but my smarty cousin was like just take retina as it's reputed well for the English one",
      "votes": "2",
      "replies": []
    },
    {
      "text": "My sister got into Retina. She is studying in Rajshahi Medical College now.",
      "votes": "1",
      "replies": [
        {
          "text": "Oh she studied from English medium batch? In which year she gave her exam ?",
          "votes": "1",
          "replies": [
            {
              "text": "Dont remember they year she gave exam but her class started in 2020. And I'm sorry but she was from Bangla Medium.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "I don't think learning bangla can help you with hsc meterials . Udvash has online English courses only",
      "votes": "1",
      "replies": [
        {
          "text": "Whats hsc materials? I don't follow bangla curriculum. I am from cbse. I check medico has an English batch as well",
          "votes": "1",
          "replies": [
            {
              "text": "11-12th curriculum . I would suggest you the Stan's over Bangladesh if you have the money . If you are from cbse then you might be able to pass the exam but will be hard to get a seat in govt colleges. it's easier than neet without a doubt but our students will have an advantage . Idk about MAT but engineering uni's give an English sheet along side with bangla. and you can request for English on GST and medical I guess",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "You can join retina they have a separate batch for english medium and english version students, and all the materials are in english.",
      "votes": "1",
      "replies": [
        {
          "text": "My sister joined EM 1-2 years ago but it was in Bangla",
          "votes": "1",
          "replies": [
            {
              "text": "I did their classes last year, and everything was in english I guess they are improving day by day",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Both but for phys and chem it was mainly the Textbooks and for bio the assistbook",
      "votes": "1",
      "replies": [
        {
          "text": "Oh how much did you answer and score, if you don't mind me asking. Also how is the medical life and studying there, assuming you are studying in bangladesh now",
          "votes": "1",
          "replies": [
            {
              "text": "Actually I couldn't make it to a public med unfortunately I got 57 , my classes haven't started yet",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 239
}