{
  "url": "https://www.reddit.com/r/bangladesh/comments/1kx7wqi/feeling_completely_lost_really_need_advice/",
  "hash": "e2e3822ee171ab3147e9231eedd78314",
  "scraped_at": "2025-12-10T01:57:42.810724",
  "title": "Feeling completely lost. Really need advice",
  "description": "I’m a 2023 HSC Science student and a second timer. I tried hard to get into a public university, but it didn’t work out. Eventually, I got admitted into a National University, studying Economics—but honestly, I’ve never even attended a single class.\nThere’s no pressure to go. No one around me is serious about it. I don’t feel any motivation. I only got admitted because I had nothing else to do. I don’t have any skills, no friends there, no connection to the place. I’m technically still enrolled—I could sit for the exams and maybe even pass, but the grading feels questionable, and I don’t feel like I’m learning anything.\nThe days just keep passing by, and I feel like I’m stuck. Blank. Like I’m wasting time and letting life move on without me.\nLately, I’ve been thinking about switching paths—maybe something business-related. Science doesn’t feel like it’s for me anymore. My dad saw ads about studying in China. It seemed affordable if I could get a scholarship, but the application deadline is already gone. I already lost one year. I’m scared to lose another.\nI’ve also considered applying to a private university, but my dad thinks it’s a waste of money. Plus, I’m not from Dhaka, so if I take that path, I’d have to go alone, face everything on my own, and probably go against my family’s wishes too. That’s scary.\nPart of me even wonders—should I just start some kind of business instead of wasting more time? Or try to study at a private university while doing something on the side?",
  "votes": "4",
  "comments": [
    {
      "text": "Both of your current options would make you live alone.\nStudying at a private university is not a waste of money. But if you were into study Business, I would suggest private university but if it's STEM, then China, eyes closed.\nWe all live in our own timelines. Some hit their career at 30, and some start at 30. Time is relative. Do what's best for you. Don't waste yourself in NU.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "I’ve been thinking about switching paths—maybe something business-related. // ok, good decision. Learn basic accounting, than quickbooks. There is huge money.",
      "votes": "1",
      "replies": [
        {
          "text": "Who said this bollocks?",
          "votes": "1",
          "replies": [
            {
              "text": "hospitality theke besi tk naki amar jana nai. kintu tk ache.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Studying in a good private university is a massive investment especially from BD pov.\nIf you know what to do in life, you'd kill it.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "please be careful about China. স্ক্যাম এর সম্ভাবনা আছে। নিজের স্কিল বারানোর দিকে মনোযোগ দাও। কম্পিউটার স্কিল, ইংলিশ স্পিকিং ইত্যাদি। Private university is not a waste of money. I know people who are doing weel after graduating from private university.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 240
}