{
  "url": "https://www.reddit.com/r/bangladesh/comments/1kvu5jj/i_just_completed_my_admission_into_an_university/",
  "hash": "20995fe55376793c0902468b2b0af9a0",
  "scraped_at": "2025-12-10T01:58:14.821125",
  "title": "I just completed my admission into an university, any advice I should know? Especially about how to make friends",
  "description": "So, I just recently finished my admission into Daffodil International College, classes haven't started yet.\nAny advice for a new university student? Anything I should know?\nAlso, while I am not the type to spend much time out with friends, it is good to have friends, but I'm not really good at making them. Any suggestion on that front? I have pretty much zero idea what life in university would be like and what times would be good to meet people",
  "votes": "6",
  "comments": [
    {
      "text": "I'm not sure if it'd work for everyone, but during my first semester at uni, I made an extrovert friend who gradually introduced me to a lot of other friends. You could try that too, I guess.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "Join some clubs as a novice and ask people for advice on how to improve. Everyone likes giving advice and you'll make new friends on the way.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "chapri uni number 1.",
      "votes": "-1",
      "replies": [
        {
          "text": "Don't say stuff like that, especially to someone who's getting into an university you're defaming about.",
          "votes": "3",
          "replies": []
        },
        {
          "text": "Public theke vala. At least they don't make mastan and chadabaji",
          "votes": "2",
          "replies": [
            {
              "text": "only a guy with a gpa of 3.20 in arts can say this",
              "votes": "-2",
              "replies": []
            },
            {
              "text": "holy artisan attackers were from NSU",
              "votes": "-2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "First and most important “try to socialise with people” create connections, it will help a lot in the 4 years you’ll be studying also in the future. Also try to make friends (tho don’t try hard it will happen in the process of socialising) do clubbing inter uni at the same time intra uni. Focus on hardening extra skills. It might be in the field you’re studying in or something you’re passionate about. the skill should be saleable lastly try to excel academically although nowadays it’s not that much important if you have some good skills in your pocket but if you can excel plus point for you. Mainly Try to live a life, not be a machine because this is the last time you’ll get before the serious phase of your life starts.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 242
}