{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ksrmdr/im_clueless_after_my_a_levels_now/",
  "hash": "e3c28d788aa26e832466f4f81085f458",
  "scraped_at": "2025-12-10T01:59:23.589962",
  "title": "I'm clueless after my A levels now",
  "description": "All these years I heard people saying CSE is the best. And now most are advising not to take cs/cse. I only took Maths Phy and Chem in A levels (exams ended couple days ago) and I'm interested in eng field but don't know which one to study for B.Sc. I'm also planning to go to public unis but getting a chance in those is hella difficult. I do have a few months to think about it but I'm already so confused. Anyone with ANY advice about eng fields and their careers???",
  "votes": "7",
  "comments": [
    {
      "text": "Job market will change every few years. What’s in demand now may not be in demand when you graduate. Study something that resonates with you the most. Have a clear career vision and work towards that.",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Okay,realistically,not to demotivate you, but I remember when I was starting A'levels. All I wanted to do was get out of this country, and being heavily inspired by Iron Man, I really wanted to do mechanical engineering because that stuff looked awesome.\nPersonally, I lowkey hated cs at the time because they all looked depressed. Fast forward 5 years, I curse myself almost every day for taking cs and not taking BBA instead (I'm currently in a private uni and nearly done with it).The reason I took CS was how attractive it looked during peak-COVID and post-COVID, and oh god, am I suffering in the worst ways possible rn.\nIf I was in your position now and see that I would have to stay back, I would've stayed the fuck away from STEM field.\nMost job markets are shit rn anyway. So, whatever you do, please make your decision not on what the job markets look right now but rather see where your current abilities can help you shine the brightest. (My apologies for the aggression; the times have been tough for a while.)",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Leave engineering. We need farmers. Buy huge swath of lands. Cultivate properly, use advanced and mechanized techniques to profit extremely high. Only this path is stable because people will never stop eating.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "you'll not get your desired subject to study in a public varsity unless you're extremely fortunate. I think your next goal should be securing a decent enough position in a well reputed public Uni in order to get a chance to choose a subject of your own preference.",
      "votes": "1",
      "replies": [
        {
          "text": "i'm not a mind blowing student so getting a chance in public looks impossible but due to financial resistance, i have to give it a try",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Sent a dm!",
      "votes": "1",
      "replies": []
    },
    {
      "text": "You can take a lot of subjects if you have maths physics and chemistry you still have huge options so do not stress about that and about taking CS nothing is that in our country The subject is oversaturated, but not enough, competent people in it for example statistically if you look into hundred people chances are 80% of them studied CS but Probably one percent of them is actually skilled knows how to program properly so if you are skilled in this will you still will have a demand and about abroad perspective CS is being oversaturated there even now and that is an issue but same thing as our country not enough skilled people I would recommend you looking into machine learning than AI and data science basically data analyst. This things will have quite value and are actually emerging so you may look into this just taking CS is not going to work out. We need to take a niche part of it.",
      "votes": "1",
      "replies": [
        {
          "text": "thank youu! I will definitely look more into different parts of cs.",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 246
}