{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ksn6kh/how_can_i_be_that_person_i_am_wanting_to_be_for_a/",
  "hash": "f0e45581ccf460663a5ec3c34022c3dd",
  "scraped_at": "2025-12-10T01:59:41.011260",
  "title": "How can I be that person i am wanting to be for a long time.",
  "description": "So,I want to make it short just because most of the people will ignore if I make it long\nAm a student of SSC-26 Science Background I was in a relationship 2024Oct-2025May and the girl was a h0e so i had no other option but to leave her Now I was never a good student i mean ever i always failed but in class 8 i somehow tried my best and got GPA 2.90 again in class 9 due to curriculum changes i thought there wasnt any pressure so no need to study and thats why i got 2.85 GPA Now from now on i am trying to study cuz my mother wants to live in dhaka and also wants me to study at ndc and my father said we will move to dhaka if you can crack Notre Dame College.I want my mother's wish actually be real.thats why I recently made a study routine[ 5:15Am to 12Am ] (Including, Prayers,food breaks etc) (Self study,excluding school time) I even deleted my instagram,facebook and deactivated my discord account.and also throwed my phone into the wardrobe and locked it.\nNow i need help I am new to this studying system Few things i have been struggling with are Noting properly(should i note every chapter serially? And how should i note em? How i include maths note with few examples?),Pornography addiction(1 week gap each relapse),Procrastination,And Routine not being followed Properly,the best tried is 5-6hours a day but i need to recover and finish whole syllabus(i forget maths after few days now do i need to do 6-7cqs of maths and physics regularly to keep em in my mind?) no human is perfect but need to do their best now what should i do to be the best version of myself and fulfil my mother's wish.",
  "votes": "4",
  "comments": [
    {
      "text": "I'm proud of you that you're working hard on your mother's wish to come true. Keep it up brother.\nAs a senior I would suggest you must hang in there no matter what and you'll do much better than your expectations, InshAllah.\nLife's not that hard in SSC. Just be consistent. Best of luck brother!",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 247
}