{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oyo3s8/wanna_know_about_jnu/",
  "hash": "d0d8af5985758e712239b7cbc1f6ee68",
  "scraped_at": "2025-12-10T00:59:58.720705",
  "title": "WANNA KNOW ABOUT JNU",
  "description": "ভাই আমি তো বিশাল বিপদে পড়সি। আমার বাপ মায়ে আমাকে জগন্নাথের ফর্ম তুলতেই দিবে না। এদের ধারণা এটা নাকি কোনো ভার্সিটির কাতারেই পড়ে না এখানে নাকি ফেল্টু/ কোনোমতে পাশ করা পোলাপান পড়াশুনা করে। আর এখান থেকে পড়লে নাকি ফিউচারে কোনো সেক্টরেই দাম পাবো না।সিভি তে এই ভার্সিটি দেখলেই নাকি সিভি ছুড়ে ফেলায় দিবে।\nএদের অভিজ্ঞতা তাই বলে।\nএখন ভাই আমি লো মিড লেভেলের স্টুডেন্ট। HSC তে GPA:4.83। টার্গেট A unit। এমন না যে একটা ভার্সিটিতে বসলেই চান্স পেয়ে যাব। তাই জগন্নাথে যদি না বসতে দেয় এরা তাইলে তো আমার জন্য বিশাল লস হয়ে যাবে। তার উপ্রে আমি বড় হইসি ঢাকা শহরে ঢাকায় ইই থাকার ইচ্ছা। তাই এম্নে একটা পাবলিক ভার্সিটি হাতছাড়া করা যায় না।\nকিন্তু বাপ মায়ের কথা \"না এখানে তুই চান্স পাইলেও তোরে পড়াবো না। এর চেয়ে ভালো তুই বাংলা কলেজে ডিগ্রি করবি।\"\nজগন্নাথের সিনিয়র ভাইয়া আপুরা যদি একটু প্লিজ বলেন যে আসলে জগন্নাথ কেমন আর আমার মা বাবার ধারণা কতটুকু সত্য। তাইলে নিজেও ব্যাপারটা বুঝতাম আর মা বাবাকেও দেখাতে পারতাম।",
  "votes": "6",
  "comments": [
    {
      "text": "tara ekhono shei mandatar amole pore ase 😑😑",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Private er moddhe BRAC , NSU , AUST , AIUB dekhte paren",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Bhai, Brac or NSU e vorti hon. Tuition koraye tuition fee dite parben. Totally worth it compared to JnU.",
      "votes": "1",
      "replies": [
        {
          "text": "Really!!",
          "votes": "2",
          "replies": [
            {
              "text": "Amake downvote diye lavh nai. Personal experience theke boltesi. Private universities are good. Public Valo kore just because Valo student Ra odike jay not because of their rigorous curriculum. Ar, public e shob Valo geleo ber hoy koekjon, guti koek. Private jarai Valo jay, tarai Valo kore.\n5 year pore dekhben, private funding diye shob Valo student niye ashtese.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I donno amar ja ja bolbo oigula ki hisebe niben\nlet me say you something facts about JnU since I am studying here\nyes JnU has lack of facilities like other universities but it stands better than other universities ..wanna know why??\napni BCS er kon varsity theke koto jon paise oigular rank korle JnU always top 5 e thake,majhe majhe top 3 eo thake\nJnU er law dept onek valo cz DU er por high ranking position gula pay JnU er law graduate ra\nalso JnU has name for BBA which is really good (it can surpass RU CU )\nbut I wanna say JnU is really not for science students but there is some dept which perform really well like chemistry dept\nwhat I wanna say is every varsity,every dept will not have the same facilities ,you have to choose the best among the public ...and you know how a public universities run\nlast thing I wanna say,poralekha ager moto nai,sobay sobar moto compete kore;in fact universities onek somoy fact kore na( sometime it does fact)\nso nijer moto poralekha koren,nijer jibon nije dara koran;nijer bap ma ki bole oigula shuna dorkar nai\ncz ami valo subject e porar jonno JnU te asha hoise ( even I got chance to have a subject in DU)\nbest of luck for you",
      "votes": "1",
      "replies": [
        {
          "text": "Chemistry dept ki valo apni sure??",
          "votes": "1",
          "replies": [
            {
              "text": "JnU te chemistry enough valo",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 26
}