{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oybrb2/em_private_candidate_suggestion/",
  "hash": "146c895510589266ae2858b8d5282130",
  "scraped_at": "2025-12-10T01:00:15.312283",
  "title": "EM Private Candidate Suggestion",
  "description": "I'm currently in EV class 10 under the national curriculum. Before that, I was in a foreign country for 5 years studying in a British curriculum school. Now I have not been able to cope up with the national curriculum, especially with the exam. As my SSC is in next year, I dont think i will be able to get good gpa in the SSC. So I have decided to shift to EM Edexcel IGCSE. I live in Zigatola, so can anyone suggest me any good EM coaching centers or academies near Zigatola or dhanmondhi? Also, I was looking at the subject registration costs for Edexcel IGCSE in the British Council Bangladesh website and in the list, the standard cost for a subject (like chemistry 4XCH1) is 0tk. Now is it really true or they made a typo?\nEeexcel registration cost list link from British council website: https://www.britishcouncil.org.bd/sites/default/files/pearson_edexcel_list_of_fees_october_november_25_ial_and_igcse.pdf\nAnd on average, how much is the per month cost for coaching per subject? One last thing, should I be aware of anything else as a IGCSE private candidate. Thanks!",
  "votes": "3",
  "comments": [
    {
      "text": "Vertical Horizon",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Which subs are you planning to take?",
      "votes": "1",
      "replies": [
        {
          "text": "English, Physics (4XPH1), Chemistry (4XCH1), Math A Foundation (4XMAF), Math A Higher (4XMAH), Bangla (4BA0), and maybe accounting (4XAC1). Btw, is standard cost for a subject really 0tk, cause in the list, the standard price in british council website says 0tk for the subjects im planning to take expect bangla?",
          "votes": "1",
          "replies": [
            {
              "text": "Can you dm me?",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 27
}