{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oxm8jt/how_much_do_professors_lecturers_and_asst/",
  "hash": "05984cf8edba43832d7629c5c1ae452f",
  "scraped_at": "2025-12-10T01:00:31.911292",
  "title": "How much do professors, lecturers and asst. lecturers get paid in private unis?",
  "description": "I wanna become a academic and its gonna be a huge investment from my family's side with bsc-msc-phd(yes i am willing to go through all that). It's not because I want to earn a lot of money rather easily-no, its because i have specific goals and its not exactly about the monetary value but more of a personal thing. But I'd still like to get a sense of what they are being paid in general and how much of a growth is generally seen here along the line as I do need to lead a life and i want to be at least comfortable with not much of a headache financially. TIA.",
  "votes": "18",
  "comments": [
    {
      "text": "It depends on the unis mostly. Where I study , the lecturers get 40k+ , professors get 95k+ .",
      "votes": "3",
      "replies": [
        {
          "text": "Yikes!\nThat's less than the 3 months probation pay for a factory worker in China with 0 skills/qualifications. And about half of what they get paid after probation.",
          "votes": "2",
          "replies": []
        },
        {
          "text": "95 for a prof or assistant prof?",
          "votes": "1",
          "replies": [
            {
              "text": "assistant profs get 80k+",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "in BUP it's around 40K for newly joined Lecturers",
      "votes": "3",
      "replies": []
    },
    {
      "text": "depends. 60k+ pay beginner level faculty ra bhalo private uni te",
      "votes": "3",
      "replies": [
        {
          "text": "what about someone with around a decade of exp?",
          "votes": "1",
          "replies": [
            {
              "text": "If you have a masters degree then you can get an assistant prof position.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "My partner used to get paid 60k+ as an assistant professor at a decent private university in Dhaka before she moved to the US.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Which dept? Varies dept wise\nAt NSU, you can be a faculty member if you have a foreign degree.\nWith only masters degree: Junior Lecturers (80k to 1lakh) Senior Lecturer (1lakh to 1.2lakh)\nPhD: Assistant prof (1.5lakh+) Associate prof (2lakh+) Prof not really sure im guessing more than 3 lakh\nThis data is from what i heard from the faculty members at nsu in the engineering dept.",
      "votes": "1",
      "replies": [
        {
          "text": "Physics dept",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 28
}