{
  "url": "https://www.reddit.com/r/bangladesh/comments/1owrioz/need_support_for_university_admission_ssc_hsc/",
  "hash": "b6573d8a763c7d1f1902fc92687c39e3",
  "scraped_at": "2025-12-10T01:01:35.342500",
  "title": "Need support for university admission — SSC & HSC both A+, top scorer in my thana, always roll-1 in class, but currently facing a family crisis",
  "description": "আমি SSC তে Science থেকে Golden A+ পেয়েছিলাম। এছাড়াও ১২২৫ মার্কস পেয়ে আমাদের থানার মধ্যে ২য় হয়েছিলাম । অতঃপর দেশের Top একটি কলেজে চান্স পেয়ে পড়াশোনা করেছি । এবারের HSC পরীক্ষাতেও Science থেকে A+ পেয়েছি। এবং মার্কস এর দিক দিয়ে ও থানা তে ২য় হয়েছি। স্কুল এ ও আমার রোল সবসময় ১-২ ছিল । এখন আমি admission candidate । Engineering preparation নিচ্ছি। আমার আব্বু পুরোপুরি সচ্ছল বলা যায় তার পরেও আমি আর্থিক সমস্যায় পড়েছি । কারণ আব্বু আম্মুর ব্যক্তিগত ঝামেলার কারণে আব্বুর থেকে আমি, আমার ছোট ২ ভাই, আম্মু সবাই বিচ্ছিন্ন । এদিকে নানি ছাড়া আম্মুর আর কেউ নেই, এবং এনার আর্থিক অবস্থা+পড়াশোনা নাই বললেই চলে, আব্বুর টাকাতেই নানি চলতো । এখন আমার ইউনিভার্সিটি গুলোতে এপ্লাই করা, এক্সাম দেওয়া, চান্স পাওয়া সব ই হুমকির মুখে পড়েছে । আমি একটু কষ্ট করলে যাওয়া আসা, এক্সাম দেওয়া, খাওয়া দাওয়ার খরচ হয়তো বহন করতে পারব, কিন্তু প্রতিটা ইউনিভার্সিটি তে এপ্লাই করতে almost ১০০০-১২০০ tk করে লাগবে । Around ১০ টা ইউনিভার্সিটি তে এপ্লাই করতে গেলেও অনেক হয় যায়। যেটা এমতাবস্থায় আমার পক্ষে অসম্ভব । হয়তো আম্মু মানুষের কাছে কাছে হাত পাতলে কয়েকটা ইউনিভার্সিটি তে এপ্লাই করার টাকা জোগাড় করতে পারবে, কিন্তু আমি এভাবে বড় হয়নি তাই আম্মুর এই অবস্থা আমি দেখতে পারবোনা । এমতাবস্থায় কেও যদি আমাকে আর্থিক ভাবে হেল্প করতে পারতেন আমি admission পর তা পরিশোধ করে দিতে পারব ইনশাল্লাহ। কেও পারলে কমেন্ট কইরেন আমি মেসেজ দিব, বিস্তারিত বলব, কিছু prove লাগলে দিব ।",
  "votes": "6",
  "comments": [
    {
      "text": "Google Chandra Nath From Manusher Jonno Foundation if you are worthy they will help you, but you have to be truthful and will verify everything before you get the funds. Good luck",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 32
}