{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ossjhl/urgent_stipendium_hungaricum_bangladesh_confused/",
  "hash": "1aab043f546e8b4e3ff222ecb671991e",
  "scraped_at": "2025-12-10T01:02:37.287092",
  "title": "Urgent: Stipendium Hungaricum (Bangladesh) - Confused about MOE Document Submission & Attestation",
  "description": "Hi everyone,\nI'm currently applying for the Stipendium Hungaricum scholarship and I'm really confused about the document submission process for our Sending Partner, the Ministry of Education (MOE) in Bangladesh. I'm hoping someone who has gone through this recently can clear a few things up.\nMy main points of confusion are:\nThe Exact Attestation Process: I've heard we need to get our O/A Level certificates and statement of results attested by a Gazetted Officer. Is this correct?\nWhat exactly do they need to do? Just a stamp and signature?\nDoes every single page (certificates and statements) need to be attested?\nThe Physical Submission at Shikkha Bhaban: The instructions say to submit documents to a \"specific box.\"\nWhere exactly is this box located inside the Ministry of Education (Shikkha Bhaban)?\nIs it a dedicated box for Stipendium Hungaricum? Do I just drop my documents in and leave? There's no need to get a receipt or see a specific officer?\nMy Biggest Issue: Original Certificates are Abroad!\nMy original O/A Level certificates are physically in Qatar and I cannot get them back before jan 15th.",
  "votes": "5",
  "comments": [
    {
      "text": "If you did your schooling in Qatar, then you will need to get your attestations done in Qatar. The general rule of merging mutual understanding between different countries is that you get high school certificates attested in Qatar at the education ministry, maybe get also get an equivalence certificate to the government school system then have those documents attested by a foreign affairs ministry. If your certificates are issued by a UK body then you'll need to get an \"apostille\" to prove that your \"certified copies\" are original and there are plenty of companies that do that. Make sure to do your attestation on copies and send the copies to the respective Hungarian bodies. Your case is a unique since you did your schooling in Qatar and not here (that's what I assume).",
      "votes": "1",
      "replies": [
        {
          "text": "No actually , i did my schooling here in dhaka and I have given my O'levels and A'levels here but i have recently applied to Qatar university so had to ship off my original ceritificates since thats the application process there but i would like to apply for the hungaricum scholarship to keep my options open which is why im afraid i cant get my ceritificates back until feb since qatar university will hold it till then",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 36
}