{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oncbvl/%E0%A6%AA%E0%A6%B0%E0%A6%A5%E0%A6%AE%E0%A6%95_%E0%A6%B8%E0%A6%97%E0%A6%A4_%E0%A6%93_%E0%A6%B6%E0%A6%B0%E0%A6%B0%E0%A6%95_%E0%A6%B6%E0%A6%95%E0%A6%B7_%E0%A6%B6%E0%A6%95%E0%A6%B7%E0%A6%95%E0%A6%B0_%E0%A6%A8%E0%A7%9F%E0%A6%97_%E0%A6%AC%E0%A6%A4%E0%A6%B2_%E0%A6%95%E0%A6%B0%E0%A6%9B_%E0%A6%B8%E0%A6%B0%E0%A6%95%E0%A6%B0/",
  "hash": "78f247c226aa03ab38b589d1a550d021",
  "scraped_at": "2025-12-10T01:04:11.866519",
  "title": "প্রাথমিকে সংগীত ও শারীরিক শিক্ষা শিক্ষকের নিয়োগ বাতিল করেছে সরকার।",
  "description": "মাত্র দুই মাস আগেই প্রাথমিক ও গণশিক্ষা মন্ত্রণালয় ‘সরকারি প্রাথমিক বিদ্যালয় শিক্ষক নিয়োগ বিধিমালা ২০২৫’ প্রকাশ করেছিল, যেখানে সংগীত ও শারীরিক শিক্ষা বিষয়ে সহকারী শিক্ষক নিয়োগের সুযোগ রাখা হয়েছিল।\nকিন্তু বিভিন্ন ধর্মভিত্তিক রাজনৈতিক দলের চাপ ও বিক্ষোভের পর — যারা “সংগীত শিক্ষকের বদলে ধর্ম শিক্ষক” নিয়োগের দাবি জানায় — সরকার শেষ পর্যন্ত বিধিমালা সংশোধন করেছে।\nরবিবার প্রকাশিত নতুন গেজেটে এখন কেবল প্রধান শিক্ষক ও সহকারী শিক্ষক পদের কথা বলা হয়েছে।",
  "votes": "43",
  "comments": [
    {
      "text": "দেশ আগফঘানিস্তান হবার পথে প্রথম স্টেপ এগিয়ে গেল 😂😂😂",
      "votes": "25",
      "replies": []
    },
    {
      "text": "মব কে আবার পুরস্কৃত করলো সরকার।",
      "votes": "13",
      "replies": []
    },
    {
      "text": "Haire natok the drama",
      "votes": "9",
      "replies": []
    },
    {
      "text": "We r all Taliban Bangla will be Pakistan",
      "votes": "12",
      "replies": []
    },
    {
      "text": "Dhoincha sorkar",
      "votes": "7",
      "replies": []
    },
    {
      "text": "Source: প্রাথমিকে সংগীত ও শারীরিক শিক্ষার শিক্ষক নিয়োগের সুযোগ বাদ — প্রথম আলো",
      "votes": "3",
      "replies": []
    },
    {
      "text": "The problem, to me, with religion teacher, especially for primary level, are these:\nWe all know religion is not something you inherit, it’s something you believe in. In practice, we practically ignore all of this and force our children into our own religion, which is why even takes this for granted… if your parents follow X, you learn X, no ifs or buts.\nAs I said, it’s something you yourself believe in. So, contrary to popular belief, it makes no sense to make a child follow a belief system when they are barely old enough to understand it.\nEven if, for argument’s sake, we agree that a child can decide their belief system, they should not be exposed to one particular religion. Instead, teach them comparative religion (not sure of the official name). Tell them about different religions, tell them what works, what doesn’t, make them reach their own conclusions.  Of course, it’s unrealistic to cover all religions, but at least make them familiar with various beliefs. Because, how can you decide on the belief system for you if all your life, you have been exposed to only the one from your parents?",
      "votes": "2",
      "replies": []
    },
    {
      "text": "physical edu kn bad dise lmao",
      "votes": "2",
      "replies": [
        {
          "text": "Karon egula nam matro physical education. Actually physical education to hoy madrashay. Gand mara.",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "Puppet govt",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 42
}