{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ol8mjd/how_much_do_i_need_to_give_the_only_a_levels_exam/",
  "hash": "d75e4b142cc4f7fe41f6c67f42e14484",
  "scraped_at": "2025-12-10T01:05:31.069284",
  "title": "How much do i need to give the only A levels exam in Bangladesh? any English medium peeps here ? I am from Bangla medium. Can I give it though?",
  "description": "Hi everyone, I am from Bangla medium. I am planning to apply to the UK for the fall of 26. Only UCL gives a full-ride scholarship to 10 International students. So they only accept A-level results, so I have to take the A-level exam. Like they accept the predicted score. So, which school will be the best and affordable to give the A-level exam? I am in a hurry, and how much do I need it? I will be applying for the USA also, so it will be helpful for both",
  "votes": "2",
  "comments": [
    {
      "text": "First of all, A level exams are not like SAT or IELTS where you can just take a short prep and give exam. Its like the hsc, and meant to be studied over two whole years. Since you are from Bangla medium, it will be extremely difficult to learn and solve questions in english since all the subject content is in english. Please do some research and check papers of the subjects that you want to take. It is literally a BOARD exam, under the cambridge board. So in class 10 you guys give ssc exam and in english medium we give o levels. In class 11 and 12 we give the A levels. I am not sure how you plan to even sit for A levels since you need o level foundational concepts for it. I suggest just give the SAT and apply to the US because I dont think you still understand what A levels actually are.",
      "votes": "2",
      "replies": [
        {
          "text": "yooo dude chill i just saw the A levels paper lmao the questions of furhter math is like basic board math of our nctb books lmao if i sit now i can easily can get a A. I am from Physics olympiad background like won 4 time national BDPHO. and i saw the questions of physics lmao they just coppied the physics practical of our nctb books. The A levels is the easist exam than SAT cz the english section of SAT is unpredictable . I have seen all the questions of A levels they are literally basic things lmao. i wonder why this english medium peeps struggle with this exam this exams are more easier than Nctb. Buet question is more harder than this shi. One of my classmate from NDC got 5 out of 5 in all his AP exams. He took 8 aps got 5 in all of them. Bangla medium peeps are way more capable than those farm er previlleged murgi who cant solve this type of easy questions of A levels. lmao",
          "votes": "0",
          "replies": [
            {
              "text": "For physics which paper are you looking at? Paper 1,2,3,4 or 5? Because each paper is different. Practical paper is 3 and 5 one of which is an actual lab practical and another one is written so of course its relatively basic. Eto hostile howar ki ase ami honestly bujhlam na. SAT ke hard bolteso? I studied for a week and got a 1510 score in it, tomra bangla medium er polapain toh full year dhore coaching koreo pao na. IELTS e literally just mock exam practice kore 8.5 paisi, tomra bangla medium polapain toh ielts niye kanna kati coaching koreo 6.5 ke \"dream\" bolo. NCTB er theke beshi thorough na A level syllabus, but difference is je A levels e kono 'common' question ashe na. Tomra toh previous year question and guidebook er 'common question' mukhosto kore boshay dao. Every year amader different question ashe concepts ke different bhabe apply kore. Thik year er paper o toh mone hoy dekho nai, cuz A level is divided into AS and A2, ekta 11 e dewa hoy aar arekta 12 e. Humble howa shikho, proper advice chaiso and ami disi. Eto je NCTB ke baraye bolteso, tomader curriculum eto ta shit je beshirbhag countries toh tomader curriculum accept e kore na to apply. A levels around the world onek countries ekshathe dey, and grading hoy internationally so tomader moto government corruption er jonno marks baraye dey na amaderke. Giye dekho age koto ta difficult subjects e A* pawa tarpor kotha bolte asho. Ami amar A levels grade diyei full tuition scholarship peye gesi hong kong university of science and technology e bsc mechanical engineering e, world ranking e top 50 er around e ase. Tomar buet er rank ki jani? 700 cross korse ekhono? SAT and IELTS ta disi just to strengthen my profile kintu kono point ei mandatory chilo na. lmao.",
              "votes": "2",
              "replies": []
            }
          ]
        },
        {
          "text": "Literally this is your hardest question dude? this question is our basic level questions from Ishaque Book lmao. Did you ever see the physics olympiad question you will just cry after seeing the question.",
          "votes": "0",
          "replies": [
            {
              "text": "First of all this is a AS paper so class 11 e dewar kotha, second of all ami kokhon bolsi this is the hardest question? Chapter 2 er basic ekta question ber kore 'hard' bole label toh tumi e korla. Amar year thekei ekta question attach kore dilam, structured paper theke. Cherry pick kore easy questions shob board thekei kora jay. Atleast standard questions ber kore tarpor kotha bolo.",
              "votes": "2",
              "replies": []
            },
            {
              "text": "Na jene na bujhe je eto kisu bolte asho, A levels e practical tao tomader tar cheye khubi different. Nije toh research korba na tai ektu tomake help e kore dilam by attaching two relatively easy past paper questions. Every year notun ekta type er erokom experiment design korar question ashe. Kono book theke 'mukhosto' ba attendance dekhaye eshob e number paba na hsc er moto. On the spot knowledge and concept apply kore kora lage. Ami original post e eta boli nai je 'ur dumb so u cant do a levels', i said it because the question pattern and skills needed are different.",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 47
}