{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pdc5ei/seeking_advice_for_admission/",
  "hash": "52b534ba2cfdb49a0238e31c5c34bc4e",
  "scraped_at": "2025-12-10T00:54:31.572301",
  "title": "Seeking advice for admission",
  "description": "Hsc25 here, I'm an engineering aspirant. My admission prep has mostly followed Udvash's routine. I've attended their classes regularly and kept up with their system.( Ami tukhor batch a silam, eibar r tukhor batch ta motamoti valo silo, eijonno regular class korsi). I also enrolled in the ACS engineering course as well, but honestly, I never got enough time to go through their slides. I checked a few physics and math slides.\nNow, that udvash has started model tests, I barely find time to study or cover ACS slides. I'm worried because I haven't even properly started them. How can I manage my time now and actually cover ACS without ruining my model test prep?\nI also applied for architecture in buet and mist but I haven't taken any architecture preparation yet. ( I had some health issues) . Now only 35 days are left for buet. Is it possible to prepare for architecture now? I'll try for 50-60% since I also have gap in my main syllabus. Ami motamoti drawing pari, ekdom baje o na...",
  "votes": "90704",
  "comments": [
    {
      "text": "As an admission candidate, you need to utilize your time wisely. You have enrolled in some courses, but if you don’t have enough time to complete the main syllabus and address your weaknesses, there’s no need to take on new challenges.\nThis is not the time to learn more or enroll in additional courses. It’s time to focus on improving efficiency and making fewer mistakes in the model tests. If you believe you are in a state where you can take on new challenges while working efficiently, then you can go for it.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Try to give at least 1 hour of drawing daily. Give your best according to your priorities.",
      "votes": null,
      "replies": []
    },
    {
      "text": "You don’t need to practice slides and new content from another coaching if you have already covered up your syllabus. Focus on time management and giving exams and solve question banks. I mean what’s the point of going through slides of another coaching if you have done. They are both the same.",
      "votes": null,
      "replies": [
        {
          "text": "Got it. Thanks",
          "votes": null,
          "replies": []
        }
      ]
    }
  ],
  "id": 5
}