{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oi9l2d/i_chose_science_because_my_school_didnt_have_arts/",
  "hash": "3386058451d2e49a51dd08f00c1cb58c",
  "scraped_at": "2025-12-10T01:07:34.285480",
  "title": "I chose Science because my school didn’t have Arts or Commerce in English, now I’m in class 10 and totally lost. Should I drop this year?",
  "description": "I’m from Sylhet, in class 10 English version NCTB, and honestly I feel really stuck.\nI never attended any public exam before cause by my time JSC and PSC were stopped. So this is my first real board exam and it feels too much sometimes.\nI took Science not because I wanted to but because my school don’t have Arts or Commerce in English. I thought I could manage somehow but Physics makes no sense and I’m very weak in math. I feel like I’m forcing myself to study something I don’t even enjoy.\nLast year we studied that new weird curriculum and now it changed again this year, they removed few chapters but still confusing.\nI’m more into history world affairs and politics. I like learning how countries and leaders change the world. But nothing like that exist in Science, so it just feels like I’m wasting time.\nShould I just finish SSC this year and change to Arts later or drop now and start again? Anyone been in same situation? Need some advice.",
  "votes": "5",
  "comments": [
    {
      "text": "You can join scholasrshome, they have business in English version",
      "votes": "2",
      "replies": []
    },
    {
      "text": "If your parents allow it, drop the year. Ultimately during uni admissions only your HSC year matters so this won’t have an impact.",
      "votes": "1",
      "replies": [
        {
          "text": "I don't really have any plans to attend uni admissions.I thought you would've expected, as I'm from sylhet I'm just planning to somehow leave this country anyhow! My parents don't have any issues but the problem is I couldn't really find schools that have English version Humanities or Business . I'm just really mentally devastated it seems like I'm the only person who's astronomically weak in physics and maths in my class",
          "votes": "1",
          "replies": [
            {
              "text": "In that case dropping a year wouldn’t really help anyway. You need a good tutor at home, and some mechanisms to gain confidence and reduce anxiety (anxiety and quantitative subjects do not mix well).",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Finish SSC then switch to Arts later. You won't be missing much.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 55
}