{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ogp50h/%E0%A6%B9%E0%A6%95%E0%A6%B0%E0%A6%A6%E0%A6%B0_%E0%A6%AA%E0%A6%B0%E0%A6%A4_%E0%A6%A2%E0%A6%AC_%E0%A6%B6%E0%A6%95%E0%A6%B7%E0%A6%B0%E0%A6%A5%E0%A6%A6%E0%A6%B0_%E0%A6%AC%E0%A6%A6%E0%A6%AC%E0%A6%B7_%E0%A6%A6%E0%A6%96_%E0%A6%AC%E0%A6%9D%E0%A6%B2%E0%A6%AE_%E0%A6%8F%E0%A6%87_%E0%A6%AC%E0%A6%B6%E0%A6%AC%E0%A6%AC%E0%A6%A6%E0%A6%AF%E0%A6%B2%E0%A7%9F%E0%A6%B0/",
  "hash": "872b0ea54e6753d20f45b4758e52dc63",
  "scraped_at": "2025-12-10T01:07:50.510383",
  "title": "হকারদের প্রতি ঢাবি শিক্ষার্থীদের বিদ্বেষ দেখে বুঝলাম, এই বিশ্ববিদ্যালয়ের শিক্ষার্থীগুলো সব গাড়ল, এরা কোনো শিক্ষাই গ্রহন করে না, শুধু প্রতিষ্ঠানের অহংকার নিয়ে ব্যাস্ত।",
  "description": null,
  "votes": "43",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "হকার মানে কারা জানেন? যারা দিন দুপুরে গাজার ব্যবসা করে। যারা রাস্তা দখল করে বিজনেস করে। যারা রাস্তার উপর তাবু বানায়। যারা রাস্তায় বসে ড্যান্ডি খায়। যারা রাস্তা ব্লক করে লম্বা লম্বা জ্যাম লাগায়।\nসোস্যাল মিডিয়াতে দেখে নানান মন্তব্য করা যায়। কিন্তু নিজের উঠোনের উপর কেউ বাড়ি বানালেই গলা ফেটে যায়। একদিন ঢাবিতে যাইয়া দেইখেন কী অবস্থা হয় উদ্ভাস্ত লোকদের কারণে।",
      "votes": "66",
      "replies": [
        {
          "text": "Do you hear yourself? You are classifying all of these people as hawkers while disregarding how the mass people in this people struggle daily and how the economic condition is so bad. I do understand that this can be an issue in terms of safety and cleanliness, but how people like you disregard the other factors here is what makes me angry.\nWhy are you classifying drug addicts and poor people earning their livelihood by doing business under the same label?\nWho gave you the authority to kick them out? That too, with violence and disregarding human rights.\nDo you honestly believe due process was followed here?\nAlso, this post is for you.",
          "votes": "4",
          "replies": [
            {
              "text": "This comment shows how disconnected you are from ground reality. There are like hundreds of cases where female students complained that some of these 'hawkers' were masturbating seeing them. There are evidences all over university group. Harassment cases are there everyday. The administration never did anything to address the issue. I don't care what process was followed but safety of students take precedence over rights of hawkers(harassers) to sell at an UNIVERSITY.",
              "votes": "8",
              "replies": []
            },
            {
              "text": "",
              "votes": "9",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "so dhaka university has to accommodate and let those hawkers block footpath? even at the cost of students dissatisfaction?\nfor what? tahole to sob graduate rai rastar pashe dokan diye daray jabe. job khojar dorkar ki rastay cake becho momo becho\najob to eder take care korar dayitto ki dhaka university nise. eisob faltu alap kottheke pay manush",
      "votes": "40",
      "replies": [
        {
          "text": "why only DU? who want their footpath to be blocked anyway?",
          "votes": "3",
          "replies": []
        },
        {
          "text": "",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "ami sans pai nai, tai ami kichu bolbo nah T T",
      "votes": "18",
      "replies": []
    },
    {
      "text": "বাঙ্গু বাম যে কি চায় বুঝা মুশকিল। এরা দুনিয়ার সব বুঝে কিন্তু ভার্সিটি এরিয়ায় কেন ভবঘুরে, নেশাখোর, মাদকবিক্রেতা থাকতে পারবে না এইটা বুঝে না।\nপগতিশীলতার নামে আবলামি না করলে আবার বাম হওয়া যায় না।\nএকটু পরেই নিজেকে শিবিরের লিস্টে দেখতে পাবো। ( বাঙ্গু বাম মনে করে তার বিপক্ষে কেউ বললেই সে শিবির )",
      "votes": "23",
      "replies": []
    },
    {
      "text": "যাদের কে আপনারা দেখেন, তারা মূলত গ্রামের গরীব মাইনষের সন্তান, এখানে আইস্যা হনু হইয়া যায় আরকি",
      "votes": "5",
      "replies": []
    },
    {
      "text": "আসল গাড়ল তো পোস্টদাতা, এসব গাড়ল চায় দেশ কেন ইউরোপীয় আমেরিকান দের মতো নিয়মশৃঙ্খলা প্রতিষ্ঠা করা হয় না আবার মাদকের সাপ্লাই দের জন্য মায়া কান্না দেখাই।",
      "votes": "8",
      "replies": []
    },
    {
      "text": "আমরা জাতি হিসেবে এমনই। ঢাবি আলাদা হবে এটা আশা করা যায় না।",
      "votes": "7",
      "replies": []
    },
    {
      "text": "",
      "votes": "4",
      "replies": []
    },
    {
      "text": "As an alumni, I have to agree. Shame on DU.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Some friends you had!",
      "votes": "4",
      "replies": [
        {
          "text": "Some friends you had!",
          "votes": "7",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "3",
      "replies": []
    },
    {
      "text": "why are they doing their business without the permission of the authorities?",
      "votes": "2",
      "replies": []
    },
    {
      "text": "আপনি আপনার জায়গায় তাদেরকে জায়গা করে দেন...",
      "votes": "2",
      "replies": []
    },
    {
      "text": "they always does it. Remember few months earlier what they did to Motocop guy.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "আপনি এখন বুঝলেন ওরা গাড়ল? আমি তো যখন শিবির ডাকসু নির্বাচনে জিতলো তখনই বুঝে গেছি।",
      "votes": "1",
      "replies": []
    },
    {
      "text": "বিষয কিছুই না। ছাত্রলীগ আগে একবার যা করার চেষ্টা করছে এইসব দোকানপাট নিয়া, শিবির এক্সাক্টলি তাই করতেছে। পার্থক্য হইতেছে শিবির একটা ন‍্যারেটিভ তৈরি করছে যে তাদের বিপক্ষে গেলেই হয় মাদক ব‍্যবসায়ী, এইটা বলে তারা একটা মোরাল জাস্টিফিকেশন ক‍্যাম্পেইন করতেছে।\nসোহরাওয়ার্দী উদ‍্যান কিন্তু ঢাবির আন্ডারে না। তবে জামাতের সাথে এইটার একটা সম্পর্ক আছে। ঢাকা বিশ্ববিদ্যালয় ঐতিহাসিকভাবেই সারা দেশের কমিউনিটি মেইনটেইন করে আসছে। তো বহিরাগত মানেই গাঞ্জুট্টি, অনিরাপদ ক‍্যাম্পাস এইরকম ন‍্যারেটিভ তৈরি করতে পারলে ভবিষ্যতে তাদের পছন্দের লোকজন ছাড়া বাকীসব ত‍্যাজ‍্য করতে সুবিধা হয়।\nযেমন অলরেডি শরৎ উৎসব বন্ধ করে দিছিলো। সামনে হয়তো বলবে পহেলা বৈশাখে বিশ্ববিদ্যালয়ের বাইরের কেউ যাইতে পারবে না… ইত‍্যাদি ইত‍্যাদি। ঢাবি থেকে কমিউনিটিরে আলাদা করলেই মূল সাফল‍্য।",
      "votes": "0",
      "replies": []
    },
    {
      "text": "The only \"institutional pride\" that a student should have is in terms of academic excellence. Suffice it to say no public university actually meets that requirement (maybe some faculties in some unis, but not as a rule).\nThere was a popular idea flying around when I was prepping for uni admission a long time ago - that apparently DU was supposed to be leading the people into prosperity, that they represent the future leaders in all sectors. Well, if you think a little about it, it points to that misplaced sense of elitism and superiority without the backing of substance, the vibe that simply studying at DU makes you one tier higher than everyone else - fits perfectly into how events are turning out! Well, they might very well be the leaders and pioneers of this society, which would explain the absolute state of matters right now 😂😂",
      "votes": "0",
      "replies": []
    },
    {
      "text": "",
      "votes": "0",
      "replies": [
        {
          "text": "It's not what you want, it's how you do it and how you disregard the other factors.",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "Now a days there have no benefits of education. Every one student is learning to be proud not learning any respect to any work.",
      "votes": "0",
      "replies": []
    },
    {
      "text": "😆😆😆😆😆",
      "votes": "0",
      "replies": []
    },
    {
      "text": "What is the problem of some guys? Mane eshob hawkers der dayitto,outsider der dayitto University nibe?. Ducsu leader der badha deyar dorkar nai. Shobai University ke ekta মেলা baniye dik",
      "votes": "-2",
      "replies": []
    },
    {
      "text": "ভর্তি হয়ে দেখিয়ে দেন। নাকি মুরুদ নাই",
      "votes": "-3",
      "replies": []
    }
  ],
  "id": 56
}