{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oeuud0/looking_for_bangladeshi_students_in_uva/",
  "hash": "2280961a192dc5b2ad94ff6ac074211b",
  "scraped_at": "2025-12-10T01:08:56.985445",
  "title": "Looking for Bangladeshi students in UvA",
  "description": "Hey everyone!\nI’m looking to connect with any Bangladeshi students currently studying undergrad in Amsterdam, especially those at universities like UvA, VU, or any others nearby.\nCould you please share a bit about how you got in, what the application process was like, and how life is there (academics, culture, part-time work, etc.)?\nAlso really curious about student housing — how did you find accommodation, and how difficult is it to get? Lastly, any advice on chances of getting in and how to best prepare would mean a lot!\nThanks in advance!\nI'm currently doing my first semester in a BD Uni, but really want to go abroad. My top choice rn is Uni of amsterdam, I already got into a university in New Zealand, but it's around 45-50 lacs, whereas from my research, Amsterdam is doable within 25-30 lacs. anways, please give your thoughts !",
  "votes": "4",
  "comments": [
    {
      "text": "Amsterdam is one of the most expensive cities in Europe. The living cost itself would be easily 1k or more per month. You may want to check out other university towns. That being said, student dorm rooms are cheaper in comparison so there's a lot of competition. Apply for a room the moment you get an acceptance letter, don't wait for the visa.",
      "votes": "2",
      "replies": [
        {
          "text": "My initial thought in general was this, but once i compared, cuz i pretty much applied to almost all of the popular countries (us,uk,aus,nz) , all of them have living cost that more expensive. Pretty much comparing those to amsterdam feels like amsterdam is a steal (even though i know its not) im a bit torn if i should stick to NZ or actually opt for amsterdam. And thank you so much for ur advice!",
          "votes": "2",
          "replies": []
        }
      ]
    }
  ],
  "id": 60
}