{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oe2ylv/i_feel_genuine_grief_for_the_students_of_my/",
  "hash": "cafe590ae9762235c69fed609cabab91",
  "scraped_at": "2025-12-10T01:09:43.703903",
  "title": "I feel genuine grief for the students of my country.",
  "description": "Source:ICT (Panjaree),Class 8,English Version (National Curriculum)",
  "votes": "141",
  "comments": [
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "ইমেইল আইডির পাসওয়ার্ড রেঞ্জ জেনে ঠিক কি উপকার হবে?\nআচ্ছা আনরিলেটেড - মুস্তফা জব্বার কই থাকে কেউ জানেন?",
      "votes": "54",
      "replies": []
    },
    {
      "text": "Absolutely rubbish",
      "votes": "49",
      "replies": []
    },
    {
      "text": "The whole system is garbage. I hate the srijonshil system the most. Mfker there was no reward for creative writing. They just judged how much bloat the answers were.\nAfter I burst out of my FB bubble, I learned so many interesting stuff.",
      "votes": "32",
      "replies": []
    },
    {
      "text": "",
      "votes": "29",
      "replies": []
    },
    {
      "text": "Yes mom. I'm learning about how to recognise a real email I'd while the world printing millions of dollars making ai startups.",
      "votes": "70",
      "replies": []
    },
    {
      "text": "Ik we criticise india and all, but I studied there from class 8, and trust me computer was my fav subject!\nThey are wayyyy ahead man. It’s genuinely upsetting Bangladesh lacking this much in one of the most important sectors.",
      "votes": "44",
      "replies": [
        {
          "text": "I studied in Kurseong and i can totally relate to you. I got in early tho(class 3), however upon reading some of my b'deshi friend's question paper, i realised where the difference was",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "\"এই কারিকুলাম দেশের গ্রাম-শহর সকল শিক্ষার্থীর কথা বিবেচনা করে প্রণয়ন হয়েছে\"\nstfu bruh the world including india is at least 9 steps ahead of us 😭",
      "votes": "39",
      "replies": []
    },
    {
      "text": "I once saw a question \"vlc media player ইন্সটলের ধাপ কয়টি?\"",
      "votes": "8",
      "replies": [
        {
          "text": "ssc 2023 er question, amar batch",
          "votes": "3",
          "replies": [
            {
              "text": "Correct answer ki chilo? 😭",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Well ami jani na except for konta correct email id ar abbreviate form ki, but atleast email id acc create korte kichu jana lage nai step by step.",
      "votes": "7",
      "replies": []
    },
    {
      "text": "",
      "votes": "5",
      "replies": []
    },
    {
      "text": "And still they be like… ICT is too tough 🐸🙏🏽",
      "votes": "9",
      "replies": [
        {
          "text": "inter er da poro bhai, it goes from email id er nam ki to Programming in a snap,\nand thats the reason most kids struggle even tho its like programming abc’s\nthey struggle because they didnt have a base about this topic.",
          "votes": "23",
          "replies": [
            {
              "text": "Inter eo shob basic jinish poray, bruh programming er p o nai inter er boi gula te… na bujhe porle hard to lagbei… amar nijer students chilo kichu bolto inter er ICT hard even ora pass korteo struggle korto… jak ami oder 6mash poraiya ICT A anaisilam lol… Jodi bujho jinish potro it’s as easy as ABC…",
              "votes": "6",
              "replies": []
            }
          ]
        },
        {
          "text": "Auto pass batch ?",
          "votes": "4",
          "replies": []
        }
      ]
    },
    {
      "text": "Ict subject ta asolei valo moto porayna, boi gulay kajer kotha barta temon kichu nai, eto important ekta subject nie eirokom helafela kortece",
      "votes": "4",
      "replies": []
    },
    {
      "text": "This is baad.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "HSC Kintu comparatively onek better",
      "votes": "6",
      "replies": []
    },
    {
      "text": "RUBBISH!",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Boomer questions",
      "votes": "3",
      "replies": []
    },
    {
      "text": "get off reddit",
      "votes": "2",
      "replies": [
        {
          "text": "get off reddit",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "meanwhile বাংলা বেকরণে ইমেল আর খুদে বার্তা লেখা লাগে I think bangladesh is the only country jeikhane khatay email lekha lage",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Tell me about it man...",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Sorry if it's offensive but I genuinely don't understand how can a student manage to fail a test when pass mark is less than 40 percent. Like what do you even do the entire year!?.Pass Mark have to be 60 percent 55 at least",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 63
}