{
  "url": "https://www.reddit.com/r/bangladesh/comments/1oao17n/can_i_get_some_help_actually_liking_bangla/",
  "hash": "ca83649ff9505872997919dc84f35e0f",
  "scraped_at": "2025-12-10T01:10:50.192813",
  "title": "Can I get some help actually liking Bangla?",
  "description": "So, I'm an English Medium student, and I've never really liked Bangla. Like, I know that it's my mother tongue, and I love Bangladesh, but I've never managed to love the language. But I really want to. I want to be able to read Rabindranath Thakur and Kazi Nazrul Islam in the original, I want to be able to access this whole world of literature I've been blind to all this time. So, can anyone please give me tips on how? All the stuff I find online is for people who don't even know Bangla. But I know it, it just seems so hard.\nEDIT: I CAN READ BANGLA, I'M LOOKING FOR ADVICE ON HOW TO MAKE IT NOT FEEL LIKE I'M DOING HOMEWORK",
  "votes": "10",
  "comments": [
    {
      "text": "Start with something light.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Idk. Maybe start with reading \"তিন‌ গোয়েন্দা\" series and Basic Ali comics. Easy Bangla. Or, you could read the autobiography of your person of interest in Bangla. Then, slowly dive into all the other books.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "I don't understand y'all honestly. I'm a Bangla medium student but I'm fluent in English on a near native level, pronunciation and all. I never had issues with Bangla or English. I read a shitton of Bangla and English literature all throughout school. Don't y'all talk in Bangla at home?? Y'all live in this country 😭 আমার কাছে এসব ন্যাকামি মনে হয়। তুমি বাংলাদেশি, আমেরিকান না ,twin 🥀",
      "votes": "2",
      "replies": []
    },
    {
      "text": "I was born in Bangladesh and grew up in America since age 9. My Fupu used to send me books by Narayan Gangapdhya for me to keep up my Bengali reading skills. They are hilarious stories and easy to understand. I’ve even read some Humayun Ahmed novels when visiting Bangladesh. Basically start with something easy and these are easy, enjoyable books.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "পাছা",
      "votes": "1",
      "replies": [
        {
          "text": "Sai akta reply disan.",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "I never knew EM students can't even read Bengali, doesn't it feel same as someone illiterate asking for help to read a Bangla poster or something",
      "votes": "-1",
      "replies": [
        {
          "text": "Why insult him, he is a kid.\nWe should critise schools and the ministry but yeah thats way more difficult to do than insulting a kid.",
          "votes": "5",
          "replies": []
        }
      ]
    },
    {
      "text": "start with something easy, when you're quite comfortable with it, you can start reading novels from bibhutivushon, shomoresh or shunil, all the best.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "বর্ণ পরিচয় দিয়ে শুরু করুন",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Its because schools are lutha.\nBengali is a very superior language and there are plenty of fun facts to learn that will get you hooked.\nDo you know why poetry and fishermen songs (majhi) are so culturally ingrained?\nIts because this is how news and rumors were passed around back then.\nEver heard of \"khoka ghumalo, para juralo. Borgi elo deshe\"?.\nThis isnt simply a nighttime lullaby but there is a real sinister story of burglers behind it.\nThere is many more things like this that will fascinate you.\nDid you know bengali language is also gender neutral?\nThere is an instagram bookclub called bookstagram, i'd suggest you join them and start reading some bengali gems, you'll fall in love with the language.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "",
      "votes": "1",
      "replies": []
    },
    {
      "text": "\"I want to be able to read Rabindranath Thakur and Kazi Nazrul Islam in the original\"\nYou are not missing much, both are dreadfully boring with long winding prose. A case can be made for thakur, najrul is a complete waste of time.\nStart with something short and simple, jokher treasure/humayn/kalbela anything.\nRead pother pachali, you will have a hard time getting acquainted with sadhu, but stick to it long enough to discover one of world's greatest literary piece.\nLoving a language happens through its people, no one in this language has written a better character than durga.",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 67
}