{
  "url": "https://www.reddit.com/r/bangladesh/comments/1o996rf/about_my_admission/",
  "hash": "c1e17619a339afe91ce0e8f2d0d37539",
  "scraped_at": "2025-12-10T01:11:21.907149",
  "title": "About my admission",
  "description": "Hello everybody. So I gave my admission test at AUST and the results were published. Alhamdulillah! I got into their merit list but my merit position is 1195. So according to its standards, I might get either IPE or TE. Now the thing is, I wanna study for EEE and honestly speaking, I don’t wanna continue in udvash furthermore for public uni admissions. It’s too chaotic for me. So my question is which uni after AUST would be better for EEE. AIUB or BRACU or NSU or IUB? Also please tell me about the quality of the EEE faculties there.",
  "votes": "3",
  "comments": [
    {
      "text": "AIUB, AUST, BRAC, NSU, EWU, IUB...mostly these are the top private universities in Bangladesh. So, go for whichever is cheaper, close to your residence, and lets you study EEE.",
      "votes": "3",
      "replies": []
    },
    {
      "text": "I'm in AUST EEE. So when i gave my AUST exam it was kind off so so that i might not get EEE. My target was also EEE. If i didn't get AUST my targets were AIUB and EWU. Mostly because of the cost, NSU & BRAC also have great EEE departments but the cost there is too much. So at the end it's totally up to you where you want to go for.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Honesty mate if it's Possible apply for scholarships abroad, cause in EEE i Don't think any uni in BD(including AUST)is qualified, but if your hands are tied you can go for AIUB/BRAC. Getting a scholarship in china/japan will be comparatively easier, especially china.(AUST CSE here,i know what kind of shit they teach in EEE at my uni and what type of clowns teach them)",
      "votes": "2",
      "replies": [
        {
          "text": "Could you kindly tell me about what makes you think AUST EEE program isn’t that relatively good according to you though?",
          "votes": "1",
          "replies": [
            {
              "text": "Number of proff in the faculty, conditon of LAB equipments,Research funding + research opportunity All these aspects",
              "votes": "1",
              "replies": []
            }
          ]
        },
        {
          "text": "lol. what a stupid advice",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 69
}