{
  "url": "https://www.reddit.com/r/bangladesh/comments/1o4n4p1/is_that_a_wise_choice/",
  "hash": "55e342f722e82e844b255ba610ac6199",
  "scraped_at": "2025-12-10T01:12:54.166081",
  "title": "Is that a wise choice ?",
  "description": "*Photo for attention*\nSo basically amr ek choto bhai private ek college e jeye bhorti hoise , chele abr science e ,, ekhon 1 2 week class kore or obostha tight like daily jawa lage r basha thekeo onek dur ,, like daily bhara jai 160tk and frnd er shate gele 80tk like split hoi rki . Jaihok so now he is planning to take tc and admit himself to a gov clg jekhane porar man o nai and class e jawa niye perao nai .\nobv ik NDC HCC er moto top hate guna olpo kisu clg chara kono clg e poralekha hoi na still or jei private clg okhane onek bhaloi porai like u can take it 70% of NDC level\nso the Pro to stay at private clg for him is he will get students who can help in hsc exam and he might get a easy guards tho that is not fixed but atleast good students who can help . Cons is daily travel and alot of pressure .\nGov has the pro like he doesn't need to go to class daily like even once in a week is enough and its close to his home too . Cons is he will be surrounded with weak students who will rather disturb him in exam so like no Help in exam .\nprivate will cost him 70k per year and Gov will cost him 15-18k per year .",
  "votes": "90705",
  "comments": [
    {
      "text": "\"Cool people in private\" 🤓🤓🤓\nClg e giya kono lav nai",
      "votes": "1",
      "replies": [
        {
          "text": "ikr but that 100tk fine for per absent is crazyy",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Forget about your brother. I'm concerned about you man. You need to learn some manners.",
      "votes": "1",
      "replies": [
        {
          "text": "mybad i was trying to be frank from my pov actually ,, i see alot of ppl is getting offended with that thing i said \"gov clg er students bosti\"\nI didn't mean that , I meant amr oi choto bhai jei gov clg e transfer nibe oitai bosti polapain beshi and Ik that pretty well I mean what do u expect from a student with gpa 1 or 2 .\nTho I didn't mean all of them but most of em",
          "votes": "1",
          "replies": [
            {
              "text": null,
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "Same obostha amaro rn tbh.",
      "votes": null,
      "replies": []
    },
    {
      "text": "Ami eida poira nijei gobet hoiya gesi.",
      "votes": null,
      "replies": [
        {
          "text": "us",
          "votes": null,
          "replies": [
            {
              "text": "Not us Bhai. Clearly not us. Please never say us again.",
              "votes": null,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "In which language did you write this post?",
      "votes": null,
      "replies": [
        {
          "text": "mybad i was trying to be frank from my pov actually ,, i see alot of ppl is getting offended with that thing i said \"gov clg er students bosti\"\nI didn't mean that , I meant amr oi choto bhai jei gov clg e transfer nibe oitai bosti polapain beshi and Ik that pretty well I mean what do u expect from a student with gpa 1 or 2 .\nTho I didn't mean all of them but most of em",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "How old are you? Do you have any idea about govt colleges? I was in both gov school and clg and i dont think if i ever saw a bosti polapain as you are referring to. Private college er polapain to shob chicken hoy eita bolle to thik e offend kheye jaba.",
      "votes": null,
      "replies": [
        {
          "text": "mybad i was trying to be frank from my pov actually ,, i see alot of ppl is getting offended with that thing i said \"gov clg er students bosti\"\nI didn't mean that , I meant amr oi choto bhai jei gov clg e transfer nibe oitai bosti polapain beshi and Ik that pretty well I mean what do u expect from a student with gpa 1 or 2 . its just a local gov clg.\nTho I didn't mean all of them but most of em.",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "Did you ever get proper education from your family or school. Calling people from gov college \"bosti\" really shows your cheap mentality",
      "votes": null,
      "replies": [
        {
          "text": "mybad but I didn't mean that , I meant amr oi choto bhai jei gov clg e transfer nibe oitai bosti polapain beshi and Ik that pretty well I mean what do u expect from a student with gpa 1 or 2 .\nTho I didn't mean all of them but most of em",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "It's hard to tell without knowing which colleges you are talking about. But do know this, a person's personality, manners and interests, are largely shaped by the company they keep. So before making the decision to move, I think it would be wise to research the environments of both colleges, what extracurriculars they offer (if your cousin is into those) and what the general student is like there.",
      "votes": null,
      "replies": [
        {
          "text": "yeah I get it ,thanks for this .",
          "votes": null,
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "2",
      "replies": [
        {
          "text": "actually his college result record is very good and its in top 20clg in dhaka . They have 0 fails for 7 years in streak and the admission results r good too . They even take classes for admission in the clg so yeah this private clg is small and doing good but yeah so much pressure ,, guess what , today he went to clg but he was 10mins late thats why they didn't even let him enter the clg . bro is more motivated to leave this clg lmao",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": null,
      "replies": []
    },
    {
      "text": "amon kono line nai jeita bad dibo 😭😭",
      "votes": null,
      "replies": []
    },
    {
      "text": "Like?",
      "votes": null,
      "replies": []
    },
    {
      "text": "\"When he finds out the next chapter discusses 'Reproduction.' 😂\"",
      "votes": null,
      "replies": []
    }
  ],
  "id": 75
}