{
  "url": "https://www.reddit.com/r/bangladesh/comments/1o0mjhc/what_is_the_poem_hattimatim_tim_even_about/",
  "hash": "c21958eca8df4b1b97daf510c77f8446",
  "scraped_at": "2025-12-10T01:13:56.266577",
  "title": "What is the poem \"hattimatim tim\" even about ?",
  "description": "We've been listening to this poem since our childhood. Does anyone actually know what this poem means ? I saw somewhere in the reels that says the poem is written to mock the british people idk. Please enlighten me if anyone of ya'll know🙏",
  "votes": "13",
  "comments": [
    {
      "text": "Ghorar dim poem",
      "votes": "5",
      "replies": []
    },
    {
      "text": "Ghorar dim poem",
      "votes": "4",
      "replies": []
    },
    {
      "text": "It's a nonsense rhyme, so probably not too meaningful to begin with",
      "votes": "3",
      "replies": []
    },
    {
      "text": "Perhaps the writer is scaring kids so that they go to sleep early after eating, as the outside is not safe, and there could be man-eaters. The Bengal was once full of demons and bad jinns. Especially the rural areas are haunted af. I even heard Dhanmondi had foxes and used to bite people during the 1940s. Welcome to the Wild South.",
      "votes": "2",
      "replies": [
        {
          "text": "And what about the egg part ? Who are laying eggs on the field ?",
          "votes": "3",
          "replies": []
        },
        {
          "text": "yeahh i remember it was so scaryy\n\"Hattimatimtim\" 👿\n\"Tara mathe pare dim\" 🥶🥶",
          "votes": "1",
          "replies": []
        }
      ]
    },
    {
      "text": "Its about rhyme, phonemic play, aiding early speech and memory formation. They rhyme is deliberately nonsensical as it invites children to embrace absurdity, encourage divergent thinking and exercise imagination,. Have a look at Lewis Carol's Jabberwocky. Its fun.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Ghorar dim poem",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Brainrot Rokonuzzaman Khan and his Moshtishko in some different universe. Read Sukumar Rays poems purai brainrot✨ Ami Gog and Magog o bhabsilam seeing the drawings, so disgusting! (I don't know why)",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Ghorar dim poem",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Ghorar dim poem",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Ghorar dim poem",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Ghorar dim poem",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Ghorar dim poem",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Ghorar dim poem",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I’m not completely sure, but I heard that it was written as a criticism of the government at that time, showing how they wanted to recruit employees with unrealistic or impossible qualities. \"Shing o thakbe abr dim o parbe\"",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 79
}