{
  "url": "https://www.reddit.com/r/bangladesh/comments/1ny0iuk/second_timer_in_admission_test/",
  "hash": "a0e55b6706a05a27d84a87dee014119e",
  "scraped_at": "2025-12-10T01:14:58.212885",
  "title": "Second Timer in admission test",
  "description": "So i am studying bpharm Professional in North South University and i have decided to go for second time admission test at University of Chittagong. Financial struggles are of reasons but the sheer social and family pressure is crushing me. Even my ex left me cus she is in University of Chittagong and im in NSU. Even though i got into SUST, i didnt go cus i was aiming for physics but i got oceanography. Any suggestions for me?",
  "votes": "3",
  "comments": [
    {
      "text": "Broaden your choice list. Why only Chittagong University? There are other good options for 2nd timers. Even you can apply in Medical Admission Test also.",
      "votes": "2",
      "replies": [
        {
          "text": "I have a liking to their ACCE so i am going for it. And personally i have no interest in medical sector, Thanks a lot for your advice. I’ll keep RU in my choice",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "Do Keep sust in your list as a 2nd timer.",
      "votes": "1",
      "replies": [
        {
          "text": "I will do so. Thanks a lot",
          "votes": "1",
          "replies": []
        }
      ]
    }
  ],
  "id": 83
}