{
  "url": "https://www.reddit.com/r/bangladesh/comments/1noc7ca/mbbs_after_alevels/",
  "hash": "fa3a542fffa7fa9c2d911ed001601a7c",
  "scraped_at": "2025-12-10T01:17:37.896825",
  "title": "MBBS After A-levels",
  "description": "Hey guys bangladeshi here\ncontext : I was born and raised abroad (in UAE) for 16 years, completed my IGCSES in grade 10 and now in Bangladesh pursuing A-Levels (CIE). So far I've completed my AS (grade 11) with 4a's, And currently we have a class test that will finish soon. After that we we have Holidays for Puja Moday to thursday followed by the weekend. My school teacher says that since i\"ll only have 3-4 months till the entrance exam after i'm done with my A-levels (i finish in May-june) i need to start preparing now. I have several questions,\n-Where do I start\n-how many hours per week should i spend for this\n-what resources to consult\nIf you could kindly tell me everything that you've experienced whilst preparing for MBBS entrance exams and share resources you found helpful, it'll be more than greatly appreciated",
  "votes": "6",
  "comments": [
    {
      "text": "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can message the moderators and share the link to your post (mandatory) if you do not receive a response within a day or two.\nRule(s): Your account should have at least 5 karma points in order to submit a post.\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "If you want to admit in govt medical college, it is really tough. You need to study hard and smart both to ace the exam.Most of the candidates study 8-14 hours a day, depending on their preparation during this 3-4 months.Maybe the admission test will be on 19 December.So you should buy previous years admission qbank and skim through it. And then you will understand what new resources you may need to buy. As you are from A level, I don't know what new books you will need. Maybe you can buy the English version textbooks of HSC.\nYou need to prepare for Biology, Chemistry, Physics, BD Affairs, International Affairs, English. Please check the marks distribution.",
      "votes": "1",
      "replies": [
        {
          "text": "will the exam be in english",
          "votes": "1",
          "replies": [
            {
              "text": "Yes. You have to apply for English version question during the \"form fillup\" procedure. Then you will be provided English version question.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "You can get into the English Version course of Unmesh Medical admission course which for HSC 2025. So you can get the English version material . Also you can manage or buy English version book of physics, Chemistry, Biology of HSC syllabus. As you complete your A level in May. So you will sit the admission test with HSC 2026. From now you can go through the online class or recorded class of Unmesh so you can idea of the topic and don't lag behind from Bangla medium or English version student as they are going through this from their begining of HSC. I hope you know Medical admission test will be on HSC syllabus. You have to work little more. From now if you just give 2 or 3 hours daily for online classes and revise it. And going through the book you will be more than ready. Just you have to be consistent with your study.",
      "votes": "1",
      "replies": [
        {
          "text": "So like do i have to pay for the classes or smth or they are free\nalso if u could tell me where i could get free resources that would be great",
          "votes": "1",
          "replies": [
            {
              "text": "English Version free content are not available at a good level. If you want free resource you have go through bangla medium content. I think that will be hard for you. As you have adjusted with many bangla scientific terms. For bangla version preparation you can go through Battles of Biology ,DMC station YouTube channel.",
              "votes": "1",
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "id": 93
}