{
  "url": "https://www.reddit.com/r/bangladesh/comments/1nngjn3/bangladeshi_student_visa_ban_news/",
  "hash": "09e56f7d1175662d76c5166ccab31464",
  "scraped_at": "2025-12-10T01:18:24.600234",
  "title": "Bangladeshi student visa ban news",
  "description": "I’ve been seeing a lot of news and rumors online about visa bans on Bangladeshi students in different countries (like UAE, US, Canada, etc.). Some say it’s official, others say it’s fake news or just stricter requirements.\nDoes anyone know the real situation? Are Bangladeshi students actually banned from getting visas internationally, or is it just misinformation and policy changes?",
  "votes": "27",
  "comments": [
    {
      "text": "Check the country embassy website. Is the visa application for students still available? Check the requirements, is there any dramatic change?\nThere can be some kind of shadow ban. Usually that happens for tourist visas.",
      "votes": "26",
      "replies": [
        {
          "text": "Thanks, but there’s a rumor going around in the news that Bangladeshi students are buying IELTS questions, and that’s why internationally they’re about to ban Bangladeshi students from getting visas.",
          "votes": "1",
          "replies": [
            {
              "text": "Exactly. Rumor.",
              "votes": "8",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "There is no visa ban but of course they will do their due diligence before allowing people from the third world since everyone’s goal is immigration",
      "votes": "14",
      "replies": []
    },
    {
      "text": "The news about visa ban in UAE is confirmed to be fake.\nUAE had a soft ban on Bangladeshis for years now, except for high skilled professionals, investors and tourists. Every now and then UAE opens up visas for low-skilled workers too for a short period.",
      "votes": "6",
      "replies": [
        {
          "text": "There is a tourist visa ban as well, with some exceptions\nIt was widely open between late 2020 and 2023 but closed again",
          "votes": "2",
          "replies": []
        }
      ]
    },
    {
      "text": "This unseen ban is mainly for people whose mentality is to “mati dhore boshe thakbo”, hope these types of illegals get kicked out of the west.",
      "votes": "4",
      "replies": []
    },
    {
      "text": "There's a rise in right wing politics in the west (I live in the UK) and they are blaming immigrants for their problems. So it isn't surprising that governments are taking this stance. It is, of course, stupid as those economies would fail without immigrants.",
      "votes": "14",
      "replies": [
        {
          "text": "Yes, but the parties have disagreement over number of immigrants.",
          "votes": "2",
          "replies": [
            {
              "text": "Not really. They just don't want ANY immigrants.",
              "votes": "6",
              "replies": []
            }
          ]
        },
        {
          "text": "Then Why Poland is the Exemption?",
          "votes": "0",
          "replies": []
        }
      ]
    },
    {
      "text": "UAE ban is unofficial. Even the UAE embassy in BD confirmed that there is nothing like this.\nUS has visa restrictions close to visa ban for almost all countries, not only BD or students only.\nHowever, Canada doesn't have any yet.\nI'd still recommend checking on their web portals and not trust words from \"people\"",
      "votes": "10",
      "replies": []
    },
    {
      "text": "Check the study abroad groups, people shares their experiences.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "There's no visa ban on Bangladeshi students anywhere. Fake news.",
      "votes": "6",
      "replies": []
    },
    {
      "text": "not in uk but saying that they are taking extra video calls to verify language skills and some got their visa last week or so and some are still waiting for the visa decision now.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "I think its mainly in the US. Since we have Trump who’s trying to make visas more stricter rn. But some of my friends have been more successful in going to Canada, Australia etc",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 96
}