{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pdjh4p/female_safety_in_bangladesh/",
  "hash": "7c9c5d30e05e42a869bbbdbe0811bc51",
  "scraped_at": "2025-12-04T15:15:17.664118",
  "title": "Female safety in Bangladesh",
  "description": "Hi, is Bangladesh safe for solo female travellers? It is next to some countries whose rape statistics are not super impressive, but I also understand Bangladesh is a different country with a different culture, so just wanted to check. Thank you for your answers.",
  "votes": "0",
  "comments": [
    {
      "text": "Dress modestly and take the normal precautions you would take wherever in the world that being moving around while the streets are fairly populated ( 10:00 / 22:00 you have people all over the palce ).\nAlso be careful with the transportation. Go for Uber, Pathao and so on rather then random CNGs.\nJust watch your pockets in the markets. And don’t scrool your phone in a rickhshaw in a crowded area where somebody can snatch it.",
      "votes": "2",
      "replies": []
    },
    {
      "text": "Currently the country is not in a stable position, being a man I find it risky to go into some places.\nYou should be very aware of the surroundings, try to carry less cash, and avoid risky places after 10 pm.\nBe very careful of pathao, Uber or cng. There's been a lot of complaints about them being aggressive and all that.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "don’t go outside in places where there are less people and don’t go out after evening. spend nights at reputable safe hotels.",
      "votes": "1",
      "replies": []
    },
    {
      "text": "there are more chances of you getting catcalled or harrased in new york city in broad daylight than any major city in this country. regardless of where you are getting your grape stats from, bangladesh is obviously a conservative country so just dress modestly stay within city lights and dont go in remote places in the wrong time of the day without trustworthy people, preferrably make yourself a native friend who can help as a guide even via the cell (advice applicable to anywhere on earth) and you'll be fine. we are not unhinged savages ffs, the worst you will experience in public are stares if you look the part of an exotic foreigner",
      "votes": "1",
      "replies": []
    }
  ],
  "id": 3
}