{
  "url": "https://www.reddit.com/r/bangladesh/comments/1pd9pnv/%E0%A6%87%E0%A6%89%E0%A6%A8%E0%A6%B8_%E0%A6%B8%E0%A6%B0%E0%A6%95%E0%A6%B0_%E0%A6%95_%E0%A6%A8%E0%A6%B0%E0%A6%AC%E0%A6%9A%E0%A6%A8_%E0%A6%A6%E0%A6%AC/",
  "hash": "0b90e656ad785c23efba06379e0df5b6",
  "scraped_at": "2025-12-04T15:15:49.081361",
  "title": "ইউনুস সরকার কি নির্বাচন দেবে?",
  "description": "আজ শুনলাম নির্বাচনের কার্যক্রম স্থগিত রেখে ডিসিদের রিটার্নিং অফিসার থেকে বাদ দেওয়ার জন্য একটি রিট হয়েছে। এদিকে নাহিদের মায়ের থেকে মাসির দরদ বেশি, সে আবার বলে বসেছে খালেদা জিয়া অসুস্থ দেখে নির্বাচনের তফসিল পিছিয়ে দেওয়ার জন্য। নির্বাচন কমিশনের প্ল্যান তফসিলের ৬০ দিনের মধ্যে নির্বাচন করবে। এর আগে না। তারমানে ফেব্রুয়ারিতে রোজার আগে নির্বাচন হতে হলে ১৫ ডিসেম্বরের মধ্যে তফসিল ঘোষণা করতে হবে। যদিও তারা জানিয়ে আসছে ৭-১১ তারিখের মধ্যে নাকি তফসিল হবে তবে আল্লাহ মালুম। এদিকে তারেক জিয়া দেশে মনে হয়না আসবেন। বিএনপির মধ্যে নির্বাচনী তৎপরতা দেখা যাচ্ছেনা খালেদা জিয়ার অসুস্থতার জন্য। এদিকে ইসলামী দলগুলো ঠিকই ক্যাম্পেইন চালিয়ে যাচ্ছে। আসিফ-মাহফুজ গং এখনও চেয়ারে সুপারগ্লু লাগিয়ে বসে আছে। এরা নাকি আবার নির্বাচনও করবে। দেড় বছরে সবাই বুঝে গেছেন এই সরকারের কোনোদিনও নির্বাচন দিয়ে স্থিতিশিল বাংলাদেশ গড়ার ইচ্ছে ছিলনা। এদের মধ্যে খালি নাকি ষড়যন্ত্র চলে। এসব তালবাহানা শুনতে এখন বিশ্রি লাগে। এতদিন বলে আসছিল হাগু লীগ নাকি নির্বাচন নষ্ট করে দিবে। শেষমেশ ইউনুস সরকার নিজেই নির্বাচন বাঞ্চাল করে দেবেনা তো?",
  "votes": "10",
  "comments": [
    {
      "text": "নির্বাচন হবে বলে তো মনে হচ্ছে না অন্তত সরকারের গড়িমসি দেখে মনে হচ্ছে আরও অন্তত একবছর তাঁরা দেরি করবে বলেই মনে হয় । সম্ভবত এই মাসেই নতুন কোন ঘোষণা আসতে যাচ্ছে ।",
      "votes": "6",
      "replies": [
        {
          "text": "এরা যদি নির্বাচন পিছিয়ে দেয় তাইলে মনে করবো হিসু আপাই সঠিক ছিল। ইউনুস একটা টাউট বাটপার হিসেবে ইতিহাসের পাতায় নাম লেখাবে।",
          "votes": "3",
          "replies": [
            {
              "text": "এখন তো দেশের পরিস্থিতি দেখে কখনো কখনো মনে হয় হাসু আপা (নাকি সরি আপনার কথায় হিসু আপা) ঠিকই ছিল মনে হচ্ছে, কারন আমরা জাতি হিসেবে খুব একটা সভ্য ভব্য নই আমাদের মাথার উপর স্বৈরাচার থাকলেই আমরা খানিকটা শৃঙ্খলে থাকি।",
              "votes": "2",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "text": "আপনার কি মনে হয় জুলাই আন্দোলন কি বিএনপি করেছিলো? যারা করেছিলো তারা সব হিসাব নিকাশ করেই করেছিলো, তারা এতো সহজে বিএনপি বা অন্য কোনো দলকে ক্ষমতায় আসতে দিবে না, দলের নামটা আশা করি আন্দাজ করতে পেরেছেন।",
      "votes": "6",
      "replies": [
        {
          "text": "এসব ষড়যন্ত্র আর ভাল লাগেনা! এই সরকার পারলনা আইন শৃঙ্খলা ঠিক করতে, করলো বিএনপির দালালী, সব জঙ্গিদের ফেসিবাদের মজলুম বলে ছেড়ে দিসে। এখন একটা জগাখিচুরি বানিয়ে ক্ষমতা ধরে রাখবে! এতো লোভ কেনো একটা ৯০ বছরের বুড়ো লোকের!",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "ভাই, নির্বাচন হবে না। বিএনপি ছাড়া কেউ নির্বাচনের জন্য লাফালাফি করতেসে না।",
      "votes": "7",
      "replies": [
        {
          "text": "বিএনপি আজকাল দেখছি চুপসে গেছে। তারেক রহমানও দেশে আসছেনা। খালেদা জিয়া আল্লাহ মালুম জীবিত না মৃত। কি হচ্ছে বুঝছিনা। জামাত চিল্ড্রেন পার্টি গং তো ভোটই চায়না। বিএনপিও যদি ছেড়ে দেয় তাইলে আশা হারিয়ে ফেলব! এমন দুর্বল সরকার দিয়ে সংস্কার চলেনা, ভোট নিয়ে গরিমসি চলেনা!!",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "না।",
      "votes": "2",
      "replies": []
    },
    {
      "text": "in sha Allah hobena next year. aro 2-3 yrs evabei chalano uchit. shob line e chole ashbe",
      "votes": "-2",
      "replies": [
        {
          "text": "এভাবেই চালানো উচিত? তৌহিদী জনতার মব কিভাবে সব লাইনে আনবে বুঝিয়ে বলবেন?",
          "votes": "7",
          "replies": []
        },
        {
          "text": "বাসর রাতে বিড়ালটা মারতে পারলে দেশ ঠিক ই লাইনে চলে আসতো। এখন আর ওতো আশা নাই।\nনির্বাচন হোক। হয়ে যাওয়াই ভালো।",
          "votes": "6",
          "replies": []
        },
        {
          "text": "সেনাবাহিনী কন্ট্রল সরকার হলে বুঝতাম। এই এনজিও সরকারের এই বছরের ফেব্রুয়ারিতেই ভোট দেওয়া উচিত ছিল।",
          "votes": "3",
          "replies": []
        }
      ]
    },
    {
      "text": "",
      "votes": "-8",
      "replies": []
    }
  ],
  "id": 5
}